[{"name":"\"Hyper\" Rod","img":"https://lumiere-a.akamaihd.net/v1/images/hyper-rod-main_a834e5e3.jpeg?region=554%2C0%2C813%2C813","detail":"In his specially-modified Seven Deuce Blaster, riot racer \"Hyper\" Rod is a reprogrammed protocol droid who now focuses on the uncivilized task of eliminating his opponents at the Safa Toma Speedway."},{"name":"\"Quick-Draw\" Quasar","img":"https://lumiere-a.akamaihd.net/v1/images/quick-draw-quasar-main_d5ef9990.jpeg?region=554%2C0%2C813%2C813","detail":"An amalgamation of droid parts, riot racer \"Quick-Draw\" Quasar has the body of a protocol series droid and the head of a B1 battle bot. Painted with a splash of purple and yellow, he puts his strategic programming to work."},{"name":"\"Steel Claw\" Kane","img":"https://lumiere-a.akamaihd.net/v1/images/steel-claw-kane-main_ede943f9.jpeg?region=554%2C0%2C813%2C813","detail":"At the Safa Toma riot races, \"Steel Claw\" Kane routinely works with champion Jet Venim to grab hold of opponents who threaten Venim's pole position. His eponymous gadget is deployed in a maneuver called \"The Crunch,\" violently yanking a second-place racer out of the running."},{"name":"\"The Trickster\" Flash Raktor","img":"https://lumiere-a.akamaihd.net/v1/images/the-trickster-flash-raktor_b84df8a2.jpeg?region=953%2C0%2C814%2C813","detail":"Perhaps riot racer Flash Raktor gets his nickname, \"The Trickster,\" from the dissonance of his programming and profession. Once a protocol droid, with databanks filled with languages and etiquette rules, Flash has been heavily modified to become a contender at the Safa Toma Speedway. "},{"name":"2BR-NTB","img":"https://lumiere-a.akamaihd.net/v1/images/2br-ntb-main_081ce1aa.jpeg?region=618%2C87%2C633%2C633","detail":"Loyal to Norath Kev, the droid 2BR-NTB has a distinct green-and-red paint scheme and sensors attuned to impending danger."},{"name":"4-LOM","img":"https://lumiere-a.akamaihd.net/v1/images/curve_4lom_a7640432.jpeg?region=0%2C12%2C230%2C230","detail":"A rusty droid with insectile features, 4-LOM was originally a protocol droid, but logic glitches allowed him to escape his programming and become a bounty hunter. That proved a perfect occupation for the cold, calculating mechanical."},{"name":"4D-M1N","img":"https://lumiere-a.akamaihd.net/v1/images/resistance-db-4d-m1n-main-image_2a163064.jpeg?region=341%2C0%2C878%2C878","detail":"When Captain Doza needs guests escorted into Doza Tower or messages relayed to citizens of the Colossus platform, he calls upon his loyal droid 4D-M1N to act as liaison, rarely leaving the gleaming corridors surrounding his private office and living quarters. "},{"name":"5-L","img":"https://lumiere-a.akamaihd.net/v1/images/5-l-main_c6302f4f.jpeg?region=111%2C22%2C698%2C698","detail":"A mouse droid serving aboard a First Order Star Destroyer, 5-L is briefly reprogrammed to serve Tam Ryvora on a covert mission to return to her friends aboard the Colossus."},{"name":"8D8","img":"https://lumiere-a.akamaihd.net/v1/images/astromech-jabba-s-palace-main_cdc9691a.jpeg?region=460%2C0%2C538%2C536","detail":"A lanky smelter droid, during the time of the Empire 8D8 assisted EV-9D9 in terrorizing Jabba the Hutt's droid operatives. But after the fall of the Empire, under Boba Fett's employ 8D8 was reassigned to assist with strategy and diplomacy."},{"name":"Aayla Secura","img":"https://lumiere-a.akamaihd.net/v1/images/databank_aaylasecura_01_169_39a65af2.jpeg?region=636%2C0%2C878%2C878","detail":"With an athletic build, an exotic beauty, and blue skin, Aayla Secura stood out among the many faces of the Jedi ranks. A cunning warrior and Jedi Knight during the rise of the Clone Wars, Aayla fought alongside Clone Commander Bly on many exotic battlefields. Having mastered the emotional detachment necessary in the Jedi Order, she always tried to pass on what she had learned to others. Aayla was killed, along with many other Jedi Generals, when her troops turned on her in reaction to Supreme Chancellor Palpatine’s broadcast of Order 66.    "},{"name":"Adi Gallia","img":"https://lumiere-a.akamaihd.net/v1/images/databank_adigallia_169_8b798f27.jpeg?region=265%2C0%2C878%2C878","detail":"Jedi Master Adi Gallia was a member of the Order's High Council during the Clone Wars. She and the other members of that ruling body would convene in a temple high above the Coruscant landscape, deciding important matters of the Jedi. Stern and focused, she would remark upon the more outrageous tactics carried out by Anakin Skywalker or Obi-Wan Kenobi in the course of the war, but would rarely condemn their effective actions. Though not as brash as Anakin, Adi Gallia was known to be an aggressive warrior who had no problem bringing the fight to the enemy."},{"name":"Admiral Ackbar","img":"https://lumiere-a.akamaihd.net/v1/images/databank_ackbar_01_169_55137220.jpeg?region=209%2C0%2C877%2C878","detail":"A veteran commander, Ackbar led the defense of his homeworld, Mon Cala, during the Clone Wars and then masterminded the rebel attack on the second Death Star at the Battle of Endor. Ackbar realized the rebels had been drawn into a trap at Endor, but adjusted, with his fleet buying valuable time for the attack to succeed. After the Battle of Endor, Ackbar became a Grand Admiral in the New Republic, winning many victories including the pivotal Battle of Jakku. He retired to Mon Cala, but was coaxed back into service with the Resistance by Leia Organa."},{"name":"Admiral Coburn","img":"https://lumiere-a.akamaihd.net/v1/images/databank_admiralcoburn_01_169_8db29cff.jpeg?region=341%2C0%2C878%2C878","detail":"With a stern face, steely glare and unmistakable command presence, Admiral Coburn served at the side of General Plo Koon during the Clone Wars. The taciturn fleet officer measured his words precisely, offering clear commands in a clipped accent. Coburn's rigid military discipline served him well in executing some of the more daring missions under Jedi leadership. He commanded  a four-cruiser task force into the thick of a Separatist fleet cordon over Lola Sayu to facilitate the rescue of a strike team that invaded the Citadel installation. Coburn also led a Jedi light cruiser in extracting prisoners from the Zygerrian slave processing facility on Kadavo, steering the vessel dangerously close to the facility."},{"name":"Admiral Garrick Versio","img":"https://lumiere-a.akamaihd.net/v1/images/admiral-versio_b06dd6c5.jpeg?region=542%2C0%2C877%2C878","detail":"An accomplished naval officer who brought his home world of Vardos under Imperial control, Garrick Versio was reassigned and promoted to Admiral following the destruction of the Death Star over Yavin 4. Garrick formed Inferno Squad to ensure nothing of the sort would happen again. Loyalty to the Empire is Admiral Versio’s first priority."},{"name":"Admiral Griss","img":"https://lumiere-a.akamaihd.net/v1/images/admiral-griss-main_d6144ea9.jpeg?region=340%2C0%2C853%2C853","detail":"A veteran First Order officer, Frantis Griss commands the Steadfast and its battlegroup and sits on the Supreme Council. He has an excellent relationship with Allegiant General Pryde, which proves useful when the First Order must coordinate its efforts with the Sith armada revealed at Exegol."},{"name":"Admiral Karius","img":"https://lumiere-a.akamaihd.net/v1/images/admiral-karius-main_d32a0001.jpeg?region=280%2C0%2C720%2C720","detail":"An intimidating mix of machine and man, Admiral Karius serves as Darth Vader’s second-in-command on Mustafar. Stern and unforgiving, he intends to see to it personally that the captain of the Windfall doesn’t survive their stay at Fortress Vader."},{"name":"Admiral Kassius Konstantine","img":"https://lumiere-a.akamaihd.net/v1/images/image_55c96977.jpeg?region=273%2C0%2C901%2C901","detail":"Admiral Kassius Konstantine was a leading officer on an Imperial Star Destroyer. Konstantine, however, ultimately answered to the Inquisitor, and took his ship wherever the Jedi hunter ordered him to."},{"name":"Admiral Kilian","img":"https://lumiere-a.akamaihd.net/v1/images/databank_admiralkillian_01_169_398fb91c.jpeg?region=590%2C0%2C878%2C878","detail":"A by-the-manuals Republic officer, Admiral Kilian runs a tight ship. Nonetheless, a saboteur was able to slip into the clone cadet ranks during a training tour over Vanqor, and cripple the Jedi cruiser Endurance. Kilian, following naval tradition, refused to abandon ship. He became a hostage of notorious bounty hunters seeking revenge against the Jedi Order."},{"name":"Admiral Motti","img":"https://lumiere-a.akamaihd.net/v1/images/databank_admiralmotti_01_169_f01d2570.jpeg?region=417%2C0%2C878%2C878","detail":"A young, ambitious Imperial officer from the Outer Rim world of Seswenna, Admiral Motti saw the Death Star as the ultimate power in the universe, and burned to use that power against any who dared challenge the Empire. The commander of the Star Destroyer Steel Talon, he served as one of the Imperial military’s Joint Chiefs, becoming an ally of Grand Moff Tarkin’s and head of naval operations aboard the Death Star. He died when the battle station was destroyed."},{"name":"Admiral Ozzel","img":"https://lumiere-a.akamaihd.net/v1/images/e5d_ia_1189_6c16bed1.jpeg?region=144%2C0%2C808%2C809","detail":"Admiral Ozzel commanded the Super Star Destroyer Executor, Darth Vader's mighty flagship and the linchpin of the squadron searching the galaxy for the Alliance's secret base. Ozzel led the initial attack on Hoth, but his choice of tactics infuriated Vader, leading to a sudden and permanent demotion."},{"name":"Admiral Piett","img":"https://lumiere-a.akamaihd.net/v1/images/databank_admiralpiett_01_169_18014135.jpeg?region=423%2C0%2C877%2C878","detail":"An ambitious Imperial officer, Piett rose through the ranks to captain and was assigned to the Super Star Destroyer Executor, Darth Vader's flagship. There, he chafed at having to serve under the foolish, vainglorious Admiral Ozzel. When Vader strangled Ozzel, Piett was granted a battlefield promotion to admiral -- and given a grisly warning of the penalty for failure. Miraculously, he survived his time as Vader's underling, but died when a Rebel starfighter destroyed the Executor's command bridge."},{"name":"Admiral Raddus","img":"https://lumiere-a.akamaihd.net/v1/images/admiral-raddus-main_33194c80.jpeg?region=19%2C0%2C877%2C878","detail":"A gruff Mon Calamari officer, Raddus commands the rebel starfleet before the Battle of Yavin, working to knit a hodgepodge of ships into a military force and arrange the delivery of new capital ships to the Alliance. Raddus has little patience for the rebel council’s endless committee meetings. As he sees it, military muscle is the key to defeating the Empire, not stirring speeches."},{"name":"Admiral Statura","img":"https://lumiere-a.akamaihd.net/v1/images/admiral-statura_42dcca12.jpeg?region=116%2C138%2C661%2C661","detail":"A veteran Resistance officer, Statura fought to liberate his homeworld of Garel from the Empire while he was just a teenager. Later, Leia Organa recruited him to handle ship procurement and logistics for the Resistance. The technically savvy Statura helped identify the thermal oscillator as the key target in the Resistance’s attack on Starkiller Base."},{"name":"Admiral Trench","img":"https://lumiere-a.akamaihd.net/v1/images/admiral-trench-main_8da89427.jpeg?region=351%2C0%2C545%2C544","detail":"A Separatist admiral known for his cunning and ruthlessness, Trench commands the Separatist blockade of Christophsis, where Senator Bail Organa and his relief effort are pinned down and in danger of capture. Although Anakin Skywalker outwits him and Trench's flagship is destroyed, the skilled tactician survives to fight another day thanks to an array of cybernetic implants."}]