[{"name":"79's","img":"https://lumiere-a.akamaihd.net/v1/images/image_7f322dba.jpeg?region=0%2C62%2C753%2C754","detail":"79’s was a bar located on Coruscant, particularly popular with clone troopers. While off duty, Republic soldiers would gather at the cantina to relax, drink, and blow off steam, often making rowdy toasts. When clone trooper Fives uncovered the conspiracy of Order 66, he went to 79’s in search of fellow soldier Kix, knowing that’s where his friend would most likely be."},{"name":"Abafar","img":"https://lumiere-a.akamaihd.net/v1/images/databank_abafar_01_169_475b5d42.jpeg?region=683%2C0%2C877%2C878","detail":"A remote world in the Outer Rim Territories, Abafar is scarcely populated. It is dominated by vast stretches of featureless desert under oppressive orange skies. The strange regolith that covers the surface twists light in such a way as to obscure shadows and leave no tracks. Particulates in the atmosphere cause the sunlight to diffuse into a uniform orange glow, so it is nearly impossible to tell direction or time of day. The huge stretches of featureless expanse are known as The Void. Pons Ora is one of the few settlements on Abafar, and it is the site of a Rhydonium mining installation operated by the Separatists during the Clone Wars."},{"name":"Aeos Prime","img":"https://lumiere-a.akamaihd.net/v1/images/aeos-prime-main_1af6e847.jpeg?region=280%2C0%2C720%2C720","detail":"After scouring the Outer Rim territories, the Colossus finds a new home on the planet Aeos Prime. But among the shimmering caverns and outcroppings are remnants of another society and a deadly visit from the First Order."},{"name":"Agamar","img":"https://lumiere-a.akamaihd.net/v1/images/agamar_9044714e.jpeg?region=520%2C0%2C878%2C878","detail":"A barren world of frost and rock, Agamar was the site of a Clone Wars battle between the Republic and Separatists. Years after the end of the war, Clone War veteran Captain Rex and a band of rebels visited the planet searching for weapons, and encountered a still-active reserve of Separatist droids. The Super Tactical Droid commander demanded they have one last battle to decide the war, but the groups ultimately joined forces to take on a common enemy: the Empire."},{"name":"Ahch-To","img":"https://lumiere-a.akamaihd.net/v1/images/ahch-to-db-main_d13ac48c.jpeg?region=473%2C0%2C720%2C720","detail":"An uncharted world located deep in the galaxy’s Unknown Regions, Ahch-To is the world where the Jedi Order was founded, and its sacred island is the site of the first Jedi Temple. Luke Skywalker discovered the lost world after a long search, and chose it as his place of exile – only to have Rey find her way to his lonely island."},{"name":"Ahch-To Jedi Temple","img":"https://lumiere-a.akamaihd.net/v1/images/ep8-231017_r_e829cffb.jpeg?region=193%2C0%2C720%2C720","detail":"The first temple of the Jedi Order sits atop Ahch-To’s sacred island, high above the surrounding sea. The temple has been worn away by wind and time, but a visitor will still find mosaics depicting the first Jedi and an ancient meditation ledge. This spot is where Rey takes her next steps into a larger world."},{"name":"Ahch-To Mirror Cave","img":"https://lumiere-a.akamaihd.net/v1/images/last-jedi-databank-ahch-to-mirror-cave-main-image_e16a6e7a.jpeg?region=524%2C0%2C538%2C536","detail":"Ahch-To’s Jedi temple is a concentration of light, but one balanced by a place that’s strong with the dark side of the Force: a cold and forbidding sea cave near the heaving sea. Rey is drawn to this dangerous nexus, which tempts her with the promise of hidden knowledge."},{"name":"Ajan Kloss","img":"https://lumiere-a.akamaihd.net/v1/images/ajan-kloss-main_1cbd44e9.jpeg?region=220%2C0%2C841%2C841","detail":"Originally scouted as a potential site for a Rebel Alliance base, at the behest of General Leia Organa Ajan Kloss served as a secluded outpost after the Battle of Endor, becoming a training ground for the Jedi Luke Skywalker. Years later, it serves a similar function as home of Resistance fighters and a place for Rey to continue her training."},{"name":"Ajan Kloss Resistance Base","img":"https://lumiere-a.akamaihd.net/v1/images/ajan-kloss-resistance-base-main_58e2218a.jpeg?region=235%2C0%2C854%2C854","detail":"Prior to the outbreak of the Galactic Civil War, Alderaanian scouts charted Ajan Kloss as a potential home for the Rebel Alliance. Under the tyranny of the First Order, General Leia Organa returns to the lush forest planet to bring the last remnants of the cause together."},{"name":"Aldera spaceport","img":"https://lumiere-a.akamaihd.net/v1/images/alderaan-royal-speeder-main_e6d0c056.jpeg?region=493%2C30%2C710%2C710","detail":"As the bustling capital city of Alderaan, Aldera includes modern and well-maintained port facilities, such as private landing platforms dedicated to the arrival of royal visitors and returning dignitaries. "},{"name":"Alderaan","img":"https://lumiere-a.akamaihd.net/v1/images/alderaan-main_f5b676cf.jpeg?region=360%2C0%2C720%2C720","detail":"If ever one needed an example of the irredeemable evil of the Empire, look no further than the shattered remains of Alderaan. A peaceful world of lush valleys and snow-capped mountains, Alderaan was once regarded for its natural beauty, its tranquility, and the sophistication of its arts and culture. Before the Imperial uprising, Alderaan was represented in the waning days of the Republic by such venerated politicians as Bail Organa. In fact, Alderaan was one of the earliest supporters of the Alliance to Restore the Republic, though its officials prudently kept all ties to the Rebellion secret. Despite such discretion, the Empire knew it to be a haven of rebel activity, making it a target of reprisal as soon as the Death Star was operational."},{"name":"Aldhani","img":"https://lumiere-a.akamaihd.net/v1/images/aldhani-main_71e8062e.jpeg?region=803%2C1%2C807%2C803","detail":"A world of lush, green highlands and sparkling, clear waterways, Aldhani has been occupied by the Empire for over a decade. Beneath the surface, a cultural clash is brewing. While the native Dhanis revere the lands and valleys as sacred, the Empire values the territory for tactical advantage, and has displaced many of the locals and deterred their most sacred rituals."},{"name":"Aleen","img":"https://lumiere-a.akamaihd.net/v1/images/databank_aleen_01_169_40bcb2df.jpeg?region=341%2C0%2C878%2C878","detail":"A rocky, temperate world found in the Mid Rim of the galaxy, the planet Aleen is known for its friendly, boisterous natives, the Aleena, who have traveled throughout the galaxy. Beneath Aleen's ground are other civilizations, unknown to the surface world or to the Republic. A series of devastating groundquakes suffered by the planet during the Clone Wars exposed passageways that connected the exterior and interior worlds."},{"name":"Anchorhead","img":"https://lumiere-a.akamaihd.net/v1/images/anchorhead-main_2153c70c.jpeg?region=280%2C0%2C720%2C720","detail":"A small, quiet town on Tatooine, Anchorhead is made up mostly of settlers and farmers who have banded together to form a tight-knit community."},{"name":"Anchorhead general store","img":"https://lumiere-a.akamaihd.net/v1/images/anchorhead-general-store-main_25c97357.jpeg?region=469%2C0%2C538%2C536","detail":"Settlers in the outlying lands of Mos Eisley make regular treks into town to pick up supplies from the reliable Anchorhead General Store. In his youth, Luke Skywalker often raced ahead of his uncle on such visits, eager to look at whatever new technological wares may have arrived since their last visit. "},{"name":"Arcana","img":"https://lumiere-a.akamaihd.net/v1/images/arcana-main_4d93dd3a.jpeg?region=558%2C0%2C804%2C804","detail":"Arcana is an ancient world marked by crumbling ruins. Within its forgotten subterranean chambers are secrets from a long-ago age and clues to the mystery surrounding the disappearance of Grand Admiral Thrawn and Ezra Bridger."},{"name":"Archeon Nebula","img":"https://lumiere-a.akamaihd.net/v1/images/archeon-nebula_8421844d.jpeg?region=406%2C0%2C878%2C878","detail":"A fiery mass of forming stars, the Archeon Nebula is beautiful yet extremely dangerous. Passing ships often burn up within minutes upon entering, with the heat literally peeling craft apart. The Ghost crew and Gold Squadron navigated the Archeon Nebula, while battling TIE fighters, in order to deliver Mon Mothma to a pivotal meeting."},{"name":"Armorer's workshop","img":"https://lumiere-a.akamaihd.net/v1/images/armorer-s-workship-main_7d40ad3e.jpeg?region=372%2C0%2C536%2C536","detail":"The Armorer's workshop on the planet Nevarro is tucked away deep underground in the passageways of the sewer system. Marked by a beskar mythosaur skull, here a clan of Mandalorians gather in secret."},{"name":"Arvala-7","img":"https://lumiere-a.akamaihd.net/v1/images/arvala-7-main_c0f2284a.jpeg?region=396%2C0%2C535%2C536","detail":"On the frontier world of Arvala-7, the cracked landscape of hardened mud gives way to dust clouds and viscous mud flats. The planet is sparsely populated, but intrepid vapor farmers eke out a meager living, trading with Jawa settlers."},{"name":"Ashas Ree","img":"https://lumiere-a.akamaihd.net/v1/images/zro-ff-003387_29dc5bc0.jpeg?region=336%2C0%2C720%2C720","detail":"At first glance the lush green vistas of Ashas Ree seem exotic and inviting, but the planet harbors an ancient and dark history. The recent excavation of an old Sith temple has sent the local villagers fleeing in fear, and the destructive power of the dark side ripples from the sacred site like a beacon of doom. Before making a hasty departure, villagers left behind warnings to any visitors who might mistake the beautiful landscape for a welcoming retreat. \"Beware. Evil. Get Away.\""},{"name":"Ashas Ree Temple of the Force","img":"https://lumiere-a.akamaihd.net/v1/images/zro-ff-003395_3d090a05.jpeg?region=411%2C0%2C720%2C720","detail":"Like a tomb, the Temple of the Force on Ashas Ree is a quiet and venerable place strong with the Force. Treasure hunter Mika Grey recently unearthed a Sith temple below, sending the local villagers who made their home at the surrounding outpost fleeing. Now the ruins seem to be abandoned, save for the far-off whisper of an old woman distantly beckoning from inside. Deep at the heart of the temple, an ancient Sith relic thrums to life."},{"name":"Asteroid Belt Gas Refinery","img":"https://lumiere-a.akamaihd.net/v1/images/asteroid-belt-gas-refinery_8fa2f384.jpeg?region=341%2C0%2C878%2C878","detail":"Built on a small planetoid, the Asteroid Belt Gas Refinery operated in league with the Empire. Mining boss Yushyn led the operation with an unrelenting fervor; when massive purrgil creatures would come near the gas, he ordered his men to destroy them. Ultimately, the Ghost crew found the facility, stole its fuel for the rebellion, saved the purrgil, and destroyed the complex."},{"name":"Asteroid Field","img":"https://lumiere-a.akamaihd.net/v1/images/image_0cf9f654.jpeg?region=420%2C0%2C1080%2C1080","detail":"Asteroid fields, consisting of asteroid clusters of varying size, can be found throughout the galaxy, including the Hoth system. Due to their unpredictability, asteroid fields are near impossible to navigate in a starship. However, certain creatures have been known to live on or inside the rocks themselves, and bases like Fort Anaxes have been built on larger masses."},{"name":"Atollon","img":"https://lumiere-a.akamaihd.net/v1/images/atollon_2b7a5ec2.jpeg?region=341%2C0%2C878%2C878","detail":"A remote world of rock, the rebellion sought to establish a secret base on Atollon. But the planet was not as devoid of life as originally believed. Giant, multi-legged, spider-like creatures called krykna lived below the surface. They were aggressive beasts and relentlessly attacked the rebels. Eventually, the freedom fighters were able to repel the krykna using sensor markers and could keep their new home base."}]