[{"name":"79's","img":"https://lumiere-a.akamaihd.net/v1/images/image_7f322dba.jpeg?region=0%2C62%2C753%2C754","detail":"79’s was a bar located on Coruscant, particularly popular with clone troopers. While off duty, Republic soldiers would gather at the cantina to relax, drink, and blow off steam, often making rowdy toasts. When clone trooper Fives uncovered the conspiracy of Order 66, he went to 79’s in search of fellow soldier Kix, knowing that’s where his friend would most likely be."},{"name":"Abafar","img":"https://lumiere-a.akamaihd.net/v1/images/databank_abafar_01_169_475b5d42.jpeg?region=683%2C0%2C877%2C878","detail":"A remote world in the Outer Rim Territories, Abafar is scarcely populated. It is dominated by vast stretches of featureless desert under oppressive orange skies. The strange regolith that covers the surface twists light in such a way as to obscure shadows and leave no tracks. Particulates in the atmosphere cause the sunlight to diffuse into a uniform orange glow, so it is nearly impossible to tell direction or time of day. The huge stretches of featureless expanse are known as The Void. Pons Ora is one of the few settlements on Abafar, and it is the site of a Rhydonium mining installation operated by the Separatists during the Clone Wars."},{"name":"Aeos Prime","img":"https://lumiere-a.akamaihd.net/v1/images/aeos-prime-main_1af6e847.jpeg?region=280%2C0%2C720%2C720","detail":"After scouring the Outer Rim territories, the Colossus finds a new home on the planet Aeos Prime. But among the shimmering caverns and outcroppings are remnants of another society and a deadly visit from the First Order."},{"name":"Agamar","img":"https://lumiere-a.akamaihd.net/v1/images/agamar_9044714e.jpeg?region=520%2C0%2C878%2C878","detail":"A barren world of frost and rock, Agamar was the site of a Clone Wars battle between the Republic and Separatists. Years after the end of the war, Clone War veteran Captain Rex and a band of rebels visited the planet searching for weapons, and encountered a still-active reserve of Separatist droids. The Super Tactical Droid commander demanded they have one last battle to decide the war, but the groups ultimately joined forces to take on a common enemy: the Empire."},{"name":"Ahch-To","img":"https://lumiere-a.akamaihd.net/v1/images/ahch-to-db-main_d13ac48c.jpeg?region=473%2C0%2C720%2C720","detail":"An uncharted world located deep in the galaxy’s Unknown Regions, Ahch-To is the world where the Jedi Order was founded, and its sacred island is the site of the first Jedi Temple. Luke Skywalker discovered the lost world after a long search, and chose it as his place of exile – only to have Rey find her way to his lonely island."},{"name":"Ahch-To Jedi Temple","img":"https://lumiere-a.akamaihd.net/v1/images/ep8-231017_r_e829cffb.jpeg?region=193%2C0%2C720%2C720","detail":"The first temple of the Jedi Order sits atop Ahch-To’s sacred island, high above the surrounding sea. The temple has been worn away by wind and time, but a visitor will still find mosaics depicting the first Jedi and an ancient meditation ledge. This spot is where Rey takes her next steps into a larger world."},{"name":"Ahch-To Mirror Cave","img":"https://lumiere-a.akamaihd.net/v1/images/last-jedi-databank-ahch-to-mirror-cave-main-image_e16a6e7a.jpeg?region=524%2C0%2C538%2C536","detail":"Ahch-To’s Jedi temple is a concentration of light, but one balanced by a place that’s strong with the dark side of the Force: a cold and forbidding sea cave near the heaving sea. Rey is drawn to this dangerous nexus, which tempts her with the promise of hidden knowledge."},{"name":"Ajan Kloss","img":"https://lumiere-a.akamaihd.net/v1/images/ajan-kloss-main_1cbd44e9.jpeg?region=220%2C0%2C841%2C841","detail":"Originally scouted as a potential site for a Rebel Alliance base, at the behest of General Leia Organa Ajan Kloss served as a secluded outpost after the Battle of Endor, becoming a training ground for the Jedi Luke Skywalker. Years later, it serves a similar function as home of Resistance fighters and a place for Rey to continue her training."},{"name":"Ajan Kloss Resistance Base","img":"https://lumiere-a.akamaihd.net/v1/images/ajan-kloss-resistance-base-main_58e2218a.jpeg?region=235%2C0%2C854%2C854","detail":"Prior to the outbreak of the Galactic Civil War, Alderaanian scouts charted Ajan Kloss as a potential home for the Rebel Alliance. Under the tyranny of the First Order, General Leia Organa returns to the lush forest planet to bring the last remnants of the cause together."},{"name":"Aldera spaceport","img":"https://lumiere-a.akamaihd.net/v1/images/alderaan-royal-speeder-main_e6d0c056.jpeg?region=493%2C30%2C710%2C710","detail":"As the bustling capital city of Alderaan, Aldera includes modern and well-maintained port facilities, such as private landing platforms dedicated to the arrival of royal visitors and returning dignitaries. "},{"name":"Alderaan","img":"https://lumiere-a.akamaihd.net/v1/images/alderaan-main_f5b676cf.jpeg?region=360%2C0%2C720%2C720","detail":"If ever one needed an example of the irredeemable evil of the Empire, look no further than the shattered remains of Alderaan. A peaceful world of lush valleys and snow-capped mountains, Alderaan was once regarded for its natural beauty, its tranquility, and the sophistication of its arts and culture. Before the Imperial uprising, Alderaan was represented in the waning days of the Republic by such venerated politicians as Bail Organa. In fact, Alderaan was one of the earliest supporters of the Alliance to Restore the Republic, though its officials prudently kept all ties to the Rebellion secret. Despite such discretion, the Empire knew it to be a haven of rebel activity, making it a target of reprisal as soon as the Death Star was operational."},{"name":"Aldhani","img":"https://lumiere-a.akamaihd.net/v1/images/aldhani-main_71e8062e.jpeg?region=803%2C1%2C807%2C803","detail":"A world of lush, green highlands and sparkling, clear waterways, Aldhani has been occupied by the Empire for over a decade. Beneath the surface, a cultural clash is brewing. While the native Dhanis revere the lands and valleys as sacred, the Empire values the territory for tactical advantage, and has displaced many of the locals and deterred their most sacred rituals."},{"name":"Aleen","img":"https://lumiere-a.akamaihd.net/v1/images/databank_aleen_01_169_40bcb2df.jpeg?region=341%2C0%2C878%2C878","detail":"A rocky, temperate world found in the Mid Rim of the galaxy, the planet Aleen is known for its friendly, boisterous natives, the Aleena, who have traveled throughout the galaxy. Beneath Aleen's ground are other civilizations, unknown to the surface world or to the Republic. A series of devastating groundquakes suffered by the planet during the Clone Wars exposed passageways that connected the exterior and interior worlds."},{"name":"Anchorhead","img":"https://lumiere-a.akamaihd.net/v1/images/anchorhead-main_2153c70c.jpeg?region=280%2C0%2C720%2C720","detail":"A small, quiet town on Tatooine, Anchorhead is made up mostly of settlers and farmers who have banded together to form a tight-knit community."},{"name":"Anchorhead general store","img":"https://lumiere-a.akamaihd.net/v1/images/anchorhead-general-store-main_25c97357.jpeg?region=469%2C0%2C538%2C536","detail":"Settlers in the outlying lands of Mos Eisley make regular treks into town to pick up supplies from the reliable Anchorhead General Store. In his youth, Luke Skywalker often raced ahead of his uncle on such visits, eager to look at whatever new technological wares may have arrived since their last visit. "},{"name":"Arcana","img":"https://lumiere-a.akamaihd.net/v1/images/arcana-main_4d93dd3a.jpeg?region=558%2C0%2C804%2C804","detail":"Arcana is an ancient world marked by crumbling ruins. Within its forgotten subterranean chambers are secrets from a long-ago age and clues to the mystery surrounding the disappearance of Grand Admiral Thrawn and Ezra Bridger."},{"name":"Archeon Nebula","img":"https://lumiere-a.akamaihd.net/v1/images/archeon-nebula_8421844d.jpeg?region=406%2C0%2C878%2C878","detail":"A fiery mass of forming stars, the Archeon Nebula is beautiful yet extremely dangerous. Passing ships often burn up within minutes upon entering, with the heat literally peeling craft apart. The Ghost crew and Gold Squadron navigated the Archeon Nebula, while battling TIE fighters, in order to deliver Mon Mothma to a pivotal meeting."},{"name":"Armorer's workshop","img":"https://lumiere-a.akamaihd.net/v1/images/armorer-s-workship-main_7d40ad3e.jpeg?region=372%2C0%2C536%2C536","detail":"The Armorer's workshop on the planet Nevarro is tucked away deep underground in the passageways of the sewer system. Marked by a beskar mythosaur skull, here a clan of Mandalorians gather in secret."},{"name":"Arvala-7","img":"https://lumiere-a.akamaihd.net/v1/images/arvala-7-main_c0f2284a.jpeg?region=396%2C0%2C535%2C536","detail":"On the frontier world of Arvala-7, the cracked landscape of hardened mud gives way to dust clouds and viscous mud flats. The planet is sparsely populated, but intrepid vapor farmers eke out a meager living, trading with Jawa settlers."},{"name":"Ashas Ree","img":"https://lumiere-a.akamaihd.net/v1/images/zro-ff-003387_29dc5bc0.jpeg?region=336%2C0%2C720%2C720","detail":"At first glance the lush green vistas of Ashas Ree seem exotic and inviting, but the planet harbors an ancient and dark history. The recent excavation of an old Sith temple has sent the local villagers fleeing in fear, and the destructive power of the dark side ripples from the sacred site like a beacon of doom. Before making a hasty departure, villagers left behind warnings to any visitors who might mistake the beautiful landscape for a welcoming retreat. \"Beware. Evil. Get Away.\""},{"name":"Ashas Ree Temple of the Force","img":"https://lumiere-a.akamaihd.net/v1/images/zro-ff-003395_3d090a05.jpeg?region=411%2C0%2C720%2C720","detail":"Like a tomb, the Temple of the Force on Ashas Ree is a quiet and venerable place strong with the Force. Treasure hunter Mika Grey recently unearthed a Sith temple below, sending the local villagers who made their home at the surrounding outpost fleeing. Now the ruins seem to be abandoned, save for the far-off whisper of an old woman distantly beckoning from inside. Deep at the heart of the temple, an ancient Sith relic thrums to life."},{"name":"Asteroid Belt Gas Refinery","img":"https://lumiere-a.akamaihd.net/v1/images/asteroid-belt-gas-refinery_8fa2f384.jpeg?region=341%2C0%2C878%2C878","detail":"Built on a small planetoid, the Asteroid Belt Gas Refinery operated in league with the Empire. Mining boss Yushyn led the operation with an unrelenting fervor; when massive purrgil creatures would come near the gas, he ordered his men to destroy them. Ultimately, the Ghost crew found the facility, stole its fuel for the rebellion, saved the purrgil, and destroyed the complex."},{"name":"Asteroid Field","img":"https://lumiere-a.akamaihd.net/v1/images/image_0cf9f654.jpeg?region=420%2C0%2C1080%2C1080","detail":"Asteroid fields, consisting of asteroid clusters of varying size, can be found throughout the galaxy, including the Hoth system. Due to their unpredictability, asteroid fields are near impossible to navigate in a starship. However, certain creatures have been known to live on or inside the rocks themselves, and bases like Fort Anaxes have been built on larger masses."},{"name":"Atollon","img":"https://lumiere-a.akamaihd.net/v1/images/atollon_2b7a5ec2.jpeg?region=341%2C0%2C878%2C878","detail":"A remote world of rock, the rebellion sought to establish a secret base on Atollon. But the planet was not as devoid of life as originally believed. Giant, multi-legged, spider-like creatures called krykna lived below the surface. They were aggressive beasts and relentlessly attacked the rebels. Eventually, the freedom fighters were able to repel the krykna using sensor markers and could keep their new home base."},{"name":"Aunt Z's Tavern","img":"https://lumiere-a.akamaihd.net/v1/images/resistance-db-aunt-z-tavern-main-image_f866cfea.jpeg?region=515%2C0%2C878%2C878","detail":"On the Colossus platform, Aunt Z runs the most popular eatery around with prime views on race days and relaxing games to pass the time. When mechanics and pilots need a change of scenery and camaraderie on their down time, this is their top choice for a hang out."},{"name":"Aynaboni","img":"https://lumiere-a.akamaihd.net/v1/images/aynaboni-main_7e718671.jpeg?region=554%2C0%2C813%2C813","detail":"The tranquil beaches of Aynaboni are perfect for relaxing and fishing in the glistening waters, as long as one doesn't disturb the wildlife."},{"name":"Babu Frik’s workshop","img":"https://lumiere-a.akamaihd.net/v1/images/babu-frik-s-workshop-main_dda0f457.jpeg?region=168%2C0%2C853%2C853","detail":"Located in the heart of Kijimi City’s Thieves Quarter, Babu Frik’s workshop is a squat blockhouse overflowing with gear and droid parts. People from all across Kijimi City come to the workshop to do business with Babu, but he only performs “special modifications” for his patrons, the Spice Runners, who have made him an honorary member."},{"name":"Bahryn","img":"https://lumiere-a.akamaihd.net/v1/images/bahryn_f2d793df.jpeg?region=409%2C0%2C877%2C878","detail":"An icy moon of Geonosis, Bahryn was a barren, frigid world -- a stark difference to the arid planet it orbited. Only life forms adaptable to extreme cold, such as the massive bonzami, could survive its freezing temperatures. The rebel Zeb and the ISB agent Kallus crash landed on Bahryn, and had to work together to survive its harsh conditions."},{"name":"Balmorra","img":"https://lumiere-a.akamaihd.net/v1/images/balmorra-main_a886cbd5.jpeg?region=554%2C0%2C813%2C813","detail":"The isolated world of Balmorra makes it ideal for the Empire's use as a prison camp, reusing land that once served the Separatists as droid factories during the Clone Wars conflict. "},{"name":"Balnab","img":"https://lumiere-a.akamaihd.net/v1/images/databank_balnab_01_169_2efe413b.jpeg?region=341%2C0%2C878%2C878","detail":"Not far from Patitite Pattuna, the planet Balnab is a primitive world, made of a stellar remnant still in the early stages of its development. In its relatively recent past, an alien starship crashed on the planet, and the surviving crew became the lone intelligence on the primeval world. Intelligence is a relative term, of course. The Balnab denizens were hoodwinked into cowing before the towering holographic form of Albee Dewaw, the iron-fisted dictator of Balnab. During one of their misadventures of the Clone Wars, C-3PO and R2-D2 revealed the truth behind Albee Dewaw to the stunned Balnab dwellers."},{"name":"Bardotta","img":"https://lumiere-a.akamaihd.net/v1/images/image_d998e316.jpeg?region=203%2C0%2C960%2C961","detail":"During the Clone Wars, Bardotta was the setting of a dark mystery. Previously a peaceful world, the planet’s spiritual leaders began to vanish without warning. Queen Julia of the Bardotta requested that the Senate send Jar Jar Binks to investigate -- but no Jedi due to a long-standing mistrust of the Order. When Jedi first began inducting Bardottan children into the Order, they were branded as thieves. Ultimately, Mace Windu accompanied Binks, and together they discovered the evil parties behind the disappearances."},{"name":"barren moon","img":"https://lumiere-a.akamaihd.net/v1/images/barren-moon-main_47cb861e.jpeg?region=563%2C0%2C795%2C795","detail":"On a nameless moon not far from Jabiim, Darth Vader and Ben Kenobi meet for a critical duel. The satellite of rocky spires and yawning crevasses becomes a historic site, as the former Jedi master emerges victorious and accepts that his friend, Anakin Skywalker, is truly gone."},{"name":"Barton IV","img":"https://lumiere-a.akamaihd.net/v1/images/barton-iv-main_d3b1fd33.jpeg?region=370%2C0%2C541%2C541","detail":"The icy world of Barton IV is home to an Imperial outpost but little else. On the desolate planet, the elements and natural predators conspire to eliminate the soldiers guarding the depot, while local raiders will stop at nothing to claim supplies and other cargo for themselves. When the outpost is left abandoned and forgotten, the depot drains the last of its resources keeping the perimeter beacons powered up."},{"name":"Base One","img":"https://lumiere-a.akamaihd.net/v1/images/rebel-massassi-outpost-main_6f7094bd.jpeg?region=485%2C0%2C675%2C675","detail":"Some time after abandoning Dantooine, Alliance High Command transferred operations to a new headquarters on the jungle moon of Yavin 4. There, stone temples built by a now-vanished species have been transformed into hangars, barracks and a command center. From Base One, as the Massassi site is known, rebel leaders direct the fight against the Empire."},{"name":"Batuu","img":"https://lumiere-a.akamaihd.net/v1/images/batuu-main-2_af643f4a.jpeg?region=560%2C0%2C720%2C720","detail":"Batuu was once a thriving stop for traders and travelers before advancements in lightspeed technology. Now its lush forests and majestic mountain regions are known only to those who dare to venture this far into the Outer Rim. At the infamous Black Spire Outpost, smugglers and rogues peddle their wares among the towering remains of petrified trees while the locals cook up exotic dishes and spin tales of ancient settlers long forgotten. Recently, the struggle between the First Order and the Resistance has made its way to this remote locale, once a haven for those hoping to avoid entanglements with the First Order."},{"name":"Beggar's Canyon","img":"https://lumiere-a.akamaihd.net/v1/images/beggar-s-canyon-main_482c4741.jpeg?region=372%2C0%2C536%2C536","detail":"A winding stretch of dried riverbed that carves its way through the Tatooine landscape, Beggar's Canyon has long served as a proving ground for podracer and skyhopper pilots looking to show off their skills. "},{"name":"Ben Kenobi’s cave","img":"https://lumiere-a.akamaihd.net/v1/images/ben-kenobi-s-cave-main_cb038cbc.jpeg?region=0%2C0%2C538%2C536","detail":"Not far from the Lars homestead, Ben Kenobi makes his home in a cave. For the most part, Kenobi keeps a respectful distance, monitoring Luke Skywalker as he grows. The shelter provides meager comforts, but its security is maintained by a submerged perimeter scanner that alerts the former Jedi of unexpected guests."},{"name":"Bespin","img":"https://lumiere-a.akamaihd.net/v1/images/Bespin_2d0759aa.jpeg?region=228%2C0%2C877%2C878","detail":"Secluded from galactic turmoil by its location in a little-visited sector of space, Bespin is an astrophysical rarity. An immense gas giant surrounded by a number of moons, the planet contains a band of habitable atmosphere among its endless clouds. In this stratum of life, enterprising prospectors have established floating mining complexes devoted to extracting valuable gasses from deep within the planet. The most well known of these ventures is the opulent Cloud City, formerly under the administration of Lando Calrissian. During the tail end of the Galactic Civil War, the Empire garrisoned Bespin and took over Cloud City, though the outpost and the planet enjoyed freedom after the defeat of the Emperor at the Battle of Endor."},{"name":"Black Spire Outpost","img":"https://lumiere-a.akamaihd.net/v1/images/black-spire-outpost-main_38680a60.jpeg?region=553%2C1%2C866%2C867","detail":"The largest settlement on the planet Batuu, Black Spire Outpost is an infamous stop for traders, adventurers, and smugglers traveling around the Outer Rim and Wild Space. Off the beaten path, this outpost has become a haven for the galaxy’s most colorful — and notorious — characters. Widely known for the petrified remains of its once towering ancient trees, the spires now stand guard across the river valleys and plains and have long captured the imagination of travelers to this planet. To the first settlers, these petrified spires became more than just landmarks; they became the heart of the outpost itself."},{"name":"Boba Fett’s Palace","img":"https://lumiere-a.akamaihd.net/v1/images/jabba-s-palace-main_7f0e8594.jpeg?region=0%2C0%2C538%2C536","detail":"Once the home of Jabba the Hutt, Boba Fett claimed the Hutt's throne and his fortress to set up his own headquarters on Tatooine after the fall of the Empire. There, Fett receives guests and accepts tribute in the throne room with Fennec Shand by his side."},{"name":"Bogano","img":"https://lumiere-a.akamaihd.net/v1/images/bogano_fadcba50.jpeg?region=243%2C0%2C1080%2C1080","detail":"A remote planet located in the Outer Rim, Bogano remains a largely unexplored world due to the fact that it’s missing from most modern maps.\n\nWith a surface dominated by vast mesas and sprawling wetlands, it is said the world was once the home of a quixotic Jedi Master and holds many as yet undiscovered secrets."},{"name":"Bora Vio","img":"https://lumiere-a.akamaihd.net/v1/images/bora-vio-main_90b4c8a2.jpeg?region=370%2C0%2C541%2C541","detail":"On the foggy world of Bora Vio in the Lido System, scientists once erected a floating cloning facility perfectly concealed in the atmosphere. Long after the building has fallen to disuse, the clone Omega finds herself hiding in the deserted structure, desperately racing down interconnecting catwalks to try to escape the bounty hunter on her tail. "},{"name":"Bracca","img":"https://lumiere-a.akamaihd.net/v1/images/bracca-main_b8a501e4.jpeg?region=369%2C0%2C542%2C542","detail":"Decommissioned ships from all over the galaxy are brought to the inhospitable world of Bracca in the Mid Rim to be salvaged, the components sold by the Scrapper Guild to the Empire and used to construct new weapons of war. In the time of the Clone Wars, the planet’s industrial base and close proximity to hyperspace lanes ensured it was the site of several fierce battles as both sides vied for the strategically important world. After the fall of the Republic, the starship graveyard proves useful to rogue clones in need of valuable medical facilities found inside rusted and retired Jedi Cruisers. Former Jedi Padawan Cal Kestis also worked in secret here as a scrapper before he was exposed and forced to flee."},{"name":"Bright Tree Village","img":"https://lumiere-a.akamaihd.net/v1/images/databank_ewokvillage_01_169_e8ae9721.jpeg?region=582%2C0%2C878%2C878","detail":"Built into the majestic trees high above the lush surface of Endor is the Bright Tree Village where the Ewoks of the Bright Tree Village tribe reside. Rope bridges and ladders connect each hut, village building, and watchtower. From the highest perches of the village, the Bright Tree Ewoks stand guard against predators like gorax and condor dragons. Unmarried Ewoks live in the lower huts, helping protect the village from Duloks and others that might do them harm. The more ornate huts are reserved for the village elders and leaders. The Bright Tree Village is where the heroes of the Rebellion were brought after they were captured by a Bright Tree hunting party just before they were adopted by the tribe. After the destruction of the second Death Star, this was the site of much celebrating by the Rebel Alliance."},{"name":"Canto Bight","img":"https://lumiere-a.akamaihd.net/v1/images/canto-bight_6782d4fa.jpeg?region=45%2C0%2C432%2C432","detail":"Located on the desert world of Cantonica, Canto Bight is a casino city and playground for the galaxy's ultra-rich. It's a place of both opportunity and high stakes, filled with casinos, racetracks, and other expensive distractions."},{"name":"Canto Bight Jail","img":"https://lumiere-a.akamaihd.net/v1/images/ep8-101538_cd51adb6.jpeg?region=76%2C0%2C720%2C720","detail":"Those who run afoul of the law in Canto Bight find themselves awaiting a hearing in the resort city’s jail, located on a hill above Old Town. Incarcerated within are thieves, pickpockets, swindlers and the occasional scoundrel looking for some hours of hassle-free sleep."},{"name":"Canto Casino","img":"https://lumiere-a.akamaihd.net/v1/images/ep8-056023_r_b9a9488f.jpeg?region=340%2C0%2C720%2C720","detail":"At the heart of Canto Bight sits the Canto Casino and Racetrack. A fathier racetrack occupies the center of the complex, surrounded by game rooms, restaurants, cabarets and luxury hotels. Fortunes in Cantocoins are won and lost nightly at the casino, a place of soaring dreams and crashing disappointments."},{"name":"Cantonica","img":"https://lumiere-a.akamaihd.net/v1/images/ep8-ff-004338_6dd8c0f4.jpeg?region=196%2C0%2C720%2C720","detail":"Located in the Corporate Sector, Cantonica would be just another forlorn, beige desert planet if not for the presence of the ultra-wealthy resort city of Canto Bight, which draws well-heeled tourists and high-rolling gamblers from across the galaxy."},{"name":"Captain Doza's Office","img":"https://lumiere-a.akamaihd.net/v1/images/resistance-db-captain-dozas-office-main-image_8c5e9e9f.jpeg?region=341%2C0%2C878%2C878","detail":"Inside Captain Doza's private office, the leader of the Colossus platform hosts private meetings with the First Order and conceals secrets about a past affiliation with the Empire."},{"name":"Caraad","img":"https://lumiere-a.akamaihd.net/v1/images/caraad-main_f143c7e0.jpeg?region=370%2C0%2C541%2C541","detail":"In the colorful marketplaces of Caraad, local denizens purchase fresh flower arrangements and haggle for good deals."},{"name":"Carlac","img":"https://lumiere-a.akamaihd.net/v1/images/databank_carlac_01_169_b809dfdf.jpeg?region=341%2C0%2C878%2C878","detail":"A beautiful, snow-draped world in the Outer Rim Territories, Carlac avoided much of the violence of the Clone Wars. But when the nomadic Death Watch warriors turned it into a camp, the planet and its peaceful Ming Po people faced death and destruction. The cruel Death Watch warriors erected temporary tents next to a Ming Po town, and raided the defenseless village for servants. Chieftain Pieter, leader of the Ming Po, demanded that Death Watch leave Carlac at once, unleashing the cruel temper of Pre Vizsla."},{"name":"Castilon","img":"https://lumiere-a.akamaihd.net/v1/images/castilon-main_d217dc4d.jpeg?region=138%2C0%2C720%2C720","detail":"Located in the Western Reaches near Takodana, the planet Castilon is dominated by vast oceans. The surface is broken up by the occasional inhabited structures, including for a time the Colossus, a refueling station and home to wannabe racers."},{"name":"Catacombs of Cadera","img":"https://lumiere-a.akamaihd.net/v1/images/catacombs-of-cadera-main_8a7b7732.jpeg?region=263%2C0%2C675%2C675","detail":"Across the desert from the Holy City lie the ancient Catacombs of Cadera, once the final resting place for adherents of a vanished faith. Saw Gerrera’s partisan militia has set up operations among the bones of the forgotten, using the catacombs as a base for raids against Jedha’s Imperial occupiers."},{"name":"Cato Neimoidia","img":"https://lumiere-a.akamaihd.net/v1/images/databank_catoneimoidia_01_169_d2b9bb58.jpeg?region=534%2C0%2C877%2C878","detail":"A weathly Neimoidian colony world, Cato Neimoidia's jewelled palaces and opulent bridge-cities were the pride and joy of Trade Federation barons, who sought constantly to one-up each other and dazzle guests with displays of ostentatious hospitality and luxury living."},{"name":"Cave of Evil","img":"https://lumiere-a.akamaihd.net/v1/images/cave-of-evil_1a4cb9ab.jpeg?region=753%2C0%2C666%2C665","detail":"Dagobah was one of the purest planets in the galaxy, alive with the Force thanks to its abundant life. One cave in the planet’s swamps roiled with the dark side. During the Clone Wars, the spirit of Qui-Gon Jinn led Yoda to this cave, where Yoda had a vision of Darth Sidious’s triumph over the Jedi. Years later, Luke Skywalker faced his own test in the cave, fighting a saber duel with a spectral Darth Vader whose helmet concealed Luke’s own face."},{"name":"Celsor 3","img":"https://lumiere-a.akamaihd.net/v1/images/zro-ff-003086_66fd2940.jpeg?region=788%2C0%2C2025%2C2025","detail":"The frigid surface of Celsor 3 is an inhospitable but picturesque landscape. On the small, uninhabited, and freezing cold moon, ice pillars majestically dot the landscape, blanketed in fog. The only creature known to survive under such conditions is the mighty jakoosk, a frightening beast with special armored plates that protect its dorsal side from blaster bolts, and a gaping maw snarling from the center of a few spindly legs, perfect for swooping down and snatching hapless creatures up in an instant."},{"name":"Central Detention Center","img":"https://lumiere-a.akamaihd.net/v1/images/central-detention-center_962d9a78.jpeg?region=550%2C0%2C877%2C878","detail":"The Republic Central Judiciary Detention Center was located on Coruscant, and housed political prisoners as well as common criminals. Clone shocktroopers kept order in the sprawling facility, whose inmates during the Clone Wars included Cad Bane, Moralo Eval, Boba Fett, Bossk, Aurra Sing and Ziro the Hutt."},{"name":"Christophsis","img":"https://lumiere-a.akamaihd.net/v1/images/databank_christophsis_01_169_2daae94e.jpeg?region=341%2C0%2C878%2C878","detail":"A beautiful jewel of a world with immense crystalline formations, Christophsis was the site of repeated and heated battles in the Clone Wars. A blockade of Separatist vessels trapped a Senate relief mission behind enemy lines, necessitating a special Republic task force with experimental starship technology to scatter the blockade. This precipitated a full scale Separatist invasion of the planet, made possible by a traitor within the clone trooper ranks. In the end, the Republic was able to turn the Separatist invasion, and guard the planet from future incursions."},{"name":"Cid's Parlor","img":"https://lumiere-a.akamaihd.net/v1/images/the-bad-batch-story-gallery-plan-99-09_ace59469.jpeg?region=180%2C0%2C813%2C813","detail":"Amid the refuse specked and graffitied streets of Ord Mantell, Cid operates a dank, underground parlor. Patrons mingle at gaming tables while Cid tends bar, turning away newcomers who look like trouble or don't seem to have credits to spend. "},{"name":"Cloud City","img":"https://lumiere-a.akamaihd.net/v1/images/databank_cloudcity_01_169_e589ba2c.jpeg?region=471%2C0%2C878%2C878","detail":"Suspended high among the pastel clouds of Bespin is a floating metropolis of sophisticated beauty and political freedom. Cloud City exists not only as a mining colony, extracting valuable Tibanna gas from the depths of the giant planet, but also as a sanctuary for those trying to escape the turmoil gripping the galaxy.  Though profitable, Cloud City is small enough not to be noticed by larger authorities such as the Mining Guild. It prospered under the capable stewardship of Baron-Administrator Lando Calrissian. Calrissian, assisted by his aide Lobot, contended with self-sufficiency issues and labor difficulties throughout his brief term."},{"name":"Colossus","img":"https://lumiere-a.akamaihd.net/v1/images/resistance-db-colossus-main_756afc59.jpeg?region=263%2C0%2C878%2C878","detail":"Located on the Outer Rim water planet of Castilon, the Colossus is a dangerous place that tends to attract well-meaning outcasts and more unsavory denizens of far-flung planets alike. Protected by some of the best pilots around, the Aces, elite stars of entertaining and dangerous sky races, the platform is soon infiltrated by the First Order, architects of a larger conflict brewing in the galaxy. But a small band of Resistance sympathizers led by secret spy Kazuda Xiono discover that the platform isn't what it seems."},{"name":"Colossus Marketplace","img":"https://lumiere-a.akamaihd.net/v1/images/resistance-db-marketplace-main-image_b51a65d3.jpeg?region=238%2C0%2C878%2C878","detail":"The marketplace on the Colossus platform is teeming with merchants, gamblers, and myriad alien species. On a quick stroll through the labyrinthian stalls, you could net you a juicy gorg for lunch or find yourself stumbling into trouble with the wrong crowd and literally carried away."},{"name":"Concord Dawn","img":"https://lumiere-a.akamaihd.net/v1/images/concord-dawn_4277a880.jpeg?region=57%2C0%2C872%2C873","detail":"Concord Dawn was a system under Mandalorian control, led by the legendary warrior Fenn Rau and his group of Protectors. While Rau entered into an agreement with the Empire, he eventually granted the rebels safe passage through the Concord Dawn system."},{"name":"Concordia","img":"https://lumiere-a.akamaihd.net/v1/images/databank_concordia_01_169_ea34eb0d.jpeg?region=769%2C16%2C791%2C792","detail":"Moon of Mandalore governed by Pre Vizsla. It was a mining settlement where the warriors of Mandalore had been sent in exile."},{"name":"Corellia","img":"https://lumiere-a.akamaihd.net/v1/images/corellia-main_621fbca8.jpeg?region=369%2C0%2C542%2C542","detail":"An ancient world in the galactic Core, Corellia is known for its people’s wanderlust and its massive shipyards. Corellia played a key role in the expansion of galactic civilization, but that was thousands of years ago. It’s now a faded industrial planet exploited by the Empire to build TIE fighters and Star Destroyers, while its formidable dockyard facilities are retrofitted to destroy all evidence of the Separatist forces. Corellians not born with money or influence hope to escape their homeworld in search of a better life."},{"name":"Coronet Spaceport","img":"https://lumiere-a.akamaihd.net/v1/images/solo-db-coronet-spaceport-main-image_aa7e9135.jpeg?region=682%2C0%2C878%2C878","detail":"A sprawling coastal facility, Coronet Spaceport handles civilian, commercial and military traffic in and out of Corellia. The centuries-old facility is primarily staffed by Corellian Security Forces, but Imperial officers and stormtroopers carefully monitor activity. Desperate travelers lacking the right documentation sometimes seek extra-legal ways to get offworld."},{"name":"Coruscant","img":"https://lumiere-a.akamaihd.net/v1/images/coruscant-main_59b865a4.jpeg?region=372%2C0%2C536%2C536","detail":"Coruscant is the vibrant heart and capital of the galaxy during the age of the Empire, featuring a diverse mix of cultures and citizens spread over hundreds of levels. Once the home of the main Jedi Temple -- the central hub of Jedi training and learning for over a thousand generations and the repository of the Jedi Archives -- these traditions ended when the planet bore witness to Order 66."},{"name":"Coruscant Senate Building","img":"https://lumiere-a.akamaihd.net/v1/images/coruscant-senate-building_118e5a51.jpeg?region=471%2C0%2C667%2C665","detail":"This dome shaped building located in the heart of Coruscant’s senate district is the home of the Galactic Senate chamber. This is where the Galactic Senate convenes for their meetings and it cuts a massive, rounded silhouette in the Coruscant skyline, visible for kilometers all around."},{"name":"Corvax Fen","img":"https://lumiere-a.akamaihd.net/v1/images/corvax-fen-main_70216f72.jpeg?region=140%2C0%2C854%2C854","detail":"One of Mustafar’s few vaguely hospitable places, the Corvax Fen is a bog studded with bleak irontrees, close to the splintered ruins of Darth Vader’s castle. The fen is guarded by a band of cultists devoted to Vader. Amid its swamps, Kylo Ren claims a Sith wayfinder that belonged to his grandfather."},{"name":"Corvus","img":"https://lumiere-a.akamaihd.net/v1/images/corvus-main_4dcceb2e.jpeg?region=372%2C0%2C537%2C537","detail":"A forested planet, Corvus is ruled by the Magistrate Morgan Elsbeth from her well-defended fortress in the city of Calodan. She subjugates her people through fear. Her forces have burned away much of the surrounding forest, plundering the natural resources of the planet."},{"name":"Crait","img":"https://lumiere-a.akamaihd.net/v1/images/crait_8878cb62.jpeg?region=173%2C0%2C432%2C432","detail":"Now uninhabited, Crait is a mineral world dusted by a layer of white salt, reflecting the planet's sunlight. It was once the site of a Rebel Alliance outpost, and has become a haven for the fleeing Resistance forces."},{"name":"Crait Rebel base","img":"https://lumiere-a.akamaihd.net/v1/images/last-jedi-databank-crait-rebel-base-main-image_6d71a716.jpeg?region=358%2C0%2C538%2C536","detail":"Originally a mining installation, the Crait outpost was transformed into a fortress by anti-Imperial insurgents bankrolled by Alderaan’s Bail Organa. The Rebellion abandoned the base when a change in Imperial patrols endangered it, though Leia Organa and her friends fought a brief skirmish against the Empire there. Leia then tucked Crait’s coordinates away in a file she kept in case of emergencies – a precaution that would one day prove a lifeline for her Resistance."},{"name":"cyber center","img":"https://lumiere-a.akamaihd.net/v1/images/cyber-center-main_884cfff1.jpeg?region=269%2C16%2C689%2C688","detail":"On the planet Anaxes, the Separatist army operates a specialized cyber center, where a mysterious algorithm seems to have cracked the code to allow battle droids to gain the upper hand on clone troopers on the battlefield."},{"name":"D'Qar","img":"https://lumiere-a.akamaihd.net/v1/images/d-qar_ddba97b1.jpeg?region=398%2C0%2C878%2C878","detail":"A lush world in the Outer Rim, D’Qar is the principal base of General Leia Organa’s Resistance. First surveyed by rebel pilots before the Battle of Endor, the planet’s obscurity and lack of native intelligent life made it a perfect choice when Leia’s new group needed a hidden base of operations. Resistance starfighters launched their attack on Starkiller Base from D’Qar, and were tracked back to the planet by the First Order. The Resistance hastily evacuated, narrowly escaping before the base was leveled by First Order turbolasers."},{"name":"Dagobah","img":"https://lumiere-a.akamaihd.net/v1/images/Dagobah_890df592.jpeg?region=449%2C0%2C700%2C700","detail":"Home to Yoda during his final years, Dagobah was a swamp-covered planet strong with the Force -- a forgotten world where the wizened Jedi Master could escape the notice of Imperial forces. Characterized by its bog-like conditions and fetid wetlands, the murky and humid quagmire was undeveloped, with no signs of technology. Though it lacked civilization, the planet was teeming with life -- from its dense, jungle undergrowth to its diverse animal population. Home to a number of fairly common reptilian and amphibious creatures, Dagobah also boasted an indigenous population of much more massive -- and mysterious -- lifeforms. Surrounded by creatures generating the living Force, Yoda learned to connect with the deeper cosmic Force and waited for one who might bring about the return of the Jedi Order."},{"name":"Daiyu","img":"https://lumiere-a.akamaihd.net/v1/images/daiyu-main_6d61b1bf.jpeg?region=374%2C0%2C533%2C533","detail":"A conflicting cacophony of squalor and decadence, Daiyu is a shady world awash in garish lights, corruption, sleaze, and vice. Criminals operate in the open of the urban sprawl, and it is a favored prowling ground of bounty hunters and other killers. "},{"name":"Dandoran","img":"https://lumiere-a.akamaihd.net/v1/images/dandoran_4173a4f5.jpeg?region=1433%2C0%2C935%2C935","detail":"A forested planet in the heart of the Doran system, this lush and watery planet has often been used to conceal cartel smuggling operations."},{"name":"Dantooine","img":"https://lumiere-a.akamaihd.net/v1/images/dantooine_f1c04676.jpeg?region=640%2C0%2C920%2C918","detail":"The site of the first base for the Rebel Alliance, Dantooine is an Outer Rim world, filled with lush forests and green landscapes. The Alliance would later leave Dantooine for a new home in an effort to stay one step ahead of the Empire."},{"name":"Daro","img":"https://lumiere-a.akamaihd.net/v1/images/daro-main_ad065701.jpeg?region=369%2C0%2C542%2C542","detail":"In the Outer Rim, the forest world of Daro is thought uninhabited, making it a prime location for a secret Imperial military base. Hidden among the mountainous terrain, elite clone commandos are training the next generation of soldiers known as stormtroopers."},{"name":"Dassal system","img":"https://lumiere-a.akamaihd.net/v1/images/dassal-system-main_64c903dc.jpeg?region=420%2C0%2C1080%2C1080","detail":"In the Unknown Regions, something has obliterated the sun that once kept life in the Dassal system thriving, cored entire planets including Najra-Va, and wiped out all inhabitants. The aftermath, discovered by Resistance spies, suggests the First Order is far more destructive than previously imagined."},{"name":"Dathomir","img":"https://lumiere-a.akamaihd.net/v1/images/dathomir-main_86dfa75a.jpeg?region=558%2C0%2C804%2C804","detail":"A remote planet, Dathomir is drenched in blood-red light from its central star. The planet has continents overrun by twisted vegetation, with forests of bent trees burdened by large, cocoon-like fruit. Bordering dense swamplands is the massive stone fortresses of the Nightsisters, a witch clan. The Nightsisters kept to themselves, but had on occasion been known to offer their services to those who piqued their interests. Far from the Nightsisters lived the Nightbrothers -- a tattooed clan of Zabrak warriors were subservient to their female counterparts."},{"name":"Death Star","img":"https://lumiere-a.akamaihd.net/v1/images/Death-Star-I-copy_36ad2500.jpeg?region=347%2C0%2C900%2C900","detail":"The Death Star was the Empire’s ultimate weapon: a moon-sized space station with the ability to destroy an entire planet. But the Emperor and Imperial officers like Grand Moff Tarkin underestimated the tenacity of the Rebel Alliance, who refused to bow to this technological terror…"},{"name":"Death Star II","img":"https://lumiere-a.akamaihd.net/v1/images/death-star-ii-main_92554cb4.jpeg?region=353%2C0%2C720%2C720","detail":"Hoping to crush the Rebellion once and for all, the Empire began construction of a second dreaded Death Star near Endor. Emperor Palpatine then leaked word of its construction to the Alliance, hoping to lure rebel forces in and destroy them. The Emperor died at the hands of Darth Vader and the Alliance destroyed the second Death Star, striking a momentous blow for freedom. Decades later, the wreckage of the battle station turned out to hold a perilous secret…. "},{"name":"Devaron","img":"https://lumiere-a.akamaihd.net/v1/images/devaron_ce8f7084.jpeg?region=380%2C0%2C800%2C800","detail":"The jungle planet of Devaron is home to the humanoid, horned Devaronian species. During the Clone Wars it was home to an outpost of the Galactic Republic as well as the Jedi Temple of Eedit. Cad Bane as well as Separatist forces attacked the planet and its inhabitants during the war and Sith assassin Savage Opress attacked the Temple during that time as well."},{"name":"Dex's Diner","img":"https://lumiere-a.akamaihd.net/v1/images/databank_dexsdiner_01_169_fc7c33e9.jpeg?region=298%2C0%2C877%2C878","detail":"Located on the streets of Coco Town, a dilapidated industrial area on the city-planet of Coruscant, is a quaint and outdated eatery known simply as Dex's Diner. Here, hard-working laborers come for a quick and home-style meal or a cup of freshly brewed Jawa juice or ardees, and idly chatter about local politics, sports, or current events.    Serving the patrons were a pair of regular waitresses, the whirring and wheeled WA-7, and her organic and freckled partner, Hermione Bagwa. The food comes courtesy of cook and proprietor, Dexter Jettster, a hulking alien with a multitude of past careers and life experiences."},{"name":"Dok-Ondar’s Den of Antiquities","img":"https://lumiere-a.akamaihd.net/v1/images/dok-ondars-den-of-antiquities-main-2_c9a6892d.jpeg?region=407%2C0%2C720%2C720","detail":"For those in the know, Dok-Ondar is the Ithorian one seeks for selling and buying rare and uniquely-valued items from across the galaxy. As one of the oldest establishments on Black Spire Outpost, Dok-Ondar’s Den of Antiquities has earned the reputation for amassing an impressive collection of valuable items spanning across all eras. "},{"name":"Doza Tower","img":"https://lumiere-a.akamaihd.net/v1/images/resistance-db-doza-tower-main_a2dda3c4.jpeg?region=412%2C0%2C877%2C878","detail":"Most inhabitants on the Colossus can only dream of the luxury of living in Doza Tower. Within the tower is the Aces Lounge, where the Aces and their crews get the chance to indulge in the cleaner quarters and delectable food offerings."},{"name":"Drahgor III","img":"https://lumiere-a.akamaihd.net/v1/images/zro-ff-003192_8754f5e0.jpeg?region=280%2C0%2C720%2C720","detail":"Lightning crackles in the dense atmosphere above Drahgor III, a planet bathed in a blanket of yellow fog. The mercurial surface of unforgiving rock is barren except for the Gozzo, a long-limbed, feathery species unafraid to mine the planet for its rich ore through deep-core drilling."},{"name":"Droid decommissioning facility","img":"https://lumiere-a.akamaihd.net/v1/images/the-bad-batch-decommissioned-story-gallery-07_b71a4f6f.jpeg?region=369%2C0%2C542%2C542","detail":"After the rise of the Empire, the Separatist droid army must be \"decommissioned\" (or rather destroyed) at facilities not unlike the droid factories of Geonosis where most battle droids were built. On Corellia, one such facility is a maze of rusty catwalks, rickety staircases, and conveyors littered with parts that drop off into the gaping maws of massive cisterns teeming with molten liquid. These dockyards are guarded by Imperial police droids."},{"name":"Dune Sea","img":"https://lumiere-a.akamaihd.net/v1/images/dune-sea-main_26f2fcee.jpeg?region=372%2C0%2C536%2C536","detail":"Named for the roiling waves of shifting sands that stretch across the vast landscape, Tatooine's Dune Sea is an unforgiving climate sometimes exploited by unscrupulous gangsters."},{"name":"Eadu","img":"https://lumiere-a.akamaihd.net/v1/images/eadu-main_7ebaa60a.jpeg?region=341%2C0%2C878%2C878","detail":"A rugged planet in the Outer Rim’s Bheriz sector, Eadu is known – to the extent it’s known at all – for its rain and native nerf herders. Few suspect the planet is home to a top-secret laboratory where Imperial scientists working for the Tarkin Initiative seek to unlock the secrets of kyber crystals and perfect a terrifying weapon."},{"name":"Echo Base","img":"https://lumiere-a.akamaihd.net/v1/images/ep5_key_103_ddb92545.jpeg?region=671%2C0%2C889%2C891","detail":"After the Battle of Yavin, the rebels fled from the Imperial starfleet, seeking a new main base of operations. They settled on the frozen Outer Rim world of Hoth, where they enlarged caverns to form Echo Base, defended by a powerful ion cannon and squads of airspeeders converted to operate in frigid conditions. Unfortunately, the base was barely established when an Imperial probe droid discovered it. General Rieekan ordered an immediate evacuation, but before Echo Base could be abandoned an Imperial task force arrived, landing AT-AT walkers and ground troops. Though key personnel escaped, the Battle of Hoth was a costly defeat for the Alliance."},{"name":"Emperor’s throne room","img":"https://lumiere-a.akamaihd.net/v1/images/emperor-s-throne-room-main_638aef97.jpeg?region=163%2C0%2C853%2C853","detail":"Rising from the north pole of the second Death Star is a 100-story isolation tower reserved for the Emperor, from which he oversees the battle station’s operations. The tower’s four spokes house a throne room, Palpatine’s private chambers, and a vault reserved for Sith artifacts. This throne room was the site of a climactic showdown between Jedi and Sith at the Battle of Endor; decades later, the tower’s corroded ruins could be glimpsed amid wreckage that had come to rest in the oceans of Kef Bir."},{"name":"Endor","img":"https://lumiere-a.akamaihd.net/v1/images/databank_endor_01_169_68ba9bdc.jpeg?region=447%2C0%2C877%2C878","detail":"Secluded in a remote corner of the galaxy, the forest moon of Endor would easily have been overlooked by history were it not for the decisive battle that occurred there. The lush, forest home of the Ewok species is the gravesite of Darth Vader and the Empire itself. It was here that the Rebel Alliance won its most crucial victory over the Galactic Empire."},{"name":"Er'Kit","img":"https://lumiere-a.akamaihd.net/v1/images/er_kit_5df42d73.jpeg?region=752%2C0%2C924%2C921","detail":"A desert planet with a climate similar to Tatooine, Er'Kit offers unique culture intermingled with danger. This planet has a history of slave trade, political scandal and violent militant groups such as the Blood Dawn."},{"name":"Erebus","img":"https://lumiere-a.akamaihd.net/v1/images/erebus-main_5d9c736d.jpeg?region=509%2C0%2C542%2C540","detail":"On the muddy planet of Erebus, Imperial strip mining has left the terrain pock-marked and barren. Among the sparse defining features of the world are an Imperial prison and its checkpoint tower, sending inmates out to earn their keep each day at the labor camps inside a nearby mine."},{"name":"Eriadu","img":"https://lumiere-a.akamaihd.net/v1/images/the-bad-batch-story-gallery-the-summit-04_e0c438cb.jpeg?region=554%2C0%2C813%2C813","detail":"At the dawn of the Empire, the mountainous Outer Rim world of Eriadu is an Imperial stronghold due to the presence of a secure compound controlled by Grand Moff Tarkin. The elite, high-ranking official holds clandestine meetings there with top advisors tasked with controlled some of the Empire's most precious resources."},{"name":"Erso Homestead","img":"https://lumiere-a.akamaihd.net/v1/images/erso-homestead-main_daa4b074.jpeg?region=341%2C0%2C878%2C878","detail":"When the Ersos decided to break with the Empire, Saw Gerrera facilitated the purchase of a 65-hectare farm on the eastern side of the distant planet Lah’mu. On this world far from the centers of power, Galen and his family have reinvented themselves as subsistence farmers, hoping to escape from Director Krennic and his hunters."},{"name":"Exegol","img":"https://lumiere-a.akamaihd.net/v1/images/exegol-main_01e57629.jpeg?region=442%2C0%2C538%2C536","detail":"Deep in the Unknown Regions, Exegol remains one of the oldest Sith worlds, home to a massive citadel filled with ancient, crumbling statuary and a still viable enclave of Sith cultists intent on carrying out Darth Sidious's plot."},{"name":"Faos Station","img":"https://lumiere-a.akamaihd.net/v1/images/faos-station_a078b54f.jpeg?region=241%2C0%2C878%2C877","detail":"An orbital outpost, Faos Station is an active hub of freighter and shipping activity."},{"name":"Far Galaxy","img":"https://lumiere-a.akamaihd.net/v1/images/the-far-galaxy-main_ccff1236.jpeg?region=558%2C0%2C804%2C804","detail":"The far galaxy includes the world of Peridea, a desolate place that was the ancient homeworld of the Nightsisters’ ancestors, the Dathmiri."},{"name":"Felucia","img":"https://lumiere-a.akamaihd.net/v1/images/databank_felucia_01_169_2070e38e.jpeg?region=542%2C0%2C877%2C878","detail":"Felucia is a world teeming with fungal life-forms and immense primitive plants. Much of the planet has a fetid, humid landscape overgrown by forests of bizarre wilderness. Many of the life-forms on Felucia are partially or completely translucent; they color the sunlight as the beams penetrate their skin. Others are opaque and imposing, like the enormous jungle rancors that roam the landscape. Beneath the hazy canopies of the enormous pitcher plants and leafy growths is a surreal color-drenched expanse. During the Clone Wars, the Jedi attempted to defend Felucia from those who would exploit the planet."},{"name":"Ferrix","img":"https://lumiere-a.akamaihd.net/v1/images/andor-trivia-105_4ffc9493.jpeg?region=530%2C1%2C807%2C803","detail":"The bustling salvage markets of Ferrix are reputed to hold some of the best second-hand parts inventory in the galaxy. It's a vibrant. tight-knit community of scavengers, entrepreneurs, and technicians who find, strip, repair and sell the parts and pieces that keep the local economy thriving. "},{"name":"First Order Mining Operation","img":"https://lumiere-a.akamaihd.net/v1/images/resistance-db-first-order-mining-operations-main-image_5dd7f55e.jpeg?region=341%2C0%2C878%2C878","detail":"Hidden within a treacherous asteroid belt, the First Order has built a massive space station right into the face of one of the largest rocks in the field. On a mission to gather intelligence, Kazuda Xiono and Poe Dameron discover readouts that show the First Order has mined the asteroid for precious dedlanite, a mineral that can be used to make a vast quantity of blasters. But evidence of the station is soon obliterated by Captain Phasma herself, alerted to the Resistance spy intrusion and determined to eliminate any trace of the First Order's capabilities. "},{"name":"Florrum","img":"https://lumiere-a.akamaihd.net/v1/images/databank_florrum_01_169_a1e64dd0.jpeg?region=341%2C0%2C878%2C878","detail":"A harsh, arid desert world in the Outer Rim Territories, Florrum is off the beaten path of major galactic hyperspace routes, making it the perfect haven for hunted criminals or lawless thugs. During the Clone Wars, Hondo Ohnaka ran a profitable salvage and piracy operation out of Florrum. His affairs crossed paths with the Jedi on more than one occasion."},{"name":"Fondor","img":"https://lumiere-a.akamaihd.net/v1/images/fondor_e5c6701b.jpeg?region=152%2C0%2C877%2C878","detail":"A critical naval complex for the Empire, Fondor is home to loyal Imperial citizens, scientists, and officers. The shipyards orbiting the purple planet are used for capital ship repairs, manufacturing, and Imperial R&D of classified technologies. Operation: Cinder’s satellites, and other unspecified projects, can trace parts of their early development to this vital Imperial world."},{"name":"Force Planet","img":"https://lumiere-a.akamaihd.net/v1/images/image_78a7da33.jpeg?region=467%2C20%2C940%2C939","detail":"Not marked on any star map and not recognized with any specific name, the Force planet is a mystical world and the foundation of life itself. It is the birthplace of the midi-chlorians, microscopic organisms that connect the living Force to the cosmic Force. Surrounded by a bright nebula, the Force planet is a barren place, featuring only luminescent geysers that shoot energy from deep within the world. Several islands hover above the surface, each teeming with plant life and strong with the Force."},{"name":"Fort Anaxes","img":"https://lumiere-a.akamaihd.net/v1/images/fort-anaxes-main_09f3cf93.jpeg?region=331%2C0%2C720%2C720","detail":"Fort Anaxes is a remote military base on the planet Anaxes during the Clone Wars. At one time, it is the site of the Separatist cyber center, an important strategic and tactical location for Republic troops. After war's end, a cataclysmic event obliterates the planet, though miraculously, Fort Anaxes remains intact. The facility becomes a fuel depot and meeting place for those who require privacy in their dealings. Unbeknownst to visitors to Fort Anaxes, it has also become home to a colony of vicious fyrnocks nested on the massive rock."},{"name":"Fort Ypso","img":"https://lumiere-a.akamaihd.net/v1/images/solo-db-fort-ypso-main-image-2_d1b4c1a5.jpeg?region=203%2C0%2C878%2C878","detail":"Deep in the Iridium Mountains, the snowy Fort Ypso lodge is the last remaining vestige of the Ypsobay Trading Company’s ambitious settlement. After the company’s collapse, the austere timber buildings of the fort remained, revitalized as an independent port and trading post."},{"name":"Fortress Inquisitorius","img":"https://lumiere-a.akamaihd.net/v1/images/fortress-inquisitorius-main_4925ad74.jpeg?region=1113%2C1%2C807%2C803","detail":"Situated atop the roiling seas of the moon of Nur in the Mustafar system, the Fortress Inquisitorius is the headquarters of the Jedi-hunting Inquisitors, where they strategize their next moves and interrogate their captives."},{"name":"Freetown (Mos Pelgo)","img":"https://lumiere-a.akamaihd.net/v1/images/freetown-main_f4fa0164.jpeg?region=372%2C0%2C536%2C536","detail":"Free from the yoke of the Empire and the terror of a voracious krayt dragon, the people of Mos Pelgo prefer to be known as citizens of Freetown."},{"name":"Frezno","img":"https://lumiere-a.akamaihd.net/v1/images/frezno-main_bad8fcd6.jpeg?region=0%2C1%2C807%2C803","detail":"Located in a forgotten sector not far from Aldhani, the planet of Frezno is a hard-scrabble place, where makeshift encampments pass for villages and medical procedures are performed in a dimly-lit tent."},{"name":"Galaxies Opera House","img":"https://lumiere-a.akamaihd.net/v1/images/galaxies-opera-house_2b83b84b.jpeg?region=409%2C0%2C666%2C666","detail":"Located in the upper levels of the Uscru District on Coruscant, the Galaxies Opera House was a venue favored by the elite of the galaxy. During the final days of the Clone Wars, Chancellor Palpatine attended an acrobatic performance of Squid Lake as performed by a Mon Calamari troupe. While the Chancellor was there, his private box was visited upon by Anakin Skywalker and he proceeded to reveal the tragedy of Darth Plagueis the wise."},{"name":"Garel","img":"https://lumiere-a.akamaihd.net/v1/images/image_151a7136.jpeg?region=395%2C0%2C811%2C811","detail":"Garel is a planet not far from Lothal, and was the site of a deal for T-7 ion disruptor rifles between the Empire's Minister Maketh Tua and Amda Wabo."},{"name":"Garsa’s Sanctuary","img":"https://lumiere-a.akamaihd.net/v1/images/garsa-s-sanctuary-main_f7c92226.jpeg?region=214%2C0%2C853%2C853","detail":"A busy establishment on the streets of Mos Espa, Garsa’s Sanctuary is part music hall, part gambling den, and part decadent respite from the searing suns of Tatooine where the stylish Garsa Fwip attends to her customers’ needs."},{"name":"Geonosis","img":"https://lumiere-a.akamaihd.net/v1/images/databank_geonosis_01_169_1d04e086.jpeg?region=504%2C0%2C877%2C878","detail":"A harsh rocky world less than a parsec away from Tatooine, Geonosis is a ringed planet beyond the borders of the Galactic Republic. Its uninviting surface is made up of harsh, rocky desert, and the creatures that evolved on Geonosis are well equipped to survive in the brutal environment.  The most advanced lifeform are the Geonosians, sentient insectoids that inhabit towering spire-hives. The Geonosians maintain large factories for the production of droids and weapons for the Separatist cause in the Clone Wars. After the Clone Wars, the Empire chose Geonosis as the construction site of the first Death Star, restricting travel to the system and sterilizing the planet’s surface."},{"name":"Geonosis Droid Factory","img":"https://lumiere-a.akamaihd.net/v1/images/screen_shot_2015-05-13_at_4_46a06f3e.jpeg?region=679%2C0%2C1034%2C1035","detail":"The hives of Geonosis were riddled with underground caverns, some of which had been converted to massive automated factories that turned out battle droids, weapons, vehicles and other products for Count Dooku’s Separatists. Anakin Skywalker and Padmé Amidala found themselves trapped in a Geonosian factory when their mission to rescue Obi-Wan Kenobi went awry. The Jedi and the senator had to battle Geonosian drones and avoid the assembly line’s deadly stampers, cutters and crucibles. Quick thinking by R2-D2 saved Padmé from a fatal dip in molten alloy, but Anakin’s saber was destroyed, leaving him defenseless against Jango Fett. Meanwhile, an industrial accident caused C-3PO to lose his head."},{"name":"Glavis Ringworld","img":"https://lumiere-a.akamaihd.net/v1/images/glavis-ringworld-main_d6fa2cd1.jpeg?region=120%2C0%2C538%2C536","detail":"The Glavis Ringworld is an artificial structure that encircles a small star like a ribbon. The space station surface is constantly bathed in sunlight, a perpetual source of power. Eclipse plates slide over its sunward fac, providing an artificial night cycle. "},{"name":"Goazon Badlands","img":"https://lumiere-a.akamaihd.net/v1/images/goazon-badlands_a8e89744.jpeg?region=720%2C0%2C650%2C651","detail":"A region of broken land and low hills on Jakku, the Goazon Badlands lies between Niima Outpost to the east and Kelvin Ravine to the west, and is bounded to the north and south by the Sinking Fields and Carbon Ridge, respectively. A trail known as the Pilgrim’s Road leads across the badlands. The Goazon is a harsh, forbidding place, with little vegetation or water. The scavenger Rey lived in a toppled AT-AT in the Goazon, not far from the Graveyard of Ships."},{"name":"Great Mothers' Fortress","img":"https://lumiere-a.akamaihd.net/v1/images/great-mothers-fortress-main_7b88dcfb.jpeg?region=493%2C1%2C807%2C803","detail":"On the unforgiving world of Peridea, amid a landscape of crumbling statues, the Great Mothers — ancient ancestors of the Nightsisters — wield their dark majik and commune with Morgan Elsbeth from beyond, calling to their descendant through visions and dreams."},{"name":"Havoc Outpost","img":"https://lumiere-a.akamaihd.net/v1/images/havoc-outpost_f3e16292.jpeg?region=330%2C0%2C878%2C877","detail":"Havoc Outpost was a rebel rendezvous point. Sabine of the Ghost crew was tasked with delivering a gonk power droid, custodian of secret information, to Havoc Outpost. There, she found R2-D2 waiting, ready to bring the intel to Senator Organa."},{"name":"Hemlock’s office","img":"https://lumiere-a.akamaihd.net/v1/images/hemlocks-office-main_6a733284.jpeg?region=202%2C0%2C542%2C540","detail":"In a dimly lit and spartan corner of the Imperial facility on Mount Tantiss, Dr. Royce Hemlock spends his time away from the lab conducting clandestine holo transmissions. "},{"name":"Holy City of Jedha","img":"https://lumiere-a.akamaihd.net/v1/images/holy-city-of-jedha-main_a628115c.jpeg?region=525%2C0%2C675%2C675","detail":"Also known as NiJedha or simply Jedha City, the fabled Holy City of Jedha continues to attract pilgrims from numerous faiths despite a brutal Imperial occupation. Saw Gerrera’s partisans have fought back against the Empire, turning the city’s ancient streets into a war zone. But pilgrims keep coming despite the danger, hungering for answers to spiritual questions..."},{"name":"Horizon Base","img":"https://lumiere-a.akamaihd.net/v1/images/horizon-base_43da92b5.jpeg?region=341%2C0%2C878%2C878","detail":"Horizon Base was an Imperial outpost that was both a shipping port and fueling station. The Ghost crew, in need of fuel, pulled off a daring heist at Horizon Base; the rebel astromech, Chopper, accidentally left there, eventually stole an Imperial cargo ship from the site. In the process, he recruited the inventory droid AP-5 to join the cause of the rebellion."},{"name":"Hosnian Prime","img":"https://lumiere-a.akamaihd.net/v1/images/hosnian-prime_2fbc263b.jpeg?region=0%2C0%2C1560%2C1560","detail":"The capital of the New Republic, Hosnian Prime is a cosmopolitan world on the outskirts of the galaxy’s Core Worlds region. One of Mon Mothma’s reforms in establishing the New Republic was that member worlds would host the Senate on a rotating basis, a sharp break from the millennia in which Coruscant was the center of galactic power. But Hosnian Prime’s tenure as Senate seat makes it the target of a terrifying attack by the First Order."},{"name":"Hoth","img":"https://lumiere-a.akamaihd.net/v1/images/Hoth_d074d307.jpeg?region=444%2C0%2C675%2C675","detail":"Hoth is the sixth planet in the remote system of the same name, and was the site of the Rebel Alliance's Echo Base. It is a world of snow and ice, surrounded by numerous moons, and home to deadly creatures like the wampa."},{"name":"Ibaar","img":"https://lumiere-a.akamaihd.net/v1/images/ibaar_cba78e19.jpeg?region=371%2C0%2C878%2C878","detail":"Ibaar was devasted when the Empire cut off all food and ration imports to the planet. It was only through the intervention of the rebellion and the Ghost crew — along with the experimental new B-wing starfighter — that food was finally delivered to Ibaar’s starving populace."},{"name":"Iego","img":"https://lumiere-a.akamaihd.net/v1/images/databank_iego_01_169_f7a6a060.jpeg?region=341%2C0%2C878%2C878","detail":"World on the fringes of the known galaxy, surrounded by a thousand moons. Lovely creatures referred to as \"Angels\" are known to inhabit the moons."},{"name":"Ilum","img":"https://lumiere-a.akamaihd.net/v1/images/databank_ilum_01_169_328d126d.jpeg?region=341%2C0%2C878%2C878","detail":"The most sacred world to the Jedi Order, the ancient planet Ilum is forever encased in ice, and whipped by biting winds. Hidden beneath the frozen surface is a Jedi Temple from the very dawn of the Order. It is here, within the legendary Crystal Caves, that Jedi initiates must undergo The Gathering. The rite of passage, handed down over centuries, requires Jedi younglings to trust their instincts, overcome inner obstacles, and find the unique Ilum crystal that is attuned to their Force presence. Upon retrieving the crystal, a Jedi initiate begins the process of constructing his or her lightsaber, under the guidance of Professor Huyang."},{"name":"Imperial Academy","img":"https://lumiere-a.akamaihd.net/v1/images/image_58607885.jpeg?region=420%2C0%2C1080%2C1080","detail":"The Imperial Academy on Lothal was a high-tech, heavily fortified training facility designed to shape cadets into ruthless stormtroopers. Inside the Imperial Academy was the Well: a difficult, programmable obstacle course that tested the intelligence and strength of the cadets. Commandant Aresko and Taskmaster Grint served as the academy's unforgiving instructors, driving trainees to win at all costs."},{"name":"Imperial Base on Daro","img":"https://lumiere-a.akamaihd.net/v1/images/imperial-base-on-daro-main_7d423096.jpeg?region=369%2C0%2C542%2C542","detail":"Built into a mountain, the Empire operates a clandestine base on the world of Daro, employing elite clone commandos and TK stormtroopers as leaders begin the next phase of their plot for galactic domination."},{"name":"Imperial doonium refinery","img":"https://lumiere-a.akamaihd.net/v1/images/imperial-doonium-refinery-main_05f262c0.jpeg?region=471%2C0%2C542%2C542","detail":"The world of Ryloth endured years of conflict to protect its natural resources and the planet's people from warlords and invaders during the Clone Wars. In the aftermath of the war, an Imperial doonium refinery springs up to seemingly threaten both once more."},{"name":"Imperial Garrison (Aldhani)","img":"https://lumiere-a.akamaihd.net/v1/images/imperial-garrison-aldhani-main_9b4d0ae1.jpeg?region=840%2C1%2C807%2C803","detail":"The Imperial garrison on Aldhani is a depot for supplies, weapons, and the repository for the payroll credits to support the entire Imperial sector. With Alkenzi Air Base providing protection nearby, Aldhani's outpost is relatively understaffed, with a mere 40-troop regiment devoted to security."},{"name":"Imperial Orbital Space Station","img":"https://lumiere-a.akamaihd.net/v1/images/imperial-orbital-space-main_53869e5e.jpeg?region=220%2C1%2C542%2C540","detail":"A hive of activity in the space above the already booming metropolis of Coruscant, the Imperial orbital space station allows for a variety of comings and goings, a lone outpost with ample hangar space for wayward travelers.\n"},{"name":"Ipsidon","img":"https://lumiere-a.akamaihd.net/v1/images/ipsidion-main_798dbf01.jpeg?region=590%2C0%2C813%2C813","detail":"Marked by rocky red outcroppings and charred terrain, the dusty world of Ipsidon is the home to rich seams of ipsium. Mined by those motivated to endure the dangers of digging the highly combustible raw ore from below ground, it is a largely desolate place where few dare to tread."},{"name":"Ipsidon spaceport","img":"https://lumiere-a.akamaihd.net/v1/images/ipsidon-spaceport-main_4b70e9af.jpeg?region=554%2C0%2C813%2C813","detail":"Once a thriving hub for the ipsium mining industry, the spaceport on Ipsidon now sits abandoned, a graveyard of skiffs and other forgotten tech suitable for scavengers."},{"name":"Jabba the Hutt's Palace","img":"https://lumiere-a.akamaihd.net/v1/images/jabba-the-hutt-s-palace-main_3b79a010.jpeg?region=204%2C0%2C540%2C540","detail":"A single, winding dirt-swept road curves up into the crook of a rocky canyon, leading to a lone structure in the desert wastes beyond the Dune Sea of Tatooine. Here stood the palace of Jabba the Hutt, an immense curving building of sandblasted metal and pitted stone. Inside, the dregs of the galaxy congregated to do all manner of illicit business, to curry favor with the grotesque crime lord, or to avoid his fickle wrath. Jabba reclined atop a stone dais within the throne room of his palace, a bustling chamber that overlooked a secret pit that contained his favorite beast, the vicious rancor monster."},{"name":"Jabiim","img":"https://lumiere-a.akamaihd.net/v1/images/jabiim-main_bc7b64f5.jpeg?region=742%2C0%2C538%2C536","detail":"A muddy world covered with a hardened crust, Jabiim is largely forgotten in the galaxy. But what makes it unattractive to tourists and settlers has made it an invaluable haven for the Hidden Path."},{"name":"Jabiim Hidden Path safehouse","img":"https://lumiere-a.akamaihd.net/v1/images/jabiim-hidden-path-safehouse_bf11dbeb.jpeg?region=227%2C0%2C720%2C720","detail":"Housed in an abandoned sanitation depot on Jabiim, the secret staging grounds provide the Hidden Path with a place to arrange safe passage and new identities to provide relative safety for Force-sensitive fugitives of the Empire. "},{"name":"Jakku","img":"https://lumiere-a.akamaihd.net/v1/images/mr0170_a69c0abe.jpeg?region=0%2C0%2C666%2C664","detail":"A harsh desert world, Jakku is a lawless place that’s home to thieves, outlaws and refugees. During the final years of the Galactic Civil War, Jakku was the site of a secret Imperial research base and served as a jumping-off point for warships heading into the Unknown Regions. The Empire made a last stand above the frontier planet, leading to a pitched battle between rebel and Imperial fleets. Jakku’s sandy wastes are littered with old wrecks, picked over by desperate scavengers searching for parts that can be salvaged and sold."},{"name":"Jalath","img":"https://lumiere-a.akamaihd.net/v1/images/jalath_ed2d500c.jpeg?region=341%2C0%2C878%2C878","detail":"Jalath is a city on Lothal and home to an Imperial facility, erected after the Empire's occupation of the planet. The installation is often a target of the Ghost crew of rebels."},{"name":"Jalindi","img":"https://lumiere-a.akamaihd.net/v1/images/jalindi_9fddde78.jpeg?region=512%2C0%2C877%2C878","detail":"Jalindi is a world covered in rock, blanketed in thick mist. Navigating the planet surface is difficult, and with its mountain spikes, potentially lethal. Jalindi is the site of an Imperial relay dish that amplifies the Empire's communications."},{"name":"Jalindi Station","img":"https://lumiere-a.akamaihd.net/v1/images/jalindi-station_5fce2c51.jpeg?region=488%2C0%2C877%2C878","detail":"Jalindi Station is a massive relay dish developed the Empire. It amplifies and boosts communications, allowing the Empire to disseminate information and monitor transmissions on a grand scale."},{"name":"Jedha","img":"https://lumiere-a.akamaihd.net/v1/images/jedha-main-image_4e3dd512.jpeg?region=184%2C0%2C656%2C654","detail":"A small desert moon frosted by a permanent winter, Jedha is home to one of the first civilizations to explore the nature of the Force. At one time a world important to the Jedi Order, Jedha serves as a holy site for pilgrims from across the galaxy who seek spiritual guidance. Now, the Empire occupies Jedha, and a prolonged battle between Imperial forces and scattered Rebels carries on in the timeworn streets."},{"name":"Jedi Temple","img":"https://lumiere-a.akamaihd.net/v1/images/databank_jeditemple_01_169_1b756b23.jpeg?region=341%2C0%2C878%2C878","detail":"Instantly recognizable by its distinctive crown of five spires, the Jedi Temple was the home of the Jedi Order on Coruscant. Part school and part monastery, the Jedi Temple was the central hub for all Jedi activities in the galaxy. When Supreme Chancellor Palpatine enacted Order 66, clone troops led by the newly risen Darth Vader attacked the temple, massacring its inhabitants and leaving the structure badly damaged. With the Empire triumphant, the Jedi Temple’s spires still rose into the Coruscant skies. But the building was now the Imperial Palace, home to the Sith Lord who had destroyed the Jedi."},{"name":"Jedi texts","img":"https://lumiere-a.akamaihd.net/v1/images/jedi-texts-main_7eaa62ab.jpeg?region=284%2C0%2C720%2C720","detail":"The fabled founding texts of the Jedi Order were sheltered from Ahch-To’s weather by the huge trunk of a once-mighty uneti tree. This collection of ancient tomes was painstakingly assembled by Luke Skywalker, but became a burden and a torment to him. Luke vowed to burn down the library, but repeatedly found himself unable to do so – until Yoda’s spirit called down lightning to do it for him. Luke didn’t know the library was empty: Rey had already spirited the Jedi texts to safety aboard the Millennium Falcon. She then studied them as part of her own training, learning of techniques such as Force healing and the existence of secret worlds such as Exegol."},{"name":"Jundland wastes","img":"https://lumiere-a.akamaihd.net/v1/images/jundland-wastes-main_bfbc53f5.jpeg?region=372%2C0%2C536%2C536","detail":"Not to be traveled lightly, the Jundland Wastes is where rugged mesas meet the endless Dune Sea on Tatooine."},{"name":"Kachirho","img":"https://lumiere-a.akamaihd.net/v1/images/kachirho_1113a1d6.jpeg?region=452%2C0%2C656%2C656","detail":"This coastal city on the planet Kashyyyk was the site of intense fighting between the Republic forces and Separatists. The Wookiee forces stationed in the city of Kachirho are led by chieftan Tarfull. Its placement on the coast made it different than most other cities on Kashyyyk, making it an optimal landing point for Separatist invaders."},{"name":"Kadavo","img":"https://lumiere-a.akamaihd.net/v1/images/databank_kadavo_01_169_46495e1c.jpeg?region=395%2C0%2C878%2C878","detail":"A world of stark, jagged terrain, Kadavo is pitted with massive volcanic caldera -- most are dormant, but a few are active. Suspended from the rim of a gaping crater was one of the principal Zygerrian labor processing facilities. Capable of holding millions, the giant structure is suspended directly over a seemingly bottomless maw that cut deep into the planet's crust. The thousands of colonists of Kiros were held prisoner within the facility, toiling over ore processing for the betterment of the Zygerrian Slave Empire."},{"name":"Kaller","img":"https://lumiere-a.akamaihd.net/v1/images/kaller-main_7f1ab815.jpeg?region=369%2C0%2C542%2C542","detail":"One of the last battlefronts of the Clone War, the mountainous world of Kaller was the site of Jedi master Depa Billaba's last stand."},{"name":"Kamino","img":"https://lumiere-a.akamaihd.net/v1/images/kamino-main_3001369e.jpeg?region=369%2C0%2C542%2C542","detail":"Once purged from the otherwise complete Jedi Archives was all evidence of the mysterious world of Kamino. A lonely world beyond the Outer Rim and just south of the Rishi Maze, few could have predicted that Kamino would become a key contributor to a massive shift in political power in the final days of the Republic. Kamino is a planet of endless oceans and storms. Few features mark its surface, save for massive stilt-mounted cities wherein reside the planet's natural inhabitants, the Kaminoans. From Tipoca City, the planet's prime minister rules. Lama Su and Kamino’s chief medical scientist Nala Se closely monitor the operations of Kamino's most prized export -- clones -- even after the Clone Wars reaches a conclusion."},{"name":"Karthon","img":"https://lumiere-a.akamaihd.net/v1/images/karthon-main_cc02c0f2.jpeg?region=214%2C0%2C853%2C853","detail":"Karthon is the site of the Chop Fields, a New Republic correction facility where inmates dismantle inoperable Imperial war machines."},{"name":"Kashyyyk","img":"https://lumiere-a.akamaihd.net/v1/images/kashyyyk-main_37a2e497.jpeg?region=554%2C0%2C813%2C813","detail":"Kashyyyk is the Wookiee homeworld, covered in dense forest. While Wookiees build their homes in the planet's trees, they are not a primitive species, and Kashyyyk architecture incorporates sophisticated technology. One of the last battles of the Clone Wars was fought here under the leadership of Yoda, with Wookiees and clones battling the Separatist droid army -- until the Emperor issued Order 66, commanding the clones to slaughter all Jedi. Yoda survived, however, with the help of natives Chewbacca and Tarfful, who used a hidden shuttle to evacuate the Jedi Master from the planet. In the aftermath, the brave Jedi Padawan Gungi, a survivor of the Jedi slaughter, was returned to what remained of his homeworld with the help of Clone Force 99."},{"name":"Kef Bir","img":"https://lumiere-a.akamaihd.net/v1/images/kef-bir-main_576f898f.jpeg?region=420%2C0%2C538%2C536","detail":"One of nine moons in the Endor system, the oceanic world of Kef Bir remains in the shadow of the famous Forest Moon where the Battle of Endor brought the Empire to its knees. After the explosion of the second Death Star, a massive fragment of the destroyed station was left peeking out from one of Kef Bir’s oceans."},{"name":"Kenari","img":"https://lumiere-a.akamaihd.net/v1/images/kenari-main_094ad854.jpeg?region=558%2C0%2C804%2C804","detail":"A Mid Rim planet far from the attention of core worlds, Kenari is marked by lush jungle vistas, grounds rich in valuable mineral deposits, and environmental devastation. Plunderers have carved up the land in years past, leaving disaster in their wake and small tribes of orphans left to survive on their own."},{"name":"Kessel","img":"https://lumiere-a.akamaihd.net/v1/images/kessel-main_9ebae664.jpeg?region=601%2C0%2C867%2C867","detail":"Kessel is a noxious mining world where workers endure harrowing conditions extracting spice and coaxium for shipment offworld. The Empire sentenced many prisoners to be used as slave labor by the planet’s economic rulers, the criminal Pyke Syndicate."},{"name":"Kessel Control Center","img":"https://lumiere-a.akamaihd.net/v1/images/solo-db-kessel-control-center-main-image_ff26a970.jpeg?region=612%2C0%2C878%2C878","detail":"The Pyke Syndicate’s Kessel operations are run from a control center overseen by Quay Tolsite. To save credits, Tolsite has assembled a staff largely of droids, which monitor the miners’ output. Tolsite controls his mechanical charges with restraining bolts."},{"name":"Kijimi","img":"https://lumiere-a.akamaihd.net/v1/images/kijimi-city-main_530d8d0c.jpeg?region=411%2C0%2C538%2C536","detail":"Frigid and mountainous, Kijimi is an inhospitable world where local criminals rule in the place of the New Republic or the First Order. Its remoteness and lack of cosmopolitan culture attract those on the run from the law, but its days as a haven for lawbreakers are numbered."},{"name":"Kijimi City","img":"https://lumiere-a.akamaihd.net/v1/images/kijimi-main_9c015fc9.jpeg?region=214%2C0%2C853%2C853","detail":"Built atop a mountain, Kijimi City is an ancient town that originally sprang up around the monasteries of several religious orders. The monks are long gone, their prayer halls and domiciles taken over by spice runners, thieves, and fugitives. Kijimi City is ruled by an ever-shifting mix of guilds, gangs and clans that seek to maintain power without attracting the wrath of the planet’s First Order occupiers."},{"name":"Killun 71","img":"https://lumiere-a.akamaihd.net/v1/images/killun_ef168685.jpeg?region=255%2C0%2C877%2C878","detail":"Killun 71 is a moon displaying a green appearance from space due to an omnipresent layer of mist in its atmosphere. Killun 71's terrain consists of jagged masses that make colonization difficult, though the Imperial Security Bureau has established a base, Killun Station, on one of its rocky protrusions."},{"name":"Killun Station","img":"https://lumiere-a.akamaihd.net/v1/images/killun-71-station_18e360f8.jpeg?region=341%2C0%2C878%2C878","detail":"Built on one of Killun 71's jagged landmasses, Killun Station is an Imperial Security Bureau outpost housing sensitive data. Security is especially tight at the installation, which includes a stormtrooper presence at all entrances and walkthrough identification scanners. While rarely approached by rebels, undercover droids AP-5 and Chopper recovered secret Lothal orbital clearance codes from Killun Station."},{"name":"Kiros","img":"https://lumiere-a.akamaihd.net/v1/images/databank_kiros_01_169_0251a718.jpeg?region=342%2C0%2C876%2C878","detail":"An idyllic world filled with vast green valleys and flowing waterfalls,Kiros was the site of a colony of Togruta artists, led by Governor Roshti. The artisan colony tried to avoid taking sides in the Clone Wars, but Count Dooku arrived on-planet with a droid army, and \"insisted\" the Togrutas accept his offer of protection. Within ten standard rotations, all 50,000 Togruta colonists had vanished."},{"name":"Klatooinian wikiup","img":"https://lumiere-a.akamaihd.net/v1/images/klatooinian-wikiup-main_4dbbed4f.jpeg?region=316%2C0%2C537%2C536","detail":"Heaps of krill, glowing tanks of spotchka, and other assorted spoils litter the Klatooinian wikiup, home base for the fearsome raiders who pillage defenseless krill farms on the planet Sorgan."},{"name":"Koboh","img":"https://lumiere-a.akamaihd.net/v1/images/koboh-main_58d96c16.png?region=552%2C0%2C817%2C817","detail":"The rugged planet of Koboh was once hoped to become a thriving home for a community of prospectors looking to strike it rich from the planet's natural resources and lost treasures. However, proven to lack much of either, and plagued by bandit incursions, Koboh has settled into a dusty, mostly forgotten galactic footnote"},{"name":"Krownest","img":"https://lumiere-a.akamaihd.net/v1/images/krownest_793459cf.jpeg?region=341%2C0%2C878%2C878","detail":"A frigid world of snow and ice, Krownest is home to Clan Wren -- Mandalorians under the leadership of Ursa Wren. The Wren stronghold, a stunning complex of steel and glass, blends seamlessly with the snowy landscape."},{"name":"Kuiil's ranch","img":"https://lumiere-a.akamaihd.net/v1/images/huc-ff-000402_615e2744.jpeg?region=338%2C0%2C538%2C536","detail":"Tucked away in the muddy outcroppings of Arvala-7, Kuiil's ranch is home to a paddock of blurrgs, while vapor spires stretch toward the sky, collecting what little moisture can be trapped from the expansive atmosphere."},{"name":"Lah'mu","img":"https://lumiere-a.akamaihd.net/v1/images/lahmu-main_f38442ce.jpeg?region=475%2C0%2C675%2C675","detail":"Located in the Outer Rim’s Raioballo sector, Lah’mu is a sparsely inhabited backwater whose rich soil and groundwater are contaminated by minerals and other elements. The Erso family fled to Lah’mu from Coruscant, hoping to find refuge from the Empire."},{"name":"Lars Moisture Farm","img":"https://lumiere-a.akamaihd.net/v1/images/databank_larsmoisturefarm_01_169_ac15d1cd.jpeg?region=444%2C0%2C878%2C878","detail":"Two generations of the Lars family sought to make a living on this hardscrabble moisture farm on Tatooine, contending not just with the planet’s hot and arid conditions but also with vicious bands of Tusken Raiders. Anakin Skywalker visited the farm in search of his mother Shmi, who’d married Cliegg Lars but been kidnapped by Tuskens. Later, Luke Skywalker grew up there, raised by Cliegg’s son Owen and his wife Beru while Obi-Wan Kenobi kept watch from afar. Imperial stormtroopers searching for R2-D2 and C-3PO burned the homestead and murdered Owen and Beru, leaving Luke determined to learn the ways of the Jedi and fight the Empire."},{"name":"Lau","img":"https://lumiere-a.akamaihd.net/v1/images/lau-main_17f01192.jpeg?region=370%2C0%2C541%2C541","detail":"Like many worlds in the age of the Empire, the spaceport on the largely desolate planet of Lau is bustling with Imperial agents on the lookout for any signs of unrest. With an unforgiving terrain of jagged cliffs and frigid temperatures, it’s not among the most welcoming of places.\n"},{"name":"Level 1313","img":"https://lumiere-a.akamaihd.net/v1/images/level-13-13_2f6bc832.jpeg?region=345%2C0%2C871%2C871","detail":"Coruscant’s Level 1313 – so called because it was 1,313 levels from the planet’s core – was part of the galactic capital’s lawless underworld. Lever 1313 was a haven for bounty hunters, gangsters and other galactic scum, with the strong preying on those struggling to make a living. After she was framed for murder, Ahsoka Tano sought refuge on the lower levels."},{"name":"Lira San","img":"https://lumiere-a.akamaihd.net/v1/images/lirasan_95881465.jpeg?region=342%2C0%2C877%2C877","detail":"The rumored original homeworld of the Lasat, Lira San could only be located through an ancient ritual. It remained hidden behind a powerful energy anomaly, and once the ritual was complete, only a Lasat bo-rifle could lead the way and complete the journey. The rebel Zeb, along with Lasat survivors Gron and Chava, united to discover Lira San -- a place where their people could rebuild and prosper."},{"name":"Lola Sayu","img":"https://lumiere-a.akamaihd.net/v1/images/lola-sayu_e41867d8.jpeg?region=380%2C0%2C800%2C800","detail":"The volcanic planet of Lola Sayu appeared a beautiful glowing purple from orbit and was the site of an ancient Jedi prison known as the Citadel. Although the Republic had control of the planet for a time, it switched hands early on during the Clone War conflict and the Separatists used the planet as a prisoner of war camp under the control of Osi Sobeck."},{"name":"Lothal","img":"https://lumiere-a.akamaihd.net/v1/images/lothal-main_4b6d48c0.jpeg?region=558%2C0%2C804%2C804","detail":"Lothal is a diverse planet, with both farmland and a city center. During the age of the Empire, it fell under Imperial occupation, as farmers were kicked off their land and enormous TIE fighter and weapons factories were built. While most of the population felt powerless in the face of Imperial rule, a select few dared to fight back."},{"name":"Lothal Capital City","img":"https://lumiere-a.akamaihd.net/v1/images/image_d091f1be.jpeg?region=490%2C0%2C1080%2C1080","detail":"Capital City is the bustling hub of Lothal, featuring local merchants, industrial facilities, skyscrapers, and a large citizenry. During the reign of the Empire, Imperial occupation became the norm, with stormtroopers and Imperial officers bringing fear and tyranny to the once peaceful city."},{"name":"Lothal Depot","img":"https://lumiere-a.akamaihd.net/v1/images/lothal-depot_4067d8c5.jpeg?region=341%2C0%2C878%2C878","detail":"Lothal Depot was a landing area on the Outer Rim planet. When Princess Leia Organa came to Lothal with three Hammerhead Corvettes meant for the rebellion, she docked in the Empire-controlled area -- and her ships were quickly fit with gravity locks. Only through a clever plot hatched with the Ghost crew were the locks released, and the ships allowed to escape Lothal Depot."},{"name":"Lothal fuel depot","img":"https://lumiere-a.akamaihd.net/v1/images/rebels-databank-410-lothal-fuel-depot-main-image_48a7421e.jpeg?region=280%2C0%2C720%2C720","detail":"The Lothal fuel depot was built during the Empire's occupation of the planet. Serving the entire Imperial presence on the planet, its reserves are massive."},{"name":"Lothal Hospital","img":"https://lumiere-a.akamaihd.net/v1/images/lothal-hospital-main_85e37dce.jpeg?region=558%2C0%2C804%2C804","detail":"Medical droids zip through the stark white corridors of a hospital on Lothal, where a variety of ailments — including lightsaber wounds — can be treated."},{"name":"Lothal Imperial airfield","img":"https://lumiere-a.akamaihd.net/v1/images/lothal-imperial-airfield_94ad76a9.jpeg?region=374%2C0%2C877%2C878","detail":"One of the Empire's many installations on Lothal, the Lothal Imperial airfield is an official training and testing ground for fighters and craft. It is home to the TIE defender elite prototype, a deadly new ship piloted by Vult Skerris."},{"name":"Lothal Imperial Factory","img":"https://lumiere-a.akamaihd.net/v1/images/lothal-imperial-factory_33ae4ece.jpeg?region=274%2C0%2C877%2C878","detail":"The Lothal Imperial Factory was a byproduct of the Empire's increased presence on the Outer Rim world. The operation utilized citizens as laborers and drew the attention of Grand Admiral Thrawn following reports of poor engineering. It was here that the rebels Kanan Jarrus and Ezra Bridger stole the Empire's plans for a new model TIE fighter -- the TIE defender -- equipped with shields, thanks to the informant, Agent Kallus."},{"name":"Lothal Jedi Temple","img":"https://lumiere-a.akamaihd.net/v1/images/image_975ca326.jpeg?region=420%2C0%2C1080%2C1080","detail":"An ancient building hidden within the planet surface, the Lothal Jedi Temple was discovered by Padawan Ezra Bridger through a connection with the Force. Inside the Temple, he and his Master, Kanan Jarrus, gained new insights into themselves -- thanks to guidance from Yoda, communing from a distant world. There, Yoda gave Ezra a kyber crystal, allowing the boy to construct his first lightsaber."},{"name":"Lothal Old Republic Senate Building","img":"https://lumiere-a.akamaihd.net/v1/images/image_520fca11.jpeg?region=420%2C0%2C1080%2C1080","detail":"Known for its striking interior mural called New Freedom, the Lothal Old Republic Senate Building was a distinct landmark featuring a towering spire. It was abandoned when the Empire built the Imperial Complex, but came alive once more as the meeting site between the Ghost crew and Senator Gall Trayvis."},{"name":"Lothal Transmitter Tower","img":"https://lumiere-a.akamaihd.net/v1/images/lothal-transmitter-tower-main_4ffcd73e.jpeg?region=590%2C1%2C807%2C803","detail":"Located on Lothal just outside the capital city, the transmitter tower has served many purposes over the years. Once home to the orphan Ezra Bridger, in the age of the New Republic the lookout serves as Sabine Wren’s makeshift quarters."},{"name":"Lotho Minor","img":"https://lumiere-a.akamaihd.net/v1/images/databank_lothominor_01_169_f2909fdf.jpeg?region=122%2C0%2C877%2C878","detail":"Known also as the Junk World, Lotho Minor is one of the galaxy's dumping grounds. The surface of the planet is covered with refuse, piled over countless generations so that enormous heaps of trash stand as tall as mountains. As the ancient maxim goes, one being's refuse is another's treasure: salvage operations dig through the planet-wide junkyard, looking to reclaim and recondition reusable or obsolete machinery. Huge pools of toxic sludge and the periodic bursts of acid rain make the ruined ecosystem one of the most dangerous in the galaxy."},{"name":"Malachor","img":"https://lumiere-a.akamaihd.net/v1/images/malachor_ee5a7517.jpeg?region=301%2C0%2C877%2C878","detail":"A dark planet with an even darker history, Malachor is a location Jedi are told from a young age to avoid. Home to an ancient Sith temple, it was once the location of a heated battle between Jedi and Sith. Kanan, Ahsoka and Ezra traveled to Malachor in search of knowledge, but were met by evil."},{"name":"Malachor Sith temple","img":"https://lumiere-a.akamaihd.net/v1/images/malachor-sith-temple_1bc752c9.jpeg?region=341%2C0%2C878%2C878","detail":"In search of a way to truly defeat the Inquisitors, Kanan Jarrus, Ahsoka Tano, and Ezra Bridger made their way to Malachor. The Sith temple greeted them with it's looming pillars covered in text written in the “old tongue” and Ezra unwittingly opens one of the temple's door when the trio go to inspect them. Upon entering, the rebels discover that the temple was a battlefield and learn that they are not alone. While Ahsoka and Kanan fended off the Inquisitors, Ezra uncovered a Sith holocron containing the knowledge they seek. No one leaves the Sith temple unchanged."},{"name":"Malastare","img":"https://lumiere-a.akamaihd.net/v1/images/databank_malastare_01_169_59df245f.jpeg?region=157%2C0%2C878%2C878","detail":"Located in the galaxy's Mid Rim, Malastare was the homeworld of the irascible Dugs, who proved loyal but difficult members of the Galactic Republic. The planet's extensive fuel reserves made it vital to the Republic war machine, and it became a critical battlefield during the Clone Wars. As a result of a massive ground battle between the Republic and the Separatists, a monstrous creature known as the Zillo Beast was released in Malastare."},{"name":"Maldo Kreis","img":"https://lumiere-a.akamaihd.net/v1/images/maldo-kreis-main_6b106bf4.jpeg?region=372%2C0%2C537%2C537","detail":"A frozen world of ice and snow, Maldo Kreis' barren wastelands are home to caverns that may make for effective hiding places, but are filled with crawling dangers."},{"name":"Mandalore","img":"https://lumiere-a.akamaihd.net/v1/images/mandalore-main_e664e9b9.jpeg?region=1117%2C0%2C1606%2C1606","detail":"A proud world with a rich warrior culture, Mandalore is home to various clans united under Bo-Katan Kryze, wielder of the Darksaber."},{"name":"Mapuzo","img":"https://lumiere-a.akamaihd.net/v1/images/mapuzo-main_514f04e4.jpeg?region=372%2C0%2C536%2C536","detail":"A world designated for surface mining operations, Mapuzo’s landscape has been carved into tiered steps to gather its shimmering mineral wealth. The Empire prioritizes the extraction of vintrium over the needs of Mapuzo’s people. "},{"name":"Mapuzo safehouse","img":"https://lumiere-a.akamaihd.net/v1/images/jabiim-hidden-path-safehouse-main_597a836a.jpeg?region=280%2C0%2C720%2C720","detail":"A decade into the Empire's rule, the Jedi are no longer venerated peacekeepers, but instead have become transients in desperate need of assistance. Among those empathetic to their plight, the mysterious network known as the Hidden Path has created a secret web of safehouses across the galaxy meant to direct Jedi survivors and Force-sensitive fugitives to freedom. The safehouse on Mapuzo is scrawled with messages from those who have come before, familiar names and phrases of encouragement. "},{"name":"Maz's Castle","img":"https://lumiere-a.akamaihd.net/v1/images/maz_s-castle_c40bd1e2.jpeg?region=636%2C0%2C881%2C878","detail":"The ancient edifice known as Maz’s castle sits on the shore of a lake on Takodana, a site rumored to have been a battleground for the Jedi and Sith. The castle is simultaneously aged and state of the art, with sensor grids and advanced communications gear sprouting from worn stone battlements. Inside Maz’s castle, pirates, smugglers, spies and all manner of scoundrels mix and mingle, searching for loans, information, equipment, repairs -- or kicking back to enjoy music, food and drink or games of chance. All must obey their host’s prohibitions against politics or war. The First Order raided Takodana shortly before the Battle of Starkiller Base, leaving the castle in ruins and its proprietress indignant."},{"name":"Mimban","img":"https://lumiere-a.akamaihd.net/v1/images/mimban-main_87bee7cc.jpeg?region=309%2C0%2C866%2C867","detail":"Mimban’s valuable minerals have made this muddy world a battlefield since the Clone Wars. Then, the Republic was fighting Separatist droids; now, the Imperial Army seeks to destroy Mimbanese insurgents. After getting kicked out of the Imperial Academy, Han Solo found himself dumped on Mimban as a mudtrooper. While there Han met an Imperial prisoner named Chewbacca, an encounter that would change his life."},{"name":"Mokkotown","img":"https://lumiere-a.akamaihd.net/v1/images/mokkotown-main_cd4dd6ae.jpeg?region=554%2C0%2C813%2C813","detail":"After the fall of the Republic, one of the Techno Union's ipsium mines on Ipsidon was reclaimed as \"Mokkotown.\" Named for the nefarious gang boss who took over, Mokko runs the lucrative ipsium refinery with a gang of scrumrats eager to do his bidding in exchange for little more than praise and food rations."},{"name":"Mon Cala","img":"https://lumiere-a.akamaihd.net/v1/images/databank_moncala_01_169_b5bc76f1.jpeg?region=181%2C0%2C878%2C878","detail":"Also known as Mon Calamari or Dac, Mon Cala is a a beautiful aquatic world filled with lush coral reefs and kelp forests bathed by the light of twin suns.  It is home to the Mon Calamari and Quarren people. The two cultures have long clashed over their differences, but under the rule of the 82nd King of Mon Cala, Yos Kolina, these disputes were kept civil and respectful. His sudden assassination and the arrival of Separatist forces during the Clone Wars tipped the scales to civil war, with the Quarren staging an uprising against the Mon Calamari, backed by Confederacy forces and Karkaradon leader, Riff Tamson. It was up to the Jedi and Republic envoys to help young Prince Lee-Char, heir to the Mon Cala throne, restore peace to the planet."},{"name":"Moraband","img":"https://lumiere-a.akamaihd.net/v1/images/image_99e00bdb.jpeg?region=829%2C0%2C1013%2C1013","detail":"An ancient homeworld of the Sith Order, the planet was abandoned after repeated devastation following multiple wars. The red-sands planet is home to the Valley of the Dark Lords, a corridor of ancient monuments that serve as crypts for the Dark Lords of millennia past. The largest monument contains the sarcophagus of Darth Bane, founder of the Rule of Two that helped shape the modern Sith Order. This temple contained a massive execution chamber, where the ancient Sith Lords would sacrifice Jedi prisoners.\n\nYoda ventured to Moraband near the end of the Clone Wars on a spiritual journey initiated by the disembodied voice of Qui-Gon Jinn. With the guidance of five mysterious Force Priestesses, Yoda was subjected to spiritual trials, facing down illusions of ancient Sith warriors conjured by the Priestesses as well as by the power of the dark side."},{"name":"Morak","img":"https://lumiere-a.akamaihd.net/v1/images/morak-main_2ef1b5fc.jpeg?region=372%2C0%2C537%2C537","detail":"A verdant world with a warm climate, Morak is home to a rhydonium refining facility operated by Imperial remnants."},{"name":"Morlana One","img":"https://lumiere-a.akamaihd.net/v1/images/morlana-one-main_5d5a5db4.jpeg?region=460%2C1%2C807%2C803","detail":"A world under the control of the powerful Corporate Authority, the industrial waterfront cities of Morlana One give way to seedy stretches or \"Leisure Zones\" in where information can be sought without question."},{"name":"Mortis","img":"https://lumiere-a.akamaihd.net/v1/images/databank_mortis_01_169_c116d0bf.jpeg?region=341%2C0%2C878%2C878","detail":"In an uncharted region of space, Mortis is an ethereal place that defies conventional description. During the Clone Wars, an immense monolith appeared in the Chrelythiumn system, broadcasting an ancient Jedi distress code. Anakin Skywalker, Obi-Wan Kenobi and Ahsoka Tano investigated the kilometers-wide artifact, and were drawn into a paradise realm inhabited by unspeakably powerful Force-wielders. These god-like beings were locked in an eternal struggle for dominance, which made Mortis the fulcrum of the entire galaxy and the Force."},{"name":"Mos Eisley Cantina","img":"https://lumiere-a.akamaihd.net/v1/images/mos-eisley-cantina-main_4786e80c.jpeg?region=471%2C1%2C536%2C535","detail":"The Mos Eisley cantina is a dimly-lit tavern known for its strong drinks, hot tunes, and occasional outbreaks of shocking violence. Most star pilots visiting Tatooine spend their downtime in the cantina, making it an ideal spot to hire a starship's crew."},{"name":"Mos Eisley Mod Parlor","img":"https://lumiere-a.akamaihd.net/v1/images/mos-eisley-mod-parlor-main_b7090359.jpeg?region=372%2C0%2C536%2C536","detail":"Music blares from the mod parlor on the outskirts of Tatooine. This is where members of the Modifier gang come to upgrade or replace their cybernetic components."},{"name":"Mos Eisley spaceport","img":"https://lumiere-a.akamaihd.net/v1/images/mos-eisley-main_19893c0f.jpeg?region=351%2C0%2C538%2C536","detail":"A major spaceport on Tatooine, Mos Eisley was once wisely described as a wretched hive of scum and villainy. The famously lawless port on the surface of the desert world was once home to Hutt servants, rogues and smugglers of all species, lowlifes and fugitives, and desperate people trying to make a living any way they could. Whether one visited during the Clone Wars or under Imperial rule, in Mos Eisley, money talked (in various denominations) and questions weren’t asked. "},{"name":"Mos Espa","img":"https://lumiere-a.akamaihd.net/v1/images/mos-espa-main_9702f604.jpeg?region=580%2C0%2C538%2C536","detail":"Mos Espa is one of few port cities on Tatooine. Domed buildings protect the citizens against the glare of the twin suns and the scorching heat. Among the dwellings, workspaces, and commercial operations of many bizarre kinds there are also entertainment areas, including some of colossal scale. The famed Mos Espa Grand Arena can hold an audience almost as large as the city's entire population.  In the time of the Republic, slavery persisted in Mos Espa, though the despicable trade was outlawed elsewhere. The true powers in control of Mos Espa were the Hutt gangsters, who found slavery a useful institution."},{"name":"Mos Espa City Hall","img":"https://lumiere-a.akamaihd.net/v1/images/mos-espa-city-hall-main_77a87598.jpeg?region=372%2C0%2C536%2C536","detail":"Compared to Mos Eisley, Mos Espa is a larger, more well maintained city and its city hall reflects a greater sense of civic pride and duty. In the last days of the Empire, the Tatooine hub exists under the guidance of Mayor Mok Shaiz."},{"name":"Mos Espa Grand Arena","img":"https://lumiere-a.akamaihd.net/v1/images/databank_monespagrandarena_01_169_ed7e9c8e.jpeg?region=550%2C0%2C877%2C878","detail":"On the outskirts of Mos Espa was an immense venue for watching the popular Boonta Eve Classic Podrace. Over one hundred thousands beings filled the Mos Espa Grand Arena to capacity during the annual event. For a modest fee, spectators could rent hand-held viewscreens which displayed images recorded by fast-flying Podrace holocams tracking the race. The wealthier of Mos Espa's residents and guests could afford private viewing boxes separated from the rest of the rabble."},{"name":"Mos Espa Worker’s District","img":"https://lumiere-a.akamaihd.net/v1/images/mos-espa-worker-s-district-main_235b9cbc.jpeg?region=211%2C0%2C538%2C536","detail":"In the tumult following the death of Jabba the Hutt, the economically depressed Worker’s District of Mos Espa remains under the control of an Aqualish crime family.\n"},{"name":"Mount Tantiss","img":"https://lumiere-a.akamaihd.net/v1/images/mount-tantiss-main_73527e6e.jpeg?region=370%2C0%2C541%2C541","detail":"The majestic peak of Mount Tantiss conceals a secret Imperial base on the world of Wayland — a natural beauty hiding a beastly laboratory. The facility is run by Dr. Royce Hemlock, head of the Empire's Advanced Science Division. Utilizing the cloning technology stolen from Kamino, the group is involved in ghastly human experimentation on clone prisoners and other top-secret initiatives known only to high-ranking Imperials."},{"name":"Mustafar","img":"https://lumiere-a.akamaihd.net/v1/images/databank_mustafar_01_169_5b470758.jpeg?region=645%2C0%2C877%2C878","detail":"A tiny, fiery planet in the Outer Rim, Mustafar maintains an erratic orbit between two gas giants. Mustafar is rich in unique and valuable minerals which have long been mined by the Tech Union. Its lava pits and rivers make this planet a dangerous habitat; its natives have burly, tough bodies that can withstand extreme heat. The planet became the backdrop for the fateful duel between Obi-Wan Kenobi and Anakin Skywalker. After the rise of the Empire, captured Jedi were brought to the volcanic world for interrogation and execution."},{"name":"Mygeeto","img":"https://lumiere-a.akamaihd.net/v1/images/mygeeto-main-image_91c503cc.jpeg?region=344%2C0%2C666%2C665","detail":"A frigid Outer Rim planet marked by jagged crystalline landscapes, Mygeeto was the homeworld of the Lurmen and controlled by the InterGalactic Banking Clan. During the Outer Rim Sieges, Ki-Adi-Mundi and clone forces under Commander Bacara battled Separatist droids for control of Mygeeto. When Supreme Chancellor Palpatine issued Order 66, Bacara and his clones shot their Jedi General dead."},{"name":"Mykapo","img":"https://lumiere-a.akamaihd.net/v1/images/mykapo_5c4f89e8.jpeg?region=460%2C0%2C878%2C878","detail":"Mykapo was the homeworld of Jun Sato, a commander in the rebellion. As the Empire solidified its hold on the planet, the rebels evacuated sympathetic citizens off the world. The Empire later used Sato’s nephew, a young rebel named Mart Mattin, as bait to draw the commander and his fleet out. While neither were captured, and the rebels disabled an Imperial light cruiser in an impressive display of battlefield creativity, the Empire maintained control of Mykapo."},{"name":"Naboo","img":"https://lumiere-a.akamaihd.net/v1/images/databank_naboo_01_169_6cd7e1e0.jpeg?region=341%2C0%2C878%2C878","detail":"An idyllic world close to the border of the Outer Rim Territories, Naboo is inhabited by peaceful humans known as the Naboo, and an indigenous species of intelligent amphibians called the Gungans. Naboo's surface consists of swampy lakes, rolling plains and green hills. Its population centers are beautiful -- Naboo's river cities are filled with classical architecture and greenery, while the underwater Gungan settlements are a beautiful display of exotic hydrostatic bubble technology."},{"name":"Nal Hutta","img":"https://lumiere-a.akamaihd.net/v1/images/databank_nalhutta_01_169_72d58d25.jpeg?region=341%2C0%2C878%2C878","detail":"A ringed, marshy bog planet controlled by the Hutts, Nal Hutta has long been a haven for criminal activity, far from the prying eyes of galactic authorities. Its hot atmosphere is frequently streaked by greasy rain, creating a fetid sauna in which Hutts are most comfortable. Hutt cities are built on what little firm land there is, including the sprawling spaceport market of Bilbousa. A number of floating homes also dot the bayous -- visitors traverse the bogs on repulsorlift fanboats, risking the attention of dragonsnakes and other dangerous creatures."},{"name":"Nala Se's private lab","img":"https://lumiere-a.akamaihd.net/v1/images/nala-se-s-private-lab-main_daf47e66.jpeg?region=369%2C0%2C542%2C542","detail":"Secreted away below the watery surface of Kamino, the chief medical scientist Nala Se keeps a private lab known to only a few, including Omega. With a tube system leading directly to a hidden platform for entry and exit, the hidden lab is the perfect place for experimentation. The lab serves as the birth place of Clone Force 99, the site of the testing and augmentation that helps give the elite squad their unique abilities."},{"name":"Naraka","img":"https://lumiere-a.akamaihd.net/v1/images/naraka_6589d28f.jpeg?region=341%2C0%2C878%2C878","detail":"The Empire erected prisons throughout the galaxy, holding everyone from dissidents to petty criminals. On Naraka, a world of haze and rock, a prison was built into the planet itself, making escape especially difficult. The Ghost crew, however, pulled it off, rescuing the pirate Hondo Ohnaka."},{"name":"Narkina 5","img":"https://lumiere-a.akamaihd.net/v1/images/narkina-5-main_495a8873.jpeg?region=558%2C0%2C804%2C804","detail":"A watery world of islands, inlets, and massive lakes, Narkina 5 is also home to a secluded and secretive Imperial prison complex. Inside the seven levels, hundreds of inmates toil on sterile factory floors, producing an array of mysterious widgets at grueling output quotas to power the Imperial war machine."},{"name":"Naval Intelligence Headquarters","img":"https://lumiere-a.akamaihd.net/v1/images/the-bad-batch-story-gallery-the-outpost-01_701e5ca3.jpeg?region=554%2C0%2C813%2C813","detail":"On Coruscant, Naval Intelligence Headquarters serves as the epicenter for the Empire's naval operations. A homebase for mission command, the hub is also the last stop for clone troopers at the end of their service as they ready for retirement at the start of the stormtrooper program. "},{"name":"Nevarro","img":"https://lumiere-a.akamaihd.net/v1/images/nevarro-main_deddc805.jpeg?region=372%2C0%2C537%2C537","detail":"An ashen world with black sands and lava flows, Nevarro was home to an Imperial Remnant, a hub of the Bounty Hunter Guild, as well as the location of a Mandalorian covert in the early days of the New Republic. Now it's been rehabilitated as a more peaceful planet for its citizens and with a school for its youngsters."},{"name":"Nevarro bazaar","img":"https://lumiere-a.akamaihd.net/v1/images/nevarro-bazaar-main_4bb1fb7c.jpeg?region=380%2C0%2C538%2C536","detail":"On the surface of Nevarro, vast stretches of cooled volcanic rock give way to sparse settlements. In one town, the smell of roasting Kowakian monkey-lizard on the grill wafts over a thriving bazaar where merchants sell their wares. "},{"name":"Niamos","img":"https://lumiere-a.akamaihd.net/v1/images/niamos-main_8c1b140e.jpeg?region=558%2C0%2C804%2C804","detail":"A world of inviting waters and pleasant beaches for basking in the warm sunshine, Niamos was once an alluring place for ne’er-do-wells to lie low and avoid scrutiny. But now, an Imperial occupation and wildly evolving rules means trouble for innocent travelers caught in the crossfire of the galaxy's turmoil. "},{"name":"Nightsisters’ Temple on Arcana","img":"https://lumiere-a.akamaihd.net/v1/images/nightsisters-temple-on-arcana-main_0fce0038.jpeg?region=558%2C0%2C804%2C804","detail":"Long ago, the Nightsisters of Dathomir erected a temple on the world of Arcana. Although it fell to ruin over the years, after Ahsoka Tano stole a star map from within its walls, the temple was all-but vaporized in the ensuing battle between the Jedi and the HK enforcer droids acting on behalf of the Nightsister Morgan Elsbeth."},{"name":"Niima Outpost","img":"https://lumiere-a.akamaihd.net/v1/images/niima-outpost_37882042.jpeg?region=520%2C0%2C1040%2C1040","detail":"Jakku’s most significant settlement, Niima Outpost is little more than a bazaar, some hard-packed dirt that passes for a spaceport, and the compound of junk boss Unkar Plutt. The little settlement – named for its late founder, Niima the Hutt – is dominated by Unkar and his thugs, who control the market for salvage found by scavengers in the nearby Graveyard of Ships."},{"name":"Nixus","img":"https://lumiere-a.akamaihd.net/v1/images/nixus_a8e2cad2.jpeg?region=176%2C0%2C878%2C878","detail":"A planet of ice and frozen terrain, Nixus was frigid but not inhospitable. The world was populated, featuring a diverse populace — including the slimy crime lord Azmorigan. It was on Nixus that Azmorigan encountered the legendary pirate Hondo Ohnaka and met Ezra Bridger for the second time, though they managed to escape the gangster’s clutches."},{"name":"Numidian Prime","img":"https://lumiere-a.akamaihd.net/v1/images/solo-db-numidian-prime-main-image_b0ab34cd.jpeg?region=396%2C0%2C878%2C878","detail":"The jungle planet of Numidian Prime is located on the edge of the Mid Rim, a warm and beautiful rainforest paradise that's also a haven for smugglers and thieves trying to avoid outstanding debts."},{"name":"Nur","img":"https://lumiere-a.akamaihd.net/v1/images/nur-main_addbdab4.jpeg?region=372%2C0%2C536%2C536","detail":"On the watery moon of Nur, the ocean depths conceal all but the apex of the Fortress Inquisitorius."},{"name":"Oba Diah","img":"https://lumiere-a.akamaihd.net/v1/images/databank_obadiah_01_169_cbb9d94d.jpeg?region=341%2C0%2C878%2C878","detail":"The Pykes ran their affairs from the planet Oba Diah, where they dwelled in decadent luxury among mountain crags and busy spaceports where much illicit cargo changed hands. During the Clone Wars, Anakin Skywalker and Obi-Wan Kenobi came to Oba Diah, where they investigated a conspiracy leading back more than a decade. They discovered the Pykes had shot down a shuttle belonging to the Jedi Master Sifo-Dyas on their planet’s moon and given Sifo-Dyas’s body to Count Dooku, known to them as Tyranus, in return for his assistance against other crime families. But the Pykes didn’t tell Dooku that Supreme Chancellor Valorum’s aide Silman had survived the crash, and kept him locked away as insurance. The Pykes gave Silman to Anakin and Obi-Wan, but Dooku arrived and killed Silman before he could be questioned."},{"name":"Oba Diah's Moon","img":"https://lumiere-a.akamaihd.net/v1/images/image_a5f215ce.png?region=316%2C0%2C806%2C806","detail":"During the Clone Wars, the Jedi received a distress signal on Coruscant from a long-lost ship – the Jedi shuttle belonging to Sifo-Dyas, who’d died more than a decade earlier. Plo Koon and a detachment of clone troopers tracked the signal to a bleak moon orbiting Oba Diah, searching through howling dust storms until they found the wreckage. Inside the shattered shuttle, Plo found Sifo-Dyas’s lightsaber. This clue would lead the Jedi into a web of deceit involving the Pyke Syndicate, the Kaminoans, the clone armies of the Republic and the hidden Dark Lord of the Sith."},{"name":"Obi-Wan's House","img":"https://lumiere-a.akamaihd.net/v1/images/obi-wans-house-main-image_c9c146ef.jpeg?region=57%2C0%2C704%2C705","detail":"After the fall of the Republic and the near-extinction of the Jedi Order, Obi-Wan Kenobi spent his exile in a simple adobe house in Tatooine’s Jundland Wastes. There, he learned to commune with the spirit of his former master Qui-Gon Jinn and watched over Anakin Skywalker’s son Luke. When Darth Vader captured Princess Leia over Tatooine, she hid the Death Star plans in R2-D2’s memory banks and gave the little droid the coordinates of Kenobi’s home."},{"name":"Office of Acquisitions","img":"https://lumiere-a.akamaihd.net/v1/images/resistance-db-office-of-acquisitions-main-image_712640dc.jpeg?region=341%2C0%2C878%2C878","detail":"Business partners Flix and Orka run a tidy business on the Colossus platform, the Office of Acquisitions. While fussy Flix handles the books for the business, Orka negotiates with customers at the counter, selling quality tech and secondhand parts both routine and rare. Along with their pet gorg, Bitey, and their Pit droid, the team rarely closes up shop, but will sometimes leave the business in the capable hands of Kazuda Xiono when they need a day off."},{"name":"Oga’s Cantina","img":"https://lumiere-a.akamaihd.net/v1/images/ogas-cantina-main-2_4231bbfd.jpeg?region=560%2C0%2C720%2C720","detail":"Oga’s Cantina is a notorious local watering hole in Black Spire Outpost known for its shady clientele of bounty hunters, smugglers, and off-worlders sampling unique concoctions, conducting shady business, and encountering friends and foes. Run by the local crime boss, Oga Garra, the cantina adheres to a strict code of conduct that tries to keep its unruly patrons in check. With a history of being a smugglers’ safe haven and a popular stopping point for those seeking to avoid the authorities, Oga’s Cantina has a story or two to tell. Musical entertainment is provided courtesy of former pilot droid RX-24, who has been reprogrammed and renamed to DJ R-3X."},{"name":"Old Jho's Pit Stop","img":"https://lumiere-a.akamaihd.net/v1/images/image_a7ca8bca.jpeg?region=243%2C0%2C1080%2C1080","detail":"Located in a Lothal spaceport, Old Jho's Pit Stop is a popular cantina for locals and travelers alike."},{"name":"Old Ord Mantell City","img":"https://lumiere-a.akamaihd.net/v1/images/old-ord-mantell-city-main_9141853c.jpeg?region=558%2C0%2C542%2C542","detail":"In the ruins of what was once an impressive array of fortresses and beautiful edifices, Zygerrian slave traders maintain their captives in the decaying remains of Old Ord Mantell City. Like the rest of the planet in the time after the Clone Wars, Ord Mantell and its once thriving urban hubs have lost their luster with the decline of the Republic."},{"name":"Omega's Room (Marauder)","img":"https://lumiere-a.akamaihd.net/v1/images/omega-s-room_a0bcd733.jpeg?region=536%2C0%2C540%2C540","detail":"Aboard the Marauder, a space that once served as the shuttle's gunner's nest is renovated to meet the needs of the changing face of Clone Force 99. After joining the squad, young Omega is gifted the space by Wrecker, who uses his interior design skill to make the corner of the ship more suitable to the youngster. The private bunk offers safety, security, and something Omega never experienced in her life on Kamino — a place to call her own."},{"name":"Omega's room (Mount Tantiss)","img":"https://lumiere-a.akamaihd.net/v1/images/omegas-room-mount-tantiss-main_e1cd79cf.jpeg?region=107%2C0%2C806%2C807","detail":"Inside the hidden Imperial complex on Mount Tantiss, Omega’s tiny room is more of a cell than a home. With a narrow, barred window providing her only glimpse at the outside world, Omega tracks the days she’s been trapped on Wayland through a series of tick marks. As stark and clinical as the rest of the medical facility, the room contains only the essentials: a sink, a slab for sleeping, and a lunch pail. Personal items are forbidden."},{"name":"Onderon","img":"https://lumiere-a.akamaihd.net/v1/images/databank_onderon_01_169_bf7861a4.jpeg?region=325%2C0%2C878%2C878","detail":"In its earliest ages of civilization, Onderon was a world marked with savage jungles that were filled with dangerous creatures. To survive, the primitive human inhabitants of the planet protected themselves behind the walls of fortified settlements. Over time, these grew to become enormous walled cities, like the planet's capital, Iziz. In the modern era, during the time of the Clone Wars, the planet's monarch King Sanjay Rash allied Onderon to the Confederacy of Independent Systems. Many Onderonians, however, refused to recognize the legitimacy of Sanjay's rule -- they preferred the neutral stance championed by former monarch Ramsis Dendup, whom Rash ousted."},{"name":"Oosalon Mesa","img":"https://lumiere-a.akamaihd.net/v1/images/oosalon-mesa_fde764ce.jpeg?region=309%2C0%2C877%2C878","detail":"A barren world, the Inquisitors dueled the rebels Kanan Jarrus and Ezra Bridger over its black, rocky landscape."},{"name":"Ord Mantell","img":"https://lumiere-a.akamaihd.net/v1/images/ordo-mantell-main_0320929c.jpeg?region=369%2C0%2C542%2C542","detail":"In the waning days of the Republic, Ord Mantell housed a base of operations for the Black Sun crime syndicate. During the Clone Wars, it was the site of a battle between the Separatists and the Shadow Collective, of which Black Sun was a member. But after the Empire came to power, the inhabitants of the mountainous world fell on hard times, laying low and working jobs where no questions would be asked. It was still a wretched hive of scum and villainy when Rebel Alliance general and former smuggler Han Solo had a run-in with a bounty hunter on the planet some years later."},{"name":"Ordo Moon","img":"https://lumiere-a.akamaihd.net/v1/images/replacements-the-bad-batch-story-gallery-01_fb353e20.jpeg?region=158%2C0%2C540%2C540","detail":"After fleeing Saleucami, Clone Force 99 is stranded on the Ordo Moon, crash landing on the rock thanks to a damaged power capacitor. The planetoid's atmosphere requires special breathing apparatus and its surface is pocked with debris and mysterious scavengers."},{"name":"Orto Plutonia","img":"https://lumiere-a.akamaihd.net/v1/images/databank_ortoplutonia_01_169_104eb34c.jpeg?region=341%2C0%2C878%2C878","detail":"Ice world in the Pantoran system that is home to the Talz."},{"name":"Otoh Gunga","img":"https://lumiere-a.akamaihd.net/v1/images/databank_otohgunga_01_169_554653bd.jpeg?region=341%2C0%2C878%2C878","detail":"Beneath the surface of Lake Paonga on Naboo is a spectacular Gungan city. A crowning achievement of unique Gungan technology, the city appears as a glittering cluster of jewel-like bubbles. The bubbles are hydrostatic force-fields that contain breathable atmospheres for the city's inhabitants. Though they are rigid enough to keep the water out, they can be breached by Gungans swimming to and from the city. The architecture of Otoh Gunga is sweeping in shape because Gungans actually grow the building material of their cities. Inside Otoh Gunga is the High Board Room of the Gungan Rep Council."},{"name":"Pabu","img":"https://lumiere-a.akamaihd.net/v1/images/pabu-main_e05c85ab.jpeg?region=329%2C1%2C540%2C540","detail":"On the small planet of Pabu, Phee Genoa and other refugees from across the galaxy make their home on an island village surrounded by a sapphire sea. An oasis in a troubled galaxy, the hidden sanctuary provides a peaceful respite for Omega and the rest of Clone Force 99 after they cut ties with Cid. Together, the villagers endure natural disasters and rebuild their home. But it’s only a matter of time before the Empire arrives at their doorstep."},{"name":"Pabu Archium","img":"https://lumiere-a.akamaihd.net/v1/images/pabu-archium-main_4c962e04.jpeg?region=690%2C0%2C813%2C813","detail":"The Archium on Pabu serves as a monument to the galaxy's eclectic blend of cultures, housing and preserving collected historical artifacts that represent the remnants of cultures from across the stars. Built at the highest point of Upper Pabu, it majestically towers over the island, a reminder of the many people under threat by the expansion of the Empire."},{"name":"Pabu cove","img":"https://lumiere-a.akamaihd.net/v1/images/pabu-cove-main_a7f16435.jpeg?region=370%2C0%2C541%2C541","detail":"There’s a rocky cove in a largely uninhabited part of the island oasis on the world of Pabu that’s a perfect retreat for those looking to escape into their thoughts. But within the cave, stealthy visitors can also find a perfect hiding spot."},{"name":"Padmé's Apartment","img":"https://lumiere-a.akamaihd.net/v1/images/padmes-apartment_8dcb4c69.jpeg?region=314%2C0%2C666%2C666","detail":"During her tenure as a senator, Padmé Amidala kept an apartment near the top of one of Coruscant’s high-rises in the senate district. Largely decorated in blue, no doubt to remind her of her home planet of Naboo, it was spacious and luxurious and the site of many important moments in the galaxy, from her assassination attempt at the hands of Zam Wesell to Obi-wan Kenobi’s revelation that her husband was a Sith Lord."},{"name":"Pantora","img":"https://lumiere-a.akamaihd.net/v1/images/pantora-main_3553f73c.jpeg?region=178%2C1%2C542%2C540","detail":"Pantora is the principal moon of the Pantora system, orbiting the ice planet Orto Plutonia. A member of the Galactic Republic during the Clone Wars, Riyo Chuchi represented Pantora in the Senate while Baron Papanoida served as the Chairman of Pantora after succeeding Chi Cho. At the start of the age of the Empire, the marshy Outer Rim world struggles to maintain its business and industry under the new regime, with outposts like Ro Station falling into disrepair. However, in the streets the citizens rejoice over the end of the long and deadly war."},{"name":"Pasaana","img":"https://lumiere-a.akamaihd.net/v1/images/pasaana-main_716cbcfa.jpeg?region=427%2C0%2C537%2C536","detail":"The desert planet of Pasaana is full of life and culture. Towering buttes of granite and sandstone disrupt long stretches of sun-bleached dunes and shrubland, creating shadowed valleys where water collects and life thrives, including the native Aki-Aki."},{"name":"Peli Motto's hangar","img":"https://lumiere-a.akamaihd.net/v1/images/peli-motto-s-hangar-main_b64f8bdd.jpeg?region=372%2C0%2C536%2C536","detail":"Docking Bay 3-5 is one of a multitude of crater-like launch stations that dot Mos Eisley Spaceport. The landing facility is mostly sunken below the ground level, with stairs and service ramp leading up to the street level. The mid-sized hangar has repair and diagnostic equipment as well as fueling supplies. "},{"name":"Peridea","img":"https://lumiere-a.akamaihd.net/v1/images/peridia-main_3c33c386.jpeg?region=167%2C1%2C806%2C803","detail":"An ancient world, Peridea is the home of the Dathomirian ancestors in the far galaxy. It is a world spoken of in fragmented records in the Jedi Archives, which describes it as the terminus of a migration route for pods of purrgil traversing the void between galaxies. And it is here that Ezra Bridger and Grand Admiral Thrawn have been exiled."},{"name":"Pillio","img":"https://lumiere-a.akamaihd.net/v1/images/pillio_571ed74e.jpeg?region=195%2C0%2C878%2C878","detail":"Due to its enormous amount of sea life, and the tremendous coral reef across the entire planet, Pillio is an oceanic world. As a primary source for food in the Jinata System, Pillio is a very profitable destination for feuding Mon Calamari and Nautolan fishing companies. A deep coral cave system houses ancient fossils, rare species, and deeper secrets no fisherman would ever trap in his net."},{"name":"Polis Massa","img":"https://lumiere-a.akamaihd.net/v1/images/databank_polismassa_01_169_21f04b76.jpeg?region=683%2C0%2C877%2C878","detail":"An obscure planetoid deep in the Outer Rim, Polis Massa nonetheless occupied an important place in galactic history: The Skywalker twins were born there and given names by their mother Padmé Amidala before she died. And plans made in secret on Polis Massa would one day determine the fate of the galaxy."},{"name":"Purkoll Tower Base","img":"https://lumiere-a.akamaihd.net/v1/images/purkoll-tower-base-main_fbf96178.jpeg?region=378%2C0%2C546%2C544","detail":"Hovering above the dense yellow fog of Skako Minor, the city of Purkoll is home to a tower base controlled by Wat Tambor and the Separatists. But inside the Separatists are holding a dark secret, protecting the key to their survival and their sudden strategic advantages in the Clone Wars. Known as the algorithm, the Republic soon discovers how the battle droids have suddenly become adept at anticipating the clone troopers' every move."},{"name":"Pyke Base","img":"https://lumiere-a.akamaihd.net/v1/images/pyke-base-main_d26d8ee5.jpeg?region=431%2C0%2C538%2C536","detail":"The Pykes maintain a modest base in a small domed structure. From here, the Pyke Boss monitors their criminal enterprise transporting spice by repulsor-train to settlements. "},{"name":"Pyke stronghold","img":"https://lumiere-a.akamaihd.net/v1/images/pyke-stronghold-main_8963e3fb.jpeg?region=358%2C0%2C544%2C544","detail":"On the planet Oba Diah, the Pykes run their affairs, including housing those who dare to cross them in a fortress-like prison inside their stronghold."},{"name":"Quarzite","img":"https://lumiere-a.akamaihd.net/v1/images/databank_quarzite_01_169_f9480d2f.jpeg?region=43%2C0%2C878%2C878","detail":"A small, dense world whose inhospitable nature prevents it from truly flourishing as part of the galactic community, Quarzite avoided the battles that ravaged many planets during the Clone Wars. The world's surface is strained by incredibly strong atmospheric pressure that can crush starships and flatten beings. Underneath the surface, though, are immense crystalline cave networks of equalized pressure, where life can exist. For transit to and from the planet, an immense turbolift speeds people to an orbital space station. For travel beneath the surface, the locals rely on a subtram."},{"name":"Rafa's Laundry","img":"https://lumiere-a.akamaihd.net/v1/images/rafa-s-laundry-main_707b3627.jpeg?region=202%2C0%2C545%2C544","detail":"An above-board business to keep the citizens of the Coruscant underworld looking their best, Rafa Martez runs a laundry facility she won gambling, which acts as a convenient front for her more lucrative but illegal jobs."},{"name":"Raven's Peak","img":"https://lumiere-a.akamaihd.net/v1/images/ravens-peak-main_e94f86aa.jpeg?region=980%2C0%2C813%2C813","detail":"Accessible by sky rail, Raven's Peak is a highly controlled military compound on the world of Eriadu. Run by Grand Moff Tarkin, it's the perfect location for clandestine meetings with Tarkin's council of trusted advisors as these high-ranking officials discuss the Empire's technological advancements in the regime's early days. However, it quickly becomes the target of factions who seek to overthrow the Empire."},{"name":"Raven's Peak Sky Rail","img":"https://lumiere-a.akamaihd.net/v1/images/the-bad-batch-story-gallery-plan-99-01_34d7c21d.jpeg?region=483%2C0%2C814%2C813","detail":"On Eriadu, Imperial personnel traverse the mountainous terrain on fast-moving sky rails suspended from rail lines. The sky rails of the Raven's Peak Rail Line consist of two crate-shaped cars on parallel tracks which constantly shuffle troops back and forth to Grand Moff Tarkin's elite compound."},{"name":"Raxus","img":"https://lumiere-a.akamaihd.net/v1/images/raxus-main_04672c4d.jpeg?region=369%2C0%2C542%2C542","detail":"The capital of the Confederacy of Independent Systems, Raxus was a lush world in the Outer Rim. The Separatist Senate met on Raxus, with Count Dooku generally presiding via hologram. The planet was the site of secret discussions between the Republic’s Padmé Amidala and her old friend, Separatist Senator Mina Bonteri, which led to a brief-lived Separatist peace proposal. Later in the war, Asajj Ventress and Quinlan Vos tried and failed to assassinate Dooku on Raxus."},{"name":"Raydonia","img":"https://lumiere-a.akamaihd.net/v1/images/databank_raydonia_01_169_6353aa74.jpeg?region=165%2C0%2C878%2C878","detail":"A small, easily overlooked world in the Outer Rim Territories, Raydonia was the site of a settlement that required supplies from regularly scheduled transport ships. The colonists had the misfortune of being relatively close to Dathomir, where an evil was reborn. Darth Maul wanted to draw the attention of the Jedi, and to do so, he wiped out the colony with the viciousness of a Sith Lord. Obi-Wan Kenobi voyaged to the ruined settlement to stop Maul's swath of destruction."},{"name":"Rebellion Outpost on Aeos","img":"https://lumiere-a.akamaihd.net/v1/images/rebellion-outpost-on-aeos-main_94d8b439.jpeg?region=280%2C0%2C720%2C720","detail":"After the rise of the First Order, troopers from the new regime ensure that old Rebel Alliance bases and outposts would be of no use to the Resistance fighters."},{"name":"Reklam Station","img":"https://lumiere-a.akamaihd.net/v1/images/reklam-station_a5c15acd.jpeg?region=366%2C0%2C877%2C878","detail":"An Imperial salvage yard, Reklam Station was positioned in the atmosphere of the planet Yarma. The Empire used Reklam Station to turn old starships and vessels into scrap, often using slave labor to run its operations. The Ghost crew attempted to steal Y-wings from Reklam, but the mission did not go smoothly, and the station was destroyed."},{"name":"Rey's Home","img":"https://lumiere-a.akamaihd.net/v1/images/reys-home_302bcc70.jpeg?region=273%2C0%2C1040%2C1040","detail":"The Jakku scavenger Rey lived in a unique home – an AT-AT walker toppled near the outskirts of the Graveyard of Ships. The walker was once Hellhound Two, from the Imperial Star Destroyer Interrogator; Rey made a home for herself in its former troop compartment. There she cleaned equipment scavenged from the sands, cooked, slept, and dreamt of the day her family would return and take her away from Jakku."},{"name":"Ringo Vinda","img":"https://lumiere-a.akamaihd.net/v1/images/ACW_IA_114390-resize_6a7d6d59.jpeg?region=541%2C0%2C838%2C838","detail":"A planet ringed by a massive orbital space station, Ringo Vinda became a battlefield during the Clone Wars, with Republic and Separatist forces fighting corridor by corridor and room by room. The Republic’s bid to retake the station, led by Anakin Skywalker, faltered after the clone trooper Tup killed Jedi General Tiplar. Tup’s bizarre act was noted by the Separatist commander Admiral Trench, who reported it to Count Dooku."},{"name":"Rishi Station","img":"https://lumiere-a.akamaihd.net/v1/images/rishi-station_2536a9b0.jpeg?region=449%2C0%2C663%2C663","detail":"Rishi Station was a vital Republic listening post during the Clone Wars, located on the barren moon of Rishi. The primary mission of the clones stationed at the base was to monitor transmissions and sound the alarm in the event it was determined that Separatist forces planned to attack Kamino. Early in the war, Separatist Commando droids take control of the base, but a squad of clones recapture the base and alert the Republic to the planned attack."},{"name":"Rodia","img":"https://lumiere-a.akamaihd.net/v1/images/databank_rodia_01_169_6f76b79d.jpeg?region=523%2C0%2C877%2C878","detail":"Jungle planet that is home to the Rodian species. Its inhabitants live in domed cities."},{"name":"Royal Palace of Alderaan","img":"https://lumiere-a.akamaihd.net/v1/images/royal-palace-of-alderaan-main_97f8abf2.jpeg?region=372%2C0%2C536%2C536","detail":"Stretching into the clean mountain air beyond the central city of Aldera, the Royal Palace of Alderaan is the residence of Queen Breha Organa and her family. "},{"name":"Rugosa","img":"https://lumiere-a.akamaihd.net/v1/images/databank_rugosa_01_169_cef61f9c.jpeg?region=683%2C0%2C877%2C878","detail":"A neutral moon not far from Toydaria, Rugosa was the intended rendezvous point for Jedi Master Yoda and King Katuunko of the Toydarians during the Clone Wars. There, they were to negotiate a treaty that would transform Toydaria into a key Republic outpost in Hutt Space. Unfortunately, Separatist spies intercepted word of the meeting, and Confederacy warships ambushed Yoda's vessel en route to Rugosa. Yoda survived the attack, reaching Rugosa's surface, and cemented the alliance with the Toydarians."},{"name":"Ryloth","img":"https://lumiere-a.akamaihd.net/v1/images/ryloth-main_72a1cd8c.jpeg?region=369%2C0%2C543%2C543","detail":"Ryloth is the principal planet in the Ryloth system located in the Outer Rim near Tatooine. It is home to the Twi'leks, a humanoid species with two large, fleshy head-tails growing from their skulls. The Twi'leks call these prehensile appendages lekku and can communicate through subtle lekku gestures, although they also speak Twi'leki. During the Clone Wars, scheming Separatist warlords blockaded and invaded Ryloth, hoping to steal its riches. But after the war, dreams of a free Ryloth evaporated under the iron fist of Imperial occupation."},{"name":"Saleucami","img":"https://lumiere-a.akamaihd.net/v1/images/saleucami-main_41b56ea0.jpeg?region=371%2C0%2C539%2C539","detail":"A world of mixed terrain, from dank, swampy environments marked with strange bulbous plant-life, to arid deserts, Saleucami is an Outer Rim planet that remained untouched by the Clone Wars through most of the fighting. The settlers on Saleucami wished to avoid the destruction of warfare, and live out a simple existence at peace, only doing battle with the elements. Unfortunately, combat did come to Saleucami -- it was a major battle site during the Outer Rim Sieges of the Clone Wars -- and even after the end of the Clone Wars, the long arm of Imperial law sought to bring a new order to the once peaceful planet."},{"name":"Santhe Shipyards","img":"https://lumiere-a.akamaihd.net/v1/images/santhe-shipyard-main_4027329f.jpeg?region=519%2C0%2C883%2C883","detail":"After the fall of the Empire, many of the factories on Corellia now work in service to the New Republic. This evolution is most obvious in places like the Santhe Shipyards, where remnants of Imperial technology remain in the metal bones of incomplete Star Destroyers. These war machines are being deconstructed, their hyperdrive generator cores reclaimed to power new ships built for defense.\n"},{"name":"Sarlacc Pit","img":"https://lumiere-a.akamaihd.net/v1/images/sarlacc-pit-main_d8851a67.jpeg?region=372%2C0%2C536%2C536","detail":"The Sarlacc rests in the sandy well known as the Great Pit of Carkoon, a sunken beast of enormous size with only its ghastly mouth visible, a beaked maw lined with spiky teeth and well-muscled tentacles. The strange creature's lair was the site of many spectacles for Jabba the Hutt, who entertained himself by forcing prisoners into the pit to be digested, according to local legend, over 1,000 years."},{"name":"Savareen","img":"https://lumiere-a.akamaihd.net/v1/images/savareen-main_3d3f60bc.jpeg?region=228%2C0%2C866%2C867","detail":"A planet at one spur of the Kessel Run, Savareen is a world marked by desert landmasses amid huge oceans. The Pnakotic coast is home to an abandoned refinery used by criminals who have smuggled valuable minerals from Kessel."},{"name":"Savareen refinery","img":"https://lumiere-a.akamaihd.net/v1/images/solo-db-savareen-refinery-main-image_a52543f5.jpeg?region=325%2C0%2C878%2C878","detail":"On the off-the-grid planet of Savareen, the Bis Refinery is among the last of the coaxium-processing facilities not under the control of the Empire. Once a prosperous independent factory stripped down and ransacked by Crimson Dawn, the industrial facility is now a shadow of its former self with a complex system of machinery barely maintained through a crude patchwork of scavenged parts. Still, the areas of the plant that have been most completely restored can be used for small batches."},{"name":"Scarif","img":"https://lumiere-a.akamaihd.net/v1/images/scarif-main-b_f5298baa.jpeg?region=523%2C0%2C877%2C878","detail":"The planet Scarif would be a beautiful tropical paradise if not for the presence of a major Imperial military installation. Scarif is the principal construction facility for the vast Imperial war machine. The world is enveloped in impenetrable deflector shields and is heavily defended."},{"name":"Scipio","img":"https://lumiere-a.akamaihd.net/v1/images/databank_scipio_01_169_1d105bfb.jpeg?region=512%2C0%2C877%2C878","detail":"A frigid mountainous world, Scipio houses one of the primary vaults of the powerful InterGalactic Banking Clan, an institution critical to the economic health of the galaxy. During the Clone Wars, former Scipio Senator Rush Clovis discovered that the Banking Clan’s leaders had been funneling money to secret accounts, and the organization was in dire financial straits. Clovis exposed the corruption and became the Banking Clan’s leader, but he had been ensnared in a Sith plot. The Separatists invaded Scipio, leading to a swift Republic counterattack and a Separatist withdrawal. Clovis died in the fighting and Supreme Chancellor Palpatine took over the Banking Clan."},{"name":"Seatos","img":"https://lumiere-a.akamaihd.net/v1/images/seatos-main_3d95b7c5.jpeg?region=558%2C0%2C804%2C804","detail":"The world of Seatos boasts a lush landscape dominated by red forests and vast oceans. Along one coastal outcropping, a cliffside henge has been erected as a reflex point to uncover the secrets of an ancient star map.\n"},{"name":"Seelos","img":"https://lumiere-a.akamaihd.net/v1/images/seelos_e9aa0328.jpeg?region=187%2C0%2C877%2C878","detail":"A dusty and remote planet known for it's salty plains, Seelos was the home of Clone Captain Rex, and Clone Commanders Wolffe and Gregor during their retirement. A backdrop of distant blue mountains made up Seelos' landscape as the clones traveled the harsh terrain in their modified AT-TE hunting Joopas below the planet's surface."},{"name":"Senate District","img":"https://lumiere-a.akamaihd.net/v1/images/senate-district-main_827e117b.jpeg?region=667%2C0%2C806%2C807","detail":"On the highest levels of Coruscant, elected officials from around the galaxy stroll through the Imperial Senate District en route to business appointments and official hearings. The well-manicured section of the capital world is a pristine facade that conceals levels of corruption and greed below."},{"name":"Serenno","img":"https://lumiere-a.akamaihd.net/v1/images/databank_serenno_01_169_0541fc55.jpeg?region=341%2C0%2C878%2C878","detail":"Located deep within the borders of Separatist space was Serenno, Count Dooku's home planet and site of his ancestral lands. When Dooku turned his back on the Jedi Order, he reclaimed his title, wealth and territory, moving his base of operations to a cliff-side palace with a commanding view of the lush forests of his homeworld. Heavily cordoned by Separatist warships, Serenno was kept insulated from the worst of the Clone Wars battles, giving it a deceptively tranquil air."},{"name":"Setron","img":"https://lumiere-a.akamaihd.net/v1/images/setron-main_965e8534.jpeg?region=370%2C0%2C541%2C541","detail":"The jungle planet of Setron holds many secrets — and pungent aromas. Previously serving as the location of one of the Empire’s secret medical bases, the facility was abandoned, bombed out, and has now been given over to nature. But the slither vines and other Imperial experiments that have consumed the structure pose a deadly threat to all those who visit.\n"},{"name":"Shantipole","img":"https://lumiere-a.akamaihd.net/v1/images/shantipole_24049e91.jpeg?region=417%2C0%2C878%2C878","detail":"With a violent atmosphere of gas and lightning, Shantipole was avoided by most pilots and practically desolate. That’s what made it the perfect workplace for Quarrie, a master engineer and starfighter designer. It was on Shantipole that he toiled on his creations, far away from the watchful eye of the Empire. After years of work, he created the Blade Wing — a.k.a. the B-wing — and the rebel pilot Hera tested the experimental craft amidst Shantipole’s mountain spires and dactillions."},{"name":"Silla","img":"https://lumiere-a.akamaihd.net/v1/images/silla-main_4a02b8ae.jpeg?region=554%2C0%2C813%2C813","detail":"Life on the temperate world of Silla is usually slow-paced and serene, with villages spread over the soft grasslands. But in the age of the Empire, the arrival of a downed Imperial cruiser and its dangerous cargo brings an end to the culture, with citizens rounded up by soldiers and whisked away from their homes to quell the panic amid the chaos."},{"name":"Sinta Glacier Colony","img":"https://lumiere-a.akamaihd.net/v1/images/sinta-glacier-colony-main_4d62479b.jpeg?region=293%2C0%2C538%2C536","detail":"The massive Sinta glacier formed billions of years ago as the heart of a giant comet, and is now mined for valuable trace minerals. Poe Dameron flies the Millennium Falcon into the heart of the Sinta Glacier Colony to retrieve valuable intelligence from Boolio, a mine overseer sympathetic to the Resistance."},{"name":"Sith Citadel","img":"https://lumiere-a.akamaihd.net/v1/images/sith-citadel-main_fb35abe2.jpeg?region=140%2C0%2C536%2C535","detail":"Constructed centuries ago, the Sith Citadel broods over the barren plains of Exegol, its gloomy battlements lashed by lightning. Built above abyssal fissures reaching deep into the planet’s crust, the citadel is a locus of Sith power and the heart of Exegol’s sanctuary district."},{"name":"Skako Minor","img":"https://lumiere-a.akamaihd.net/v1/images/skako-minor-main_10443887.jpeg?region=647%2C0%2C546%2C544","detail":"Any trip to Skako Minor is punctuated by the planet's inscrutable elements, with ships immediately rattled and jostled by the unforgiving atmospheric disturbances upon arrival. In the murky, gaseous atmosphere, blustering winds and occasional electrical storms are hidden among the blinding yellow-hued fog. But rising above this gas layer stands the city of Purkoll."},{"name":"Skara Nal","img":"https://lumiere-a.akamaihd.net/v1/images/skara-nal-main_3cb7e165.jpeg?region=554%2C0%2C813%2C813","detail":"Skara Nal is a desolate place, uninhabitable by most sentient beings and creatures of the galaxy. There are no cities or other signs of civilizations on the vast, barren landscape, just fossilized rock and dull stone outcroppings marking the inhospitable resting place of a storied treasure."},{"name":"Skystrike Academy","img":"https://lumiere-a.akamaihd.net/v1/images/skystrike-academy_75b26d29.jpeg?region=81%2C0%2C878%2C878","detail":"One of the galaxy’s many Imperial training outposts, Skystrike Academy was an elite pilot school located in the atmosphere of Montross. Cadets, taught to follow orders no matter what, would train in simulator pods and fly in actual space before graduating to pilot status. Sabine Wren of the Ghost crew went undercover at Skystrike, where she extracted defectors Wedge Antilles and Hobbie Klivian, who would go on to become legendary rebel pilots."},{"name":"Snoke's Throne Room","img":"https://lumiere-a.akamaihd.net/v1/images/ep8-ff-006372_a8e2ed94.jpeg?region=280%2C0%2C720%2C720","detail":"At the heart of the massive Supremacy is a throne room where Supreme Leader Snoke presides over his regime, attended by mute alien navigators and his Elite Praetorian Guard. Both Kylo Ren and General Hux are summoned to “Snoke’s boudoir” to answer to the master of the First Order."},{"name":"Sorgan","img":"https://lumiere-a.akamaihd.net/v1/images/sorgan-main_a175bd85.jpeg?region=420%2C0%2C538%2C536","detail":"The peaceful planet of Sorgan is a green world dotted by ramshackle villages where farmers spend their days fishing for krill in the wetlands, the sound of their playing children ringing through the air. The world could be a place of respite were it not for Klatooinian raiders who threaten the peace."},{"name":"Sorgan Common House","img":"https://lumiere-a.akamaihd.net/v1/images/sorgan-common-house-main_ae4734f5.jpeg?region=516%2C0%2C535%2C536","detail":"Hunters and traders come to the Common House on Sorgan to sip bone broth and locally-made spotchka."},{"name":"Starkiller Base","img":"https://lumiere-a.akamaihd.net/v1/images/starkiller-base_36eb17b3.jpeg?region=607%2C0%2C633%2C636","detail":"Deep in the Unknown Regions, the First Order constructed a superweapon that used an entire planet as its weapons platform. The deadly Starkiller harvested energy from its system’s star, contained it within magnetic fields inside the planetary core, and then converted that energy into an ultra-powerful beam that blasted through hyperspace, able to sterilize the worlds of a distant star system with a single shot. Starkiller Base’s first shot obliterated the New Republic capital of Hosnian Prime. The planet was then destroyed in a daring Resistance raid."},{"name":"Starlight Beacon","img":"https://lumiere-a.akamaihd.net/v1/images/starlight-beacon-main_62ba7bff.jpeg?region=407%2C0%2C1080%2C1080","detail":"A symbol of hope and unity, the Starlight Beacon was constructed by the Republic, a space station at the edge of the Outer Rim dedicated to helping unify frontier and core worlds. But soon after it was put into service, the Nihil attacked Starlight, infiltrating the station and setting off a series of explosions that detroyed the beacon over Eiram."},{"name":"Stygeon Prime","img":"https://lumiere-a.akamaihd.net/v1/images/Stigeon-Prime_1ae0f647.jpeg?region=415%2C0%2C1201%2C1200","detail":"Stygeon Prime is a cold, mountainous world, and near desolate except for the massive tibidees that call it home. Located on Stygeon Prime is one of the galaxy's most fortified prisons: the Spire. During the Clone Wars, Darth Sidious imprisoned his former apprentice, Darth Maul, in the Spire, and the Empire later took control of the feared penitentiary."},{"name":"Sundari","img":"https://lumiere-a.akamaihd.net/v1/images/sundari-main_943c46d8.jpeg?region=238%2C0%2C544%2C544","detail":"The domed capital city of the Imperial-occupied Mandalore, Sundari sits in the deserts of the once green-covered world. The city has borne witness to many historic events: the death of Duchess Satine, the rise of Darth Maul as its ruler, and epic battles between clashing Mandalorian clans."},{"name":"Suria space station","img":"https://lumiere-a.akamaihd.net/v1/images/suria-space-station-main_da4cb82e.jpeg?region=307%2C1%2C540%2C540","detail":"On the space station orbiting the world of Suria, mercenaries and other travelers can dock their ships and find their next job — if they’re brave enough to walk the darkened corridors and tangle with some of the most feared assassins in the galaxy.\n"},{"name":"Syndulla Residence","img":"https://lumiere-a.akamaihd.net/v1/images/syndulla-residence_4439a94e.jpeg?region=341%2C0%2C878%2C878","detail":"The home of the Syndullas, including war hero Cham Syndulla and rebel Hera Syndulla, was a beautiful, towering structure that seemingly rose from the plains of the Tann province on Ryloth. During the Empire’s occupation of the planet, Captain Slavin turned the home into an Imperial headquarters. When Hera attempted to recover her family’s Kalikori, a precious Twi’lek heirloom, from the premises, she and fellow rebel Ezra Bridger were captured. Cham agreed to turn himself over in exchange for her daughter and Ezra; ever the freedom fighter, Hera used the prisoner exchange as an opportunity to destroy her own home -- striking at the Empire and earning a rebel victory."},{"name":"Takobo","img":"https://lumiere-a.akamaihd.net/v1/images/takobo_4aac4826.jpeg?region=683%2C0%2C877%2C878","detail":"Notable for its colorful, beautiful architecture that blended modern and classical sensibilities, Takobo was a peaceful world. It was also home to a large Ithorian population in an area known as Hammertown, where the Empire's Inquisitors would alarmingly track a Force-sensitive baby named Pypey. They would fail to capture the child, however; the Ghost crew rescued Pypey, and Ahsoka Tano fought and defeated the dark-side warriors in the capital city’s streets."},{"name":"Takodana","img":"https://lumiere-a.akamaihd.net/v1/images/takodana_37fe9f0e.jpeg?region=455%2C0%2C878%2C878","detail":"A lush green world in the galaxy’s Western Reaches, Takodana has long served as the base of operations for the diminutive pirate queen Maz Kanata, whose ancient castle is a haven for smugglers, brigands, scouts and spies from numerous worlds. Takodana has been largely spared war over the centuries, remaining neutral as galaxy-ruling regimes come and go around it."},{"name":"Tanda’s Cantina","img":"https://lumiere-a.akamaihd.net/v1/images/tandas-cantina-main_0ba49a9e.jpeg?region=370%2C0%2C541%2C541","detail":"With a bar tended by a former pit droid, Tanda’s Cantina is a bustling corner of the Suria space station. A dingy dive bathed in the warm glow of neon signs, droids are welcome, but the laws of the Empire don’t apply to patrons cutting deals with the galaxy’s bounty hunters. Brawls routinely break out, settled by blaster fire or blunt force trauma.\n"},{"name":"Tantiss vault","img":"https://lumiere-a.akamaihd.net/v1/images/the-bad-batch-310-highlights-vault_52dae93c.jpeg?region=370%2C0%2C541%2C541","detail":"Deep in the heart of Mount Tantiss, behind several layers of security, the most vital test subjects for Project Necromancer live imprisoned in the vault. Under constant observation, the children kept within these windowless cells are essential to Emperor Palpatine’s plans."},{"name":"Tarkintown","img":"https://lumiere-a.akamaihd.net/v1/images/image_7f54e7b5.jpeg?region=460%2C0%2C1181%2C1181","detail":"Tarkintown was a Lothal slum named for Grand Moff Tarkin. The inhabitants of the makeshift camp were forced from their farms by the Imperial commander; anyone who resisted was arrested for treason. The beleaguered group were grateful for any help they received, especially from a small team of rebels that fought back against the Imperial occupation."},{"name":"Tatooine","img":"https://lumiere-a.akamaihd.net/v1/images/tatooine-main_9542b896.jpeg?region=373%2C0%2C534%2C534","detail":"Tatooine is harsh desert world orbiting twin suns in the galaxy’s Outer Rim. In the days of the Empire and the Republic, many settlers scratched out a living on moisture farms, while spaceport cities such as Mos Eisley and Mos Espa served as home base for smugglers, criminals, and other rogues. Anakin Skywalker and Luke Skywalker both once called Tatooine home, although across the stars it was more widely known as a hive of scum and villainy ruled by the crime boss Jabba the Hutt. "},{"name":"Teth","img":"https://lumiere-a.akamaihd.net/v1/images/teth-main_aab2cc2e.jpeg?region=370%2C0%2C541%2C541","detail":"A jungle planet far from the more commonly traveled hyperspace routes, Teth lies deep in the wilds of Hutt-dominated space. Extending from the dense canopy are enormous mesas, atop which Hutt settlers and other shifty types build sanctuaries. Atop one such ridge stands the Teth Monastery, a converted B'omarr monk castle that was held by Separatist forces during the start of the Clone War and later served clone Captain Rex as a secret base in the age of the Empire."},{"name":"Teth Monastery","img":"https://lumiere-a.akamaihd.net/v1/images/teth-monastery-main_b1de2d62.jpeg?region=370%2C0%2C541%2C541","detail":"Once the sacred temple of the B’omarr monks, the monastery on Teth has served some less noble functions over the years. One of many palaces used by members of the Hutt Cartel, the estate was the site of Rotta the Hutt’s captivity during the Clone Wars. After the fall of the Republic, clone Captain Rex uses the reinforced structure as a hideout and homebase for his own secret operations in defense of clones throughout the galaxy.\n"},{"name":"The Aces' Lounge","img":"https://lumiere-a.akamaihd.net/v1/images/resistance-db-aces-lounge-main-image_6a04e9f9.jpeg?region=669%2C0%2C878%2C878","detail":"High up in Doza Tower, the best pilots on the Colossus platform relax in the Aces' Lounge in between races and important security details, keeping a close eye on political dealings and refueling their stomachs before the next assignment."},{"name":"The Armorer's forge","img":"https://lumiere-a.akamaihd.net/v1/images/the-armorer-s-forge-main_4453af82.jpeg?region=142%2C0%2C538%2C536","detail":"The Mandalorian method for forging beskar is a closely guarded secret, a skill passed on through generations to keep ancient armor intact and impervious. The Armorer decides what is suitable to forge, and she alone operates the equipment. "},{"name":"The Citadel","img":"https://lumiere-a.akamaihd.net/v1/images/databank_thecitadel_01_169_79701389.jpeg?region=398%2C0%2C878%2C878","detail":"The Citadel was intended as a flawless contingency for an unthinkable problem -- the stark prison was built to hold Jedi, should any in the Order ever turn against the Republic. Constructed 500 years before the Clone Wars, it fell to Separatist control when the planet Lola Sayu was conquered by the Confederacy early in that conflict. The Separatists populated the prison with battle droids, and used it to hold Republic captives. It is an imposing, heavily armed fortress seated atop a monolithic butte."},{"name":"The Graveyard of Ships","img":"https://lumiere-a.akamaihd.net/v1/images/graveyard-of-ships_6b4a6806.jpeg?region=44%2C0%2C1088%2C1091","detail":"After the Battle of Endor, the fragmented Empire made a last stand above the bleak frontier world of Jakku, battling a New Republic task force before retreating into the galaxy’s Unknown Regions. The battle left Jakku’s sands littered with wrecks of starfighters and capital ships from both sides. A generation later, Jakku’s scavengers eked out a living salvaging gear and components from the perilous area, now known as the Graveyard of Ships."},{"name":"the Lars homestead","img":"https://lumiere-a.akamaihd.net/v1/images/the-lars-homestead-main_97f14169.jpeg?region=244%2C0%2C538%2C536","detail":"Two generations of the Lars family sought to make a living on this hardscrabble farm on Tatooine, spending decades in the unforgiving climate coaxing moisture from the sandy planet's arid skies. Anakin Skywalker visited the farm in search of his mother Shmi, who’d married Cliegg Lars but been kidnapped by Tuskens. Later, Luke Skywalker grew up there, raised by Cliegg’s son Owen and his wife Beru while Obi-Wan Kenobi kept watch from afar. "},{"name":"The Lodge","img":"https://lumiere-a.akamaihd.net/v1/images/solo-db-the-lodge-main-image_7e189a44.jpeg?region=436%2C0%2C878%2C878","detail":"A rude, timber-framed hall adorned with animal heads, the Lodge serves the rough-and-tumble settlement of Fort Ypso as saloon, gambling hall, droid-fighting arena and hostel all in one. Adventurous scouts plan explorations at the bar, gamblers seek to reverse their fortunes at the sabacc table, and shadowed alcoves are perfect for conducting illicit business."},{"name":"The Outlander Club","img":"https://lumiere-a.akamaihd.net/v1/images/outlander-club_44eaa3e1.jpeg?region=70%2C0%2C699%2C700","detail":"A popular gambling den in Coruscant’s lower-level entertainment district, the Outlander Club appealed to wealthy citizens looking to go slumming for an evening and to criminals looking to profit from patrons’ debauched tastes. Anakin Skywalker and Obi-Wan Kenobi tracked the changeling bounty hunter Zam Wesell to the Outlander Club, disarming her and dragging her outside for questioning."},{"name":"The Protectors Camp","img":"https://lumiere-a.akamaihd.net/v1/images/the-protectors-camp_7cb399fb.jpeg?region=683%2C0%2C877%2C878","detail":"Located on the third moon of the Concord Dawn system, the Protectors Camp was the base of operations for Fenn Rau and his squad of Mandalorian warriors. Dubbed “the Protectors,” they watched over the system from this headquarters. While Rau was honorable, he acted in the name of the Empire thanks to a mutually beneficial agreement. After nearly wiping out the rebels’ Phoenix Squadron, however, the Protectors Camp was infiltrated by the Ghost crew’s Kanan and Sabine -- who destroyed many of the group’s ships before capturing Rau."},{"name":"The Spire","img":"https://lumiere-a.akamaihd.net/v1/images/image_97e32494.jpeg?region=420%2C0%2C1080%2C1080","detail":"Near impenetrable, the Spire is one of the galaxy's most notorious prisons. Sith Lord Darth Sidious used the Spire to hold his former apprentice, Darth Maul, during the Clone Wars; later, the Spire became an Imperial jail, and was blast-proof, ray-shielded, and protected by anti-ship weapons, TIE fighters, and scanners."},{"name":"The Titan","img":"https://lumiere-a.akamaihd.net/v1/images/titan-main_03476015.jpeg?region=387%2C27%2C429%2C429","detail":"A refueling station in the same design as the Colossus, the Titan is an important military target for the Resistance. By infiltrating the station, Resistance spies can steal valuable tech and parts to keep the Colossus fully operational."},{"name":"The Works","img":"https://lumiere-a.akamaihd.net/v1/images/the-works_d6d20718.jpeg?region=450%2C0%2C661%2C661","detail":"This largely abandoned industrial zone of Coruscant was once a manufacturing powerhouse known throughout the galaxy. The increasing cost of doing business on Coruscant sent the businesses elsewhere and this neglected industrial zone became the perfect spot for secret Sith meetings as they planned their moves in the Clone Wars."},{"name":"Theed Royal Palace","img":"https://lumiere-a.akamaihd.net/v1/images/theed-palace_84f09a19.jpeg?region=501%2C0%2C1040%2C1040","detail":"Overlooking the beautiful cliffs and waterfalls of Naboo’s capital, the Theed Royal Palace is the seat of government for the elected monarchs of the Naboo. The ornate and ancient building is often the ending point for grand parades, but during the Trade Federation’s blockade of the planet it became the site of great oppression until Queen Amidala and her retinue re-captured it for the freedom of her people."},{"name":"Thrawn's Office","img":"https://lumiere-a.akamaihd.net/v1/images/thrawns-office_d4cbbe06.jpeg?region=683%2C0%2C877%2C878","detail":"Grand Admiral Thrawn established a base of operations at the Lothal Imperial Factory, including an office from which he could strategize his next moves. Here, he would often examine art and clues he'd gathered in his quest to destroy the rebellion."},{"name":"tibidon carving station","img":"https://lumiere-a.akamaihd.net/v1/images/tibidon-carving-station-main_03f29978.png?region=1031%2C0%2C1486%2C1486","detail":"Ben Kenobi toils at a station where massive flying tibidon sand whales are carved up for their meat. After a long day of such grueling labor, Kenobi makes enough money to survive on Tatooine. The carcass of a massive tibidon sand whale has become a carving station operated by desperate but dedicated workers, who chop up the creature’s meat for sale in the city of Anchorhead. "},{"name":"Tipoca City","img":"https://lumiere-a.akamaihd.net/v1/images/tipoca-city-main_f68b446b.jpeg?region=369%2C0%2C542%2C542","detail":"The central hub of Kamino, Tipoca City serves as the seat of government and the location of the planet's lucrative cloning facilities. With the fall of the Republic, however, Prime Minister Lama Su begins to lose his standing and Imperial soldiers move in to permanently shut down the city."},{"name":"Tipoca City Training Facility","img":"https://lumiere-a.akamaihd.net/v1/images/tipoca-city-training-facility-main_c2c44514.jpeg?region=369%2C0%2C542%2C542","detail":"After the Clone War ends, the new Empire reappropriates Kamino training facilities to challenge the value of continuing to employ clone soldiers. In the training facility where many rookies proved their worth as cadets for the Republic, Admiral Tarkin uses devious tactics and live rounds to test the clones who remain, including assessing whether or not the unique soldiers in Clone Force 99 can learn to adhere to Imperial protocol."},{"name":"Torra's Quarters","img":"https://lumiere-a.akamaihd.net/v1/images/resistance-db-torras-quarters-main-image_cb5d4b9e.jpeg?region=341%2C0%2C878%2C878","detail":"She may be a racing prodigy, but Torra Doza still spends her downtime relaxing like other teenagers her age. On display inside her quarters are a number of trophies and other trinkets, including a stuffed Ewok, an Ortolan toy, a First Order stormtrooper doll, and a figure in Ubese armor."},{"name":"Tosche Station","img":"https://lumiere-a.akamaihd.net/v1/images/tosche-main_902cf8a6.jpeg?region=138%2C0%2C538%2C536","detail":"Tosche Station is the official name of a power station and general machine shop located on the outskirts of Anchorhead. Once a popular hangout for Tatooine teens, by the final years of the Empire's rule it had seen better days."},{"name":"Toydaria","img":"https://lumiere-a.akamaihd.net/v1/images/databank_toydaria_01_169_70b20e0e.jpeg?region=358%2C0%2C877%2C878","detail":"Toydaria is a world of fog, swamp, and forest. It played a key stragic role in the Clone Wars, as the planet's king, Katuunko, chose to stay neutral in the ongoing conflict. After a visit from Jar Jar Binks and Bail Organa, however, the king swore allegiance to the Republic, and allowed Toydaria to be used as a halfway point for supply delivery to clones."},{"name":"Trash incinerator","img":"https://lumiere-a.akamaihd.net/v1/images/resistance-db-trash-incinerator-main-image_afd945e4.jpeg?region=279%2C0%2C878%2C878","detail":"The Colossus platform has traded outdated trash compactor technology for the precision of an incinerator. When Torra Doza and Kazuda Xiono try to escape through the incinerator room, they must run for their lives, dodging the searing lasers that threaten to turn them into little more than scorch marks."},{"name":"Trask","img":"https://lumiere-a.akamaihd.net/v1/images/trask-main_61b08e44.jpeg?region=370%2C0%2C540%2C540","detail":"The moon of Trask orbits the gas giant Kol Iben. Trask's bountiful oceans are trawled by many fishing vessels that haul their cargoes to oceanside ports."},{"name":"Tuanul","img":"https://lumiere-a.akamaihd.net/v1/images/tuanul_db112f6f.jpeg?region=472%2C0%2C1040%2C1040","detail":"One of Jakku’s sacred villages, Tuanul is little more than a few wattle-and-daub huts clustered around a large vaporator cistern. Here, worshippers guided by the Force live simple, self-reliant lives in isolation. That isolation came to an abrupt and brutal end when First Order stormtroopers arrived seeking the retired explorer and spiritual seeker Lor San Tekka."},{"name":"Umbara","img":"https://lumiere-a.akamaihd.net/v1/images/databank_umbara_01_169_beef68c7.jpeg?region=558%2C0%2C877%2C878","detail":"Umbara, known as the \"Shadow World\" due to the rays of its sun never completely reaching its surface, is perpetually dark. The native wildlife have adapted to survive in such gloom, making the planet perpetually dangerous. Umbara was once part of the Galactic Republic, represented in the Senate by Senator Mee Deechi. Later in the Clone Wars, the planet's loyalty wavered and the natives of Umbara allied themselves with the Separatists, bringing their extremely advanced technology to the Separatist Alliance."},{"name":"Utapau","img":"https://lumiere-a.akamaihd.net/v1/images/databank_utapau_01_169_14a54eb1.jpeg?region=341%2C0%2C878%2C878","detail":"Ringed by numerous moons, the remote sanctuary of Utapau is a planet pitted with enormous sinkholes. Its windswept surface is dry and desert-like, but deep in the porous crust, at the bottom of the sinkholes are pools of life-giving water. Many of the sinkholes on one of the planet's small continents are lined with intricate cities that stretch deep into caves and crevices beneath the planet's surface, as well as mining operations that seek to uncover valuable minerals from the planet's depths."},{"name":"Vader’s Castle","img":"https://lumiere-a.akamaihd.net/v1/images/darth-vader-s-castle-main_a7b5db39.jpeg?region=262%2C0%2C756%2C756","detail":"An obsidian tower rising from the lava fields of Mustafar, Darth Vader’s personal redoubt sits above an ancient Sith cave that is a source of malignant power, as well as near the site of the former Anakin Skywalker’s maiming by Obi-Wan Kenobi. These twin connections help Vader channel his rage and pain into a focus for the dark side of the Force. After Vader’s death, the castle has become a pilgrimage site for cultists drawn to the Sith Lord’s legend."},{"name":"Vandor","img":"https://lumiere-a.akamaihd.net/v1/images/vandor-main_c1dfebb0.jpeg?region=257%2C0%2C867%2C867","detail":"An unspoiled frontier world with soaring mountains and endless plains, Vandor is sparsely settled and lacking the technological infrastructure common on other planets. But Vandor’s days as a refuge from the hurly-burly of galactic civilization are numbered: the Empire has a growing presence on the planet."},{"name":"Var-Shaa","img":"https://lumiere-a.akamaihd.net/v1/images/var-shaa-main_8d0c4ade.jpeg?region=379%2C0%2C523%2C523","detail":"Var-Shaa is a resource-rich planet in the Mid Rim known for its massive fjordlands and orbiting Imperial dockyard. Once a pivotal waypoint for the Imperial Navy at the height of its power, after the Battle of Endor, the Var-Shaa dockyard fell to a surprise attack by the New Republic, despite a valiant defense by the ISD Overseer and Titan Squadron. "},{"name":"Vardos","img":"https://lumiere-a.akamaihd.net/v1/images/vardos1_c7bdca8f.jpeg?region=274%2C0%2C877%2C878","detail":"Once an independent planet, Vardos was brought under Imperial control shortly after the end of the Clone War. A young Garrick Versio united the Jinata System under the Emperor’s banner, and Vardos became an Imperial utopia. Populated with Imperial installations, training grounds, and military bases, Vardos is also home to millions of loyal citizens. The stunning red soil of Vardos can be seen from space, as can its mountain ranges and oceans. But the planet’s jewel is Kestro, the capital city and Imperial hub. It is also the location of Vardos’ seminal Future Imperial Leaders Military Preparatory School, as well as Jinata Security’s headquarters."},{"name":"Vargo Spaceport","img":"https://lumiere-a.akamaihd.net/v1/images/vargo-spaceport-main_dc6a55e9.jpeg?region=280%2C0%2C720%2C720","detail":"Nestled in the Varkana system, the Vargo Spaceport is home to a simple marketplace where newcomers are easy to spot in the sparse crowd."},{"name":"Varkana","img":"https://lumiere-a.akamaihd.net/v1/images/varkana-main_f6013726.jpeg?region=313%2C0%2C720%2C720","detail":"The vast red planet Varkana is home to the Vargo Spaceport, a trading hub built into the otherwise unforgiving rocky terrain."},{"name":"Veelo","img":"https://lumiere-a.akamaihd.net/v1/images/veelo-main_2375fec6.jpeg?region=370%2C0%2C541%2C541","detail":"The world of Veelo holds many dangers for those who dare to tread here. The atmosphere is noxious for many travelers without proper equipment. But even those who survive their first steps must contend with mines dotting the murky waters and swamps teeming with hungry gryzards hunting for their next meal."},{"name":"Vizsla Keep 09","img":"https://lumiere-a.akamaihd.net/v1/images/vizsla-keep-09_06e8ef60.jpeg?region=645%2C0%2C877%2C878","detail":"Death Watch commander Pre Vizsla built a massive military operation during the Clone Wars, including secret bases spread throughout the galaxy. One such outpost was Vizsla Keep 09, which was hidden in the rings of Phelbos. Darth Maul, who’d assumed control of Mandalore after defeating Vizsla in combat, knew of the fort. During the Clone Wars, he brought Count Dooku and General Grievous to the Keep after capturing them on Ord Mantell; the Republic later tracked Maul there, leading to a battle between clones and Maul's Shadow Collective. Years later, Maul used it as a meeting point with the Ghost rebels, where he would join Sith and Jedi holocrons together to gain secret knowledge."},{"name":"Voxx Cluster","img":"https://lumiere-a.akamaihd.net/v1/images/voxx-cluster-main_5cbaa137.jpeg?region=204%2C0%2C720%2C720","detail":"An asteroid field surrounding a floating hotel and casino makes for an enticing and dangerous race course, a proving ground for young pilots who hunger for the thrill of overcoming dismal odds. The cluster is where Ace Pilot Hype Fazon got his start, and as he puts it, here \"You're either a great racer or a goner.\" "},{"name":"Vranki's Hotel and Casino","img":"https://lumiere-a.akamaihd.net/v1/images/vranki-hotel-and-casino-main_854bbebf.jpeg?region=471%2C0%2C720%2C720","detail":"Since the war erupted, business has been slow at Vranki's Hotel and Casino in the Voxx cluster, where security is enforced by two muscular Kowakian apes in comically small caps. But the Hutt proprietor's luck changes when his old friend Hype Fazon shows up itching to race. Unfortunately for the Rodian flyboy and his friends, the house always wins at Vranki's, and those odds extend to the dangerous race track through a nearby asteroid belt."},{"name":"Wayland","img":"https://lumiere-a.akamaihd.net/v1/images/wayland-main_7f6929d4.jpeg?region=554%2C0%2C813%2C813","detail":"On the world of Wayland, the Empire has hidden a secret military operation in the peak of Mount Tantiss. Concealed by the jagged landscape, deep underground Imperial scientists are continuing the work that began on Kamino, harnessing a deeper understanding of cloning technology at Emperor Palpatine's behest."},{"name":"White Worms' den","img":"https://lumiere-a.akamaihd.net/v1/images/solo-db-white-worms-den--main-image_84019d42.jpeg?region=0%2C0%2C878%2C878","detail":"The White Worms’ lair is a long-abandoned water-processing plant in an industrial area of Coronet City. A maze of tunnels leads to the surface; at their heart is a central cistern with blacked-out windows that protect the Grindalids from the damaging rays of Corellia’s sun. Here, Lady Proxima holds court over her scrumrats."},{"name":"Wobani","img":"https://lumiere-a.akamaihd.net/v1/images/wobani-main_604c623d.jpeg?region=6%2C0%2C675%2C675","detail":"A forlorn world in the Mid Rim’s Bryx sector, Wobani is the site of Imperial Detention Center & Labor Camp LEG-817. Jyn Erso is serving a 20-year sentence on Wobani under the alias Liana Hallik when Alliance Pathfinders free her from captivity."},{"name":"world between worlds","img":"https://lumiere-a.akamaihd.net/v1/images/world-between-worlds-main_b8a62aca.jpeg?region=558%2C0%2C804%2C804","detail":"Behind the ancient painting of the Mortis gods on the Lothal Jedi Temple is a world between worlds -- a collections of pathways and doors between time and space. Uncovered by the Empire, the Emperor sought entrance, as access would grant him unimaginable power. But the Padawan, Ezra Bridger, found the key to unlocking the world between worlds first, and would ultimately thwart Palpatine's plans."},{"name":"Wren Stronghold","img":"https://lumiere-a.akamaihd.net/v1/images/wren-stronghold_3a567cd5.jpeg?region=260%2C0%2C878%2C878","detail":"Clan Wren's base is a stunning, minimalist building made of steel and glass that blends elegantly with snowy Krownest landscape, a testament to Mandalorian adaptability, honor, and design."},{"name":"Wynkahthu","img":"https://lumiere-a.akamaihd.net/v1/images/wynkahthu_0c317076.jpeg?region=95%2C0%2C877%2C878","detail":"Wynkahthu, not far from Ord Mantell, was a gas giant with turbulent upper atmospheric storms, giving it a yellow appearance from space. An abandoned Imperial cargo ship was left adrift near Wynkahthu, and the Ghost crew, along with pirates Azmorigan and Hondo Ohnaka, went there on a mission to raid its weapons lot."},{"name":"Yarma","img":"https://lumiere-a.akamaihd.net/v1/images/yarma_148493f2.jpeg?region=341%2C0%2C878%2C878","detail":"Yarma was a planet shrouded in yellow clouds, and home to Reklam Station -- an Imperial savage yard. The station orbited the planet and sat in its mist, which made scanning of the yard a difficult task."},{"name":"Yavin 4","img":"https://lumiere-a.akamaihd.net/v1/images/databank_yavin4_01_169_b6945e20.jpeg?region=0%2C0%2C878%2C878","detail":"One of a number of moons orbiting the gas giant Yavin in the galaxy’s Outer Rim, Yavin 4 is a steamy world covered in jungle and forest. It was the location of the principal rebel base early in the Galactic Civil War, and the site from which the Rebellion launched the attack that destroyed the first Death Star -- a confrontation known thereafter as the Battle of Yavin."},{"name":"Yeager's garage","img":"https://lumiere-a.akamaihd.net/v1/images/resistance-db-yeagers-garage-main-image_854b64fa.jpeg?region=341%2C0%2C878%2C878","detail":"Home to Team Fireball where visitors to and inhabitants of the Colossus can  go for ship repairs. Inside Jarek Yeager's office, mementoes from his past cast the curmudgeonly mechanic in a whole new light. Among his personal possessions are shelves full of gleaming racing trophies, and a holo-photo that flicks between an image of Yeager in a Rebel flight suit celebrating victory at the Battle of Jakku and a portrait with a wife and child he rarely mentions."},{"name":"Yerbana","img":"https://lumiere-a.akamaihd.net/v1/images/yerbana-main_2ce0da45.jpeg?region=316%2C0%2C544%2C544","detail":"Near the end of the Clone Wars, the Jedi Council is forced to send its generals far from the Core Worlds as distant planets like Yerbana are embroiled in the conflict between the Separatists and the Republic."},{"name":"Yoda's Hut","img":"https://lumiere-a.akamaihd.net/v1/images/yodas-hut_a3d1133d.jpeg?region=208%2C0%2C1059%2C1056","detail":"After Darth Sidious defeated the Jedi, Yoda retreated to the remote swamp planet of Dagobah. While in exile, he dwelled in a simple hut he built among the roots of a massive gnarltree. There, among the insects and beasts of the swamp, the great Jedi Master delved into the mysteries of the Force and waited for a new hope of renewal for the Jedi Order."},{"name":"Zanbar","img":"https://lumiere-a.akamaihd.net/v1/images/databank_zanbar_01_100_cea4c007.jpeg?region=341%2C0%2C878%2C878","detail":"A moon used by the Mandalorian Death Watch as a temporary base during the Clone War, Zanbar is marked by stretches of swampy vegetation pierced by towering plateaus of striated rock. Death Watch settled a camp here sometime after abandoning a similar base on Carlac. It was on Zanbar that the Shadow Collective masterminded by Darth Maul began to take shape, and representatives from the Pykes and Black Sun convened here to plot their underhanded takeover of Mandalore."},{"name":"Zeffo","img":"https://lumiere-a.akamaihd.net/v1/images/zeffo_1b9445c4.jpeg?region=243%2C0%2C1080%2C1080","detail":"A mountainous, water-rich world located in the Outer Rim, Zeffo was once home to a small community of archaeologists and pioneers who ventured there from the core worlds of the Republic. The peaceful community was disrupted and ultimately destroyed when the Galactic Empire rose to power, starting with the pillaging of historical sites and sacred tombs, which ended only after excavations failed to turn up anything of immediate military value."},{"name":"Zygerria","img":"https://lumiere-a.akamaihd.net/v1/images/databank_zygerria_01_169_5cdad909.jpeg?region=341%2C0%2C878%2C878","detail":"Zygerria is a picturesque world with fortress-capped mesas that extend above windswept plains. Graceful brezak creatures catch the wind currents and soar effortlessly from butte to butte. The beauty of the planet hides the fact that Zygerria's cities were all built upon the backs of slaves. For thousands of years, Zygerria supplied slave labor the the galaxy; the Zygerrian Slave Empire became wealthy and powerful, as did those who exploited their chained subjects. After the Jedi Knights cracked down on the slave trade, Zygerria diminished. Its old fortresses and slave markets are still impressive edifices, though their luster has faded from time. Some Zygerrians are actively plotting a return to the old ways, and are finding eager allies in the Clone Wars."}]