[{"name":"A-wing Fighter","img":"https://lumiere-a.akamaihd.net/v1/images/screen_shot_2015-05-26_at_5_16a39e17.png?region=107%2C0%2C598%2C598","detail":"With its sleek arrowhead shape, streamlined cockpit, and massive twin engines, the A-wing starfighter suggests raw speed even when parked within Alliance hangar bays. Faster than even the TIE interceptor, the A-wing is well suited for lightning strikes. It sports a pair of pivoting laser cannons on each wingtip. The starfighters of Green Squadron, which flew in the Battle of Endor, were made up of A-wing starfighters. The A-wing continued to evolve, and was part of the Resistance’s starfighter corps during its fight against the First Order."},{"name":"A-wing trainer (RZ-1T)","img":"https://lumiere-a.akamaihd.net/v1/images/a-wing-trainer_72ac4ed9.jpeg?region=328%2C0%2C877%2C877","detail":"The RZ-1T, an A-wing trainer, featured room for two passengers, allowing for novice pilots to have an instructor on board. It was developed in the early days of the rebellion against the Empire, and used by Kanan and Ezra of the Ghost team."},{"name":"AA-9 Coruscant freighter","img":"https://lumiere-a.akamaihd.net/v1/images/aa-9-coruscant-freighter_a856053d.jpeg?region=349%2C0%2C667%2C665","detail":"In the days leading up to the Clone Wars, these ships were transports favored by refugees trying to escape Coruscant since travelers had no need to register themselves. It was for that reason that Jedi Master Mace Windu suggested this method of transportation to then-padawan Anakin Skywalker when he was escorting Senator Amidala back to Naboo after an attempt on her life. The ships were outfitted with everything needed to carry a massive amount of people of various species across the galaxy, including cafeterias and various servant droids."},{"name":"AAT Battle Tank","img":"https://lumiere-a.akamaihd.net/v1/images/databank_aatbattletank_01_169_9de46aea.jpeg?region=260%2C0%2C877%2C878","detail":"The marriage of repulsorlift technology and heavy armor has resulted in formidable floating tanks known as AATs. These assault tanks form the frontline of Trade Federation armored infantry divisions, as well as Separatist forces during the Clone Wars. A crew of battle droids drives the battle tank and operates the array of laser and projectile weaponry carried by the vehicle."},{"name":"Alderaan Cruiser","img":"https://lumiere-a.akamaihd.net/v1/images/databank_alderaancruiser_01_169_c60ce268.jpeg?region=255%2C0%2C877%2C878","detail":"Both Bail Organa and his adoptive daughter, Princess Leia, used their position in the Senate to benefit their heartfelt causes of freedom and to aid those that desperately needed it in war-weary times. Their consular vessels were afforded diplomatic immunity due to their ambassadorial status, and frequently ran mercy missions into dangerous territory. Bail's vessels of choice ranged from a streamlined diplomatic cruiser to the more rugged, war-ready Tantive IV that served as his transport to Toydaria during the Clone Wars. Alderaan cruisers were a key part of the rebel task force that rescued Kanan Jarrus from Mustafar, marking an escalation of anti-Imperial activities in the Outer Rim."},{"name":"Alderaan royal speeder","img":"https://lumiere-a.akamaihd.net/v1/images/alderaan-royal-speeder-main_4d3511f9.jpeg?region=558%2C0%2C804%2C804","detail":"For transport within the city of Aldera, between the spaceport and the palace, the Royal Family of Alderaan and its staff travels aboard roomy speeders with large windows that let the public see their passengers. "},{"name":"Anakin Skywalker's Podracer","img":"https://lumiere-a.akamaihd.net/v1/images/databank_anakinskywalkerspodracer_01_169_fe359d32.jpeg?region=553%2C0%2C877%2C878","detail":"Built in secret by the young slave Anakin Skywalker, this shiny blue and silver Podracer was boasted to be the fastest ever to compete in the Boonta Eve Classic. It wasn't idle puffery by its creator -- when thrown into the cutthroat racing competition, this Podracer's performance gave Anakin the edge he needed to win the race and his freedom. Smaller and leaner than all the other competing Podracers, Anakin's vehicle follows the same basic design found throughout the sport: a small cockpit pulled by two high-powered engines. The engines are locked to each other via an energy binder, and durable control cables connect the engines to the cockpit."},{"name":"Antique N-1 starfighter","img":"https://lumiere-a.akamaihd.net/v1/images/antique-n-1-starfighter-main_d9ea1e4a.jpeg?region=464%2C0%2C538%2C536","detail":"Long after the fall of the Republic, a handcrafted Naboo N-1 starfighter remains as a relic from a simpler time. In the hands of Peli Motto, such an artifact can be extensively modified to be truly one-of-a-kind, an off-the-grid combination of speed, precision, and style."},{"name":"ARC-170 Starfighter","img":"https://lumiere-a.akamaihd.net/v1/images/databank_arc170starfighter_01_169_f932abcb.jpeg?region=341%2C0%2C878%2C878","detail":"Protecting the skies over Republic worlds were specialized clone fighter forces flying the latest in starfighter technology. The ARC-170 fighter was a bulky, aggressive ship covered with weapons. Three clone trooper pilots operated this advanced combat craft, with a pilot handling the flight maneuvers, a copilot operating the laser cannons mounted on the ship's wide wings, and a tailgunner operating the dorsal rear-facing cannon. The fighter also carried an astromech droid for onboard repairs."},{"name":"AT-ACT walker","img":"https://lumiere-a.akamaihd.net/v1/images/at-act-walker_78783f1b.jpeg?region=309%2C0%2C541%2C542","detail":"A larger version of the standard combat AT-AT, the AT-ACT walker features a dedicated cargo bed for the transportation of heavy building materials or combat munitions. It was deployed at major Imperial construction projects, such as shipyards and sprawling research installations."},{"name":"AT-AT Walker (All Terrain Armored Transport)","img":"https://lumiere-a.akamaihd.net/v1/images/AT-AT_89d0105f.jpeg?region=263%2C0%2C780%2C781","detail":"The All Terrain Armored Transport, or AT-AT walker, is a four-legged transport and combat vehicle used by the Imperial ground forces. Standing over 20 meters tall with blast-impervious armor plating, these massive constructs are used as much for psychological effect as they are for tactical advantage."},{"name":"AT-DP Walker","img":"https://lumiere-a.akamaihd.net/v1/images/AT-DP_11f721ba.jpeg?region=537%2C0%2C1080%2C1080","detail":"AT-DP (All Terrain Defence Pod) walkers were among the fastest Imperial vehicles of their type, designed primarily for patrols and scouting missions. They had more nefarious purposes, however. When the Empire wanted more land on the Outer Rim planet of Lothal, AT-DPs were used to quickly clear out farmers from their property. The walking tanks were also employed to combat rebel threats, including the crew of the Ghost."},{"name":"AT-DT walker","img":"https://lumiere-a.akamaihd.net/v1/images/at-dt-main-b_ccc8b99d.jpeg?region=339%2C1%2C866%2C867","detail":"A stout two-legged walker, the All Terran Defense Turret, or AT-DT, is a mobile artillery piece designed to protect infantry and Imperial installations during ground combat. The AT-DT’s head is protected by extra layers of armor plating and shielding against artillery flashback."},{"name":"AT-Hauler","img":"https://lumiere-a.akamaihd.net/v1/images/solo-db-at-hauler-main-image-2_eb1daf05.jpeg?region=501%2C0%2C878%2C878","detail":"A specialized cargo vehicle, the AT-hauler deploys walkers on the battlefield. It can carry enormous loads thanks to powerful engines and heavy-duty cargo lifter arms augmented with tensile fields. A pilot handles flight operations, while a co-pilot takes responsibility for any cargo. Tobias Beckett’s gang steals an AT-hauler on Mimban to use in an audacious heist on Vandor."},{"name":"AT-M6 Walker","img":"https://lumiere-a.akamaihd.net/v1/images/at-m6-walker-main_99ddc753.jpeg?region=279%2C0%2C877%2C878","detail":"Lumbering armored beasts that are the latest generation in walkers, these enormous transports help the First Order secure the worlds of their expanding territories."},{"name":"AT-RT Walker","img":"https://lumiere-a.akamaihd.net/v1/images/databank_atrtwalker_01_169_dc4f22ad.jpeg?region=445%2C0%2C876%2C878","detail":"While clone troopers were best deployed in large numbers, articulated battlefield armor such as this Republic scout walker transformed a single clone trooper into a formidable anti-infantry unit. Designed primarily as a reconnaissance vehicle, this two-legged open-cockpit walker is nonetheless swift and heavily armed, letting a clone trooper cut through battle droids easily. It was employed in such campaigns as the Battle of Kashyyyk. It was the precursor to the All Terrain Scout Transport seen during the Galactic Civil War."},{"name":"AT-ST Walker","img":"https://lumiere-a.akamaihd.net/v1/images/e6d_ia_5724_a150e6d4.jpeg?region=548%2C0%2C801%2C802","detail":"While not as imposing as its larger AT-AT walker cousin, the AT-ST nonetheless served as a significant addition to the Imperial side of battlefields in the Galactic Civil War. The two-man craft is lightly armed with chin-mounted laser cannons, and side-mounted weapon pods. The two-legged transport, dubbed the scout walker by many, serves as a reconnaisance and patrol vehicle, often flanking approaching AT-ATs and mopping up infantry that sneaks past the larger walkers. The Imperials used AT-STs in both the Battle of Hoth and the Battle of Endor."},{"name":"AT-TE Walker","img":"https://lumiere-a.akamaihd.net/v1/images/at-te-main_09471f2b.jpeg?region=267%2C0%2C542%2C542","detail":"The principal battle tank of the Grand Army of the Republic, the All Terrain Tactical Enforcer features six articulated legs for propulsion. The legs are low to the ground, which reduces the walker's top speed but does provide it with increased stability. The body of the walker consists of two armored halves connected by a flexible sleeve that increases its mobility on the field. The walker is truly all terrain, able to climb sheer surfaces and survive in the vacuum of outer space.    The front of the walker is lined with four ball-turret laser cannons, while a single heavy projectile cannon is turret-mounted on the vehicle's dorsal surface. Its rear fire arc is protected by a pair of laser cannon turrets. Though the walker's armor can easily deflect small arms fire, tanksmasher rockets can pierce an AT-TE's armor and destroy its complex propulsion mechanisms."},{"name":"AV-7 Anti-vehicle Artillery Cannon","img":"https://lumiere-a.akamaihd.net/v1/images/a7-anti-vehicle-artillery-cannon_d7fb0e85.jpeg?region=449%2C0%2C663%2C663","detail":"These self-propelled artillery cannons were in use during the Clone Wars by the Grand Army of the Republic. Known as heavy cannons, they typically had four legs (though some moved via repulsorsled) that would spread out and stabilize the gun while it’s firing. It only required a single clone trooper to operate them, ma"},{"name":"B-wing Fighter","img":"https://lumiere-a.akamaihd.net/v1/images/databank_bwingfighter_01_169_460cc528.jpeg?region=450%2C0%2C877%2C878","detail":"Perhaps the oddest-looking starfighter in the Rebel Alliance fleet, the B-wing fighter is as powerful as it is ungainly. The ship's structure is almost entirely taken up by its primary airfoil, which houses a cylindrical cockpit on one end, an engine cluster in the center, and a heavy weapons pod at its base. Located just below the engine cluster are a pair of S-foils which can deploy to extend the firing arc of twin laser cannons. The B-wing's command pod has a unique gyroscopic control system. The pilot can orient it so that it always stays level with a horizon line. No matter which way the B-wing may maneuver laterally, its pilot remains upright."},{"name":"B-wing Prototype (Blade Wing)","img":"https://lumiere-a.akamaihd.net/v1/images/prototype-b-wing_4a86a3b4.jpeg?region=341%2C0%2C878%2C878","detail":"Created by Quarrie, a master engineer, the Blade Wing prototype — later nicknamed the B-wing — was unlike any starfighter previously known. It featured on-board ion cannons and proton torpedoes, advances in speed, and a gyroscopic rotating cockpit. Quarrie built the Blade Wing in secret on Shantipole, where the Empire had no presence. The craft would not take to the skies, however, until the arrival the rebels Hera, Sabine, and Zeb, who were looking for a powerful new starfighter to bust Imperial blockades.  Hera became the Blade Wing’s test pilot and shortly after took it into battle, where it decimated an Imperial battleship and led to a successful mission."},{"name":"BARC Speeder","img":"https://lumiere-a.akamaihd.net/v1/images/databank_barcspeeder_01_169_5fd4ce29.jpeg?region=35%2C0%2C877%2C878","detail":"An army is only as effective as its mobility, so the Grand Army of the Republic was outfitted with an increasingly varied and versatile vehicle pool as the Clone Wars progressed. The BARC speeder gave a single clone trooper increased operational range, great speed, mobility, and firepower otherwise unavailable to the foot soldier. A more aggressive and bulkier design than slimmer speeder bikes used by the Jedi, the BARC speeder was used in scouting and escort missions on a variety of worlds. They were easily adaptable, with support struts that could be added to hold a stretcher or sidecar."},{"name":"Bestoon Legacy","img":"https://lumiere-a.akamaihd.net/v1/images/bestoon-legacy-main_b723f688.jpeg?region=320%2C0%2C538%2C536","detail":"When Ochi of Bestoon met his end in a vexis burrow on Pasaana, his ship remained where he left it atop a nearby bluff. With the First Order having confiscated the Millennium Falcon, Poe Dameron and Finn revive the Bestoon Legacy for a hasty trip to Kijimi. Rey has a strange feeling that she’s seen the ship before, and will soon discover its story is bound up with her traumatic exile on Jakku."},{"name":"Black Ace","img":"https://lumiere-a.akamaihd.net/v1/images/resistance-db-black-ace-racer-main-image_000c700a.jpeg?region=168%2C0%2C878%2C878","detail":"Griff Hollaron has made a lot of special modifications himself to turn his own Imperial-issue TIE fighter into a unique and fearsome machine. Although his extensive refittings are regarded by some as a little too drastic, it's inarguable that he's created an aggressively powerful and aerodynamic machine."}]